Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: You are :ref:`developing <feature_development>` an application relying on OAuth2 or OpenID Connect to authenticate the users. You don't want to mock the calls to the identity provider in your unit tests, but you want to :ref:`perform real OAuth2/OIDC requests <feature_testing>`, and test your application against different identity provider tunings.
fr: Vous êtes en train de :ref:`développer <feature_development>` une application basée sur OAuth2 ou OpenID Connect pour authentifier les utilisateurs. Vous ne voulez pas masquer les appels vers le fournisseur d'identité pour les tests unitaires mais vous voulez :ref:`exécuter de véritables requêtes OAuth2/OIDC <feature_testing>`, et tester vos applications avec les différents réglages du fournisseur d'identité.

source: A lightweight IAM for developing
fr: Un GIA (IAM) léger pour le développement

source: You are :ref:`developing <feature_development>` an application relying on OAuth2 or OpenID Connect to authenticate the users. You need a :ref:`IAM server to develop <feature_development>` locally, but your old computer cannot bear launching a full Keycloak in a Docker container.
fr: Vous êtes en train de :ref:`développer <feature_development>` une application basée sur OAuth2 ou OpenID Connect pour authentifier les utilisateurs. Vous avez besoin d'un :ref:`serveur IAM pour développer <feature_development>` localement, mais votre vieil ordinateur ne peut pas lancer un Keycloak complet dans un conteneur Docker.

source: A lightweight IAM for CIs
fr: Un GIA (IAM) léger pour de l'Intégration Continue

source: You are :ref:`developing <feature_development>` an application relying on OAuth2 or OpenID Connect to authenticate the users. You need a IAM server that could can populate with custom data, and integrate in your :ref:`continuous integration environment <feature_ci>`.
fr: Vous êtes en train de :ref:`développer <feature_development>` une application basée sur OAuth2 ou OpenID Connect pour authentifier les utilisateurs. Vous avez besoin d'un serveur IAM server que vous pouvez remplir de données personnalisées et intégrer dans votre :ref:`environnement d'intégration continue <feature_ci>`.

source: OpenID Connect provider on top of a LDAP directory
fr: Fournisseur OpenID Connect au-dessus d'un annuaire LDAP

source: Your organization has an historic :ref:`LDAP directory <feature_databases>` and you want to add a :ref:`OpenID Connect <feature_oidc>` :abbr:`SSO (Single Sign-On)` layer on top of it, so users can use all your application while signin-in only once, without any data migration.
fr: Votre organisation a un :ref:`annuaire LDAP <feature_databases>` historique et vous voulez ajouter une couche :ref:`OpenID Connect <feature_oidc>` :abbr:`SSO (Single Sign-On)` au-dessus, pour que les utilisateurs puissent utiliser toutes vos applications tout en ne se connectant qu'une seule fois, sans aucune migration de données.

source: Profile edition of LDAP users
fr: Modification de profil d'utilisateurs LDAP

source: Your organization has a :ref:`LDAP directory <feature_databases>` and you want to provide a way to your users to :ref:`edit their personal information <feature_profile_management>` by themselves, without requiring any administrator intervention.
fr: Votre organisation a un :ref:`annuaire LDAP <feature_databases>` et vous voulez fournir une façon à vos utilisateurs de :ref:`modifier leurs informations personnelles <feature_profile_management>` par eux-mêmes, sans nécessiter l'intervention d'un administrateur.

source: Password recovery with a LDAP directory
fr: Récupération de mot de passe avec un annuaire LDAP

source: Your organization has an historic :ref:`LDAP directory <feature_databases>` and you want to provide a way to your users to :ref:`recover their password <feature_password_recovery>` when they cannot remember it, without any administrator intervention.
fr: Votre organisation a un :ref:`annuaire LDAP <feature_databases>` historique et vous voulez fournir une façon à vos utilisateurs de :ref:`récupérer leur mot de passe <feature_password_recovery>` quand ils ne s'en rappellent plus, sans intervention d'un administrateur.

source: A CLI to quickly edit LDAP directory users
fr: Une interface en ligne de commande pour modifier rapidement les utilisateurs d'un annuaire LDAP

source: Your organization has an historic :ref:`LDAP directory <feature_databases>`. You are tired to deal with *ldif* syntax to manage your users and group and would prefer a simple human-readable CLI.
fr: Votre organisation a un :ref:`annuaire LDAP <feature_databases>` historique. Vous êtes fatigué d'utiliser la syntaxe *ldif* pour gérer vos utilisateurs et groupes, et préférez utiliser une ligne de commande simple et lisible par les humains.
