Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: The value SHOULD be specified according to [RFC5321]. Service providers SHOULD canonicalize the value according to [RFC5321], e.g., "bjensen@example.com" instead of "bjensen@EXAMPLE.COM". The "display" sub-attribute MAY be used to return the canonicalized representation of the email value. The "type" sub-attribute is used to provide a classification meaningful to the (human) user. The user interface should encourage the use of basic values of "work", "home", and "other" and MAY allow additional type values to be used at the discretion of SCIM clients.
fr: La valeur DOIT être en accord avec [RFC5321]. Les fournisseurs de service DOIT normaliser la valeur en fonction de [RFC5321], par exemple « bjensen@example.com » à la place de « bjensen@EXAMPLE.COM ». Le sous-attribut « display » PEUT être utilisé pour retourner la représentation normalisée de l'adresse email. Le sous-attribut « type » est utilisé pour fournir une classification significative pour l'utilisateur (humain). L'interface utilisateur devrait encourager l'utilisateur des valeurs basiques « work », « home » et « other » et PEUT autoriser des types additionnels pouvant être utilisés à la discrétion des clients SCIM.

source: A string identifier, typically numeric or alphanumeric, assigned to a person, typically based on order of hire or association with an organization.
fr: Un identifiant en chaîne de caractères, généralement numérique ou alphanumérique, assigné à une personne, généralement basée sur l'ordre d'embauche ou d'association avec une organisation.

source: The family name of the User, or last name in most Western languages (e.g., "Jensen" given the full name "Ms. Barbara Jane Jensen, III").
fr: Le nom de famille de l'utilisateur, ou le patronyme (e.g., "Jensen" given the full name "Ms. Barbara Jane Jensen, III").

source: The full mailing address, formatted for display or use with a mailing label.
fr: L'adresse e-mail complète, formatée pour l'affichage ou l'utilisation avec un label de mailing.

source: This attribute MAY contain newlines.
fr: Cet attribut PEUT contenir des retours à la ligne.

source: The full name, including all middle names, titles, and suffixes as appropriate, formatted for display (e.g., "Ms. Barbara Jane Jensen, III").
fr: Le nom complet, incluant tous les prénoms, titres et suffixes appropriés, formatés pour l'affichage (e.g., "Mme. Barbara Jane Jensen, III").

source: The given name of the User, or first name in most Western languages (e.g., "Barbara" given the full name "Ms. Barbara Jane Jensen, III").
fr: Le nom courant de l'utilisateur, ou prénom dans la plupart des langues occidentales (par exemple., "Barbara" dans le nom complet "Ms. Barbara Jane Jensen, III").

source: A list of groups to which the user belongs, either through direct membership, through nested groups, or dynamically calculated.
fr: Une liste de groupes auxquels l'utilisateur appartient, soit par appartenance directe, soit par groupes imbriqués ou calculés dynamiquement.

source: The values are meant to enable expression of common group-based or role-based access control models, although no explicit authorization model is defined. It is intended that the semantics of group membership and any behavior or authorization granted as a result of membership are defined by the service provider. The canonical types "direct" and "indirect" are defined to describe how the group membership was derived. Direct group membership indicates that the user is directly associated with the group and SHOULD indicate that clients may modify membership through the "Group" resource. Indirect membership indicates that user membership is transitive or dynamic and implies that clients cannot modify indirect group membership through the "Group" resource but MAY modify direct group membership through the "Group" resource, which may influence indirect memberships. If the SCIM service provider exposes a "Group" resource, the "value" sub-attribute MUST be the "id", and the "$ref" sub-attribute must be the URI of the corresponding "Group" resources to which the user belongs. Since this attribute has a mutability of "readOnly", group membership changes MUST be applied via the "Group" Resource (Section 4.2). This attribute has a mutability of "readOnly".
fr: Les valeurs sont faites pour activer l'expression de modèles au contrôle d'accès basé sur les rôles ou basé sur des groupes communs, bien qu'aucun modèle d'autorisation explicite n'est défini. Il est prévu que les sémantiques des membres de groupe et n'importe quel comportement ou autorisation donnée comme résultat de l'appartenance sont définies par le fournisseur de service. Les type canoniques « direct » et « indirect » sont définis pour décrire comment l'appartenance au groupe était dérivé. L'appartenance directe au groupe indique que l'utilisateur est directement associé avec le groupe et DEVRAIT indiquer que les clients peuvent modifier l'appartenance au travers de la ressource Groupe. L'appartenance indirecte au groupe indique que l'appartenance de l'utilisateur est transitive ou dynamique et implique que les clients ne peuvent pas modifier une appartenance indirecte au groupe au travers de la ressource Groupe mais PEUVENT modifier l'appartenance directe au groupe au travers de la ressource Groupe, ce qui peut influencer l'appartenance indirecte. Si le fournisseur de service SCIM expose une ressource Groupe, le sous-attribut « value » DOIT être l'« id » et le sous-attribut « $ref »doit être l'URI des ressources Groupe correspondantes auxquelles l'utilisateur appartient. Puisque cet attribut a une mutabilité en lecture seule, l'appartenance du groupe DOIT être appliquée via la Ressource Groupe (section 4.2). Cet attribut a la mutabilité en lecture seule (« readOnly»).

source: Check whether a password has been set for the user.
fr: Vérifie si un mot de passe a été définie pour l'utilisateur.

source: HMAC-based One Time Password counter, used for multi-factor authentication.
fr: Compteur de mots de passes à usage unique HMAC. Utilisé pour l'authentification multi-facteurs.

source: The city or locality component.
fr: Le composant de ville ou de localité.

source: A DateTime indicating when the resource was locked.
fr: Une date (DateTime) indiquant quand la ressource a été verrouillée.

source: Whether the user account has been locked or has expired.
fr: Si le compte utilisateur a été verrouillé ou a expiré.

source: One time password used for email or sms multi-factor authentication.
fr: Mot de passe à usage unique utilisé pour l'authentification multi-facteurs par email ou SMS.

source: Identifies the name of an organization.
fr: Identifie le nom de l'organisation.

source: This attribute is intended to be used as a means to set, replace, or compare (i.e., filter for equality) a password. The cleartext value or the hashed value of a password SHALL NOT be returnable by a service provider. If a service provider holds the value locally, the value SHOULD be hashed. When a password is set or changed by the client, the cleartext password SHOULD be processed by the service provider as follows:
fr: Cette attribut a pour but d'être utilisé pour définir, remplacer ou comparer (c'est-à-dire fitrer par égalité) un mot de passe. La valeur en clair ou hashée du mot de passe NE DEVRAIT PAS être retournable par le fournisseur de service. Si un fournisseur de service détient la valeur localement, la valeur DEVRAIT être hashée. Quand un mot de passe est défini ou changé par le client, le mot de passe en clair DEVRAIT être traité par le fournisseur de service comme suit :

source: Prepare the cleartext value for international language comparison. See Section 7.8 of [RFC7644].
fr: Prépare la valeur en clair pour une comparaison de langue internationale. Voir la section 7.8 de [RFC7644].

source: Validate the value against server password policy. Note: The definition and enforcement of password policy are beyond the scope of this document.
fr: Valide la valeur contre la politique du mot de passe serveur. Note : La définition et les contraintes de la politique de mot de passe sont hors du périmètre de ce document.

source: Ensure that the value is encrypted (e.g., hashed). See Section 9.2 for acceptable hashing and encryption handling when storing or persisting for provisioning workflow reasons.
fr: Force que le valeur soit cryptée (par exemple, hashée). Voir la section 9.2 pour un hash acceptable et la gestion de chiffrement quand l'enregistrement et la persistance pour des raisons de suivi de fourniture.

source: A service provider that immediately passes the cleartext value on to another system or programming interface MUST pass the value directly over a secured connection (e.g., Transport Layer Security (TLS)). If the value needs to be temporarily persisted for a period of time (e.g., because of a workflow) before provisioning, then the value MUST be protected by some method, such as encryption.
fr: Un fournisseur de service qui passe immédiatement la valeur en clair à un autre système ou interface de programmation DOIT passer la valeur directement sur une connexion sécurisé (e.g., Transport Layer Security (TLS)). Si la valeur a besoin d'être temporairement persistée pour une période de temps (e.g., à cause du processus utilisé) avant son transfert, alors la valeur DOIT être protégée par diverses méthode, tel que le chiffrement.

source: Testing for an equality match MAY be supported if there is an existing stored hashed value. When testing for equality, the service provider:
fr: Tester l'égalité PEUT être gérée si une valeur hashée enregistrée existe. Quand un test d'égalité est fait, le fournisseur du service :

source: Prepares the filter value for international language comparison. See Section 7.8 of [RFC7644].
fr: Prépare la valeur du filtre pour une comparaison de langue internationale. Voir la section7.8 de [RFC7644].

source: Generates the salted hash of the filter value and tests for a match with the locally held value.
fr: Génère le hash salé de la valeur du filtre et teste la correspondance avec la valeur locale.

source: The mutability of the password attribute is "writeOnly", indicating that the value MUST NOT be returned by a service provider in any form (the attribute characteristic "returned" is "never").
fr: La mutabilité de l'attribut password est "writeOnly" (écriture seule), indiquant que la valeur NE DOIT PAS être renvoyée par un fournisseur de service sous quelque forme que ce soit (la caractéristique "returned" de l'attribut est "never").

source: This attribute stores the timestamps of the user's failed authentications.
fr: Cet attribut stocke les dates des tentatives de connexions infructueuses de l'utilisateur.

source: It's currently used by the intruder lockout delay system.
fr: C'est actuellement utilisé par le système de blocage des connexions infructueuses.

source: Specifies the last time the user password was changed. By default, the date of creation of the password is retained.
fr: Indique la dernière fois où le mot de passe utilisateur a été changé. Par défaut, c'est la date de création du mot de passe qui est utilisée.

source: Phone numbers for the user.
fr: Numéros de téléphone pour l'utilisateur.

source: The value SHOULD be specified according to the format defined in [RFC3966], e.g., 'tel:+1-201-555-0123'. Service providers SHOULD canonicalize the value according to [RFC3966] format, when appropriate. The "display" sub-attribute MAY be used to return the canonicalized representation of the phone number value. The sub- attribute "type" often has typical values of "work", "home", "mobile", "fax", "pager", and "other" and MAY allow more types to be defined by the SCIM clients.
fr: La valeur DOIT être spécifiée en accord avec le format défini dans [RFC3966], par exemple, 'tel:+33123456789'. Les fournisseurs de service DOIVENT normaliser la valeur selon le format [RFC3966], quand cela est approprié. Le sous-attribut "display" PEUT être utilisé pour renvoyer la représentation normalisée de la valeur du numéro de téléphone. Le sous-attribut "type" prend souvent les valeurs habituelles de "work", "home", "mobile", "fax", "pager", et "other" et PEUT autoriser d'autres types définis par les clients SCIM.

source: A URI that is a uniform resource locator (as defined in Section 1.1.3 of [RFC3986]) that points to a resource location representing the user's image.
fr: Une URI qui est une URL (telle que définie dans la section 1.1.3 de [RFC3986]) pointant vers la localisation de la ressource représentant l'image de l'utilisateur.

source: The resource MUST be a file (e.g., a GIF, JPEG, or PNG image file) rather than a web page containing an image. Service providers MAY return the same image in different sizes, although it is recognized that no standard for describing images of various sizes currently exists. Note that this attribute SHOULD NOT be used to send down arbitrary photos taken by this user; instead, profile photos of the user that are suitable for display when describing the user should be sent. Instead of the standard canonical values for type, this attribute defines the following canonical values to represent popular photo sizes: "photo" and "thumbnail".
fr: La ressource DOIT être un fichier (par exemple une image au format GIF, JPEG, ou PNG) plutôt qu'une page web contenant une image. Les fournisseurs de service PEUVENT retourner la même image dans différentes tailles, bien qu'il n'existe pas actuellement de standard pour décrire les images de différentes tailles. Notez que cet attribut NE DEVRAIT PAS être utilisé pour envoyer n'importe quelle photo prise par cet utilisateur mais plutôt les photos de profil de l'utilisateur affichable quand une description l'utilisateur devrait être envoyé. À la place des valeurs canoniques standard pour le type, cet attribut définit les valeurs canoniques suivantes pour représenter les tailles de photo populaire : « photo » et « vignette ».

source: The zip code or postal code component.
fr: Le composant code zip ou postal.

source: Indicates the user's preferred written or spoken languages and is generally used for selecting a localized user interface.
fr: Indique la langue préférée de l'utilisateur, parlée ou écrite, et est généralement utilisée pour sélectionner la langue de l'interface utilisateur.

source: The value indicates the set of natural languages that are preferred. The format of the value is the same as the HTTP Accept-Language header field (not including "Accept-Language:") and is specified in Section 5.3.5 of [RFC7231]. The intent of this value is to enable cloud applications to perform matching of language tags [RFC4647] to the user's language preferences, regardless of what may be indicated by a user agent (which might be shared), or in an interaction that does not involve a user (such as in a delegated OAuth 2.0 [RFC6749] style interaction) where normal HTTP Accept-Language header negotiation cannot take place.
fr: La valeur indique l'ensemble des langues naturelles qui sont préférées. Le format de la valeur est la même que le champ d'en-tête HTTP Accept-Language (sans inclure « Accept-Language: » et est défini dans la section 5.3.5 de [RFC7231]. Le but de cette valeur est d'activer les applications cloud à exécuter une correspondance des étiquettes de langue [RFC4647] avec les préférences de langues de l'utilisateur, sans prendre en compte ce que le user-agent (qui pourrait être partagé) pourrait indiquer, ou dans un interaction qui n'implique pas un utilisateur (tel que dans une interaction du type d'OAuth 2.0 déléguée [RFC6749]) où il n'y a pas de negociation avec l'en-tête HTTP Accept-Language.

source: A URI that is a uniform resource locator (as defined in Section 1.1.3 of [RFC3986]) and that points to a location representing the user's online profile (e.g., a web page).
fr: Une URI qui est une URL (tel que définie dans une section 1.1.3 de [RFC3986]) et pointant à une localisation représentant le profil en ligne de l'utilisateur (par exemple une page web).

source: URIs are canonicalized per Section 6.2 of [RFC3986].
fr: Les URI sont au format canonique selon la section 6.2 de [RFC3986].

source: The fields the user can read according to the :class:`configuration <canaille.core.configuration.ACLSettings>` configuration.
fr: Les champs que l'utilisateur peut lire dans la configuration de :class:`configuration <canaille.core.configuration.ACLSettings>`.

source: This does not include the :attr:`writable <canaille.core.models.User.writable_fields>` fields.
fr: Cela n'inclut pas les champs :attr:`writable <canaille.core.models.User.writable_fields>`.

source: The state or region component.
fr: Le composant État ou région.

source: Unique token generated for each user, used for multi-factor authentication.
fr: Jeton unique généré pour chaque utilisateur, utilisé pour l'authentification multi-facteurs.

source: The full street address component, which may include house number, street name, P.O.
fr: Le composant d'adresse rue complète, qui peut inclure le numéro de la maison, le nom de la rue, code

source: box, and multi-line extended street address information. This attribute MAY contain newlines.
fr: postal et les informations de rue étendues sur plusieurs lignes. Cet attribut PEUT contenir des retours à la ligne.

source: The user's title, such as "Vice President".
fr: Le titre de l'utilisateur, par exemple "Vice Président".

source: A service provider's unique identifier for the user, typically used by the user to directly authenticate to the service provider.
fr: L'identifiant unique de l'utilisateur pour un fournisseur de service, généralement utilisé par l'utilisateur pour s'authentifier directement auprès de ce fournisseur de service.

source: Often displayed to the user as their unique identifier within the system (as opposed to "id" or "externalId", which are generally opaque and not user-friendly identifiers). Each User MUST include a non-empty userName value. This identifier MUST be unique across the service provider's entire set of Users. This attribute is REQUIRED and is case insensitive.
fr: Souvent affiché à l'utilisateur comme leur identifiant unique dans le système (au contraire de "id" ou "externalId", qui sont généralement des identifiants opaques et non conviviaux). Chaque utilisateur DOIT inclure une valeur de userName non vide. Cet identifiant DOIT être unique parmi tous les Users (utilisateurs) du fournisseur de service. Cet attribut est OBLIGATOIRE et n'est pas sensible à la casse.

source: The fields the user can write according to the :class:`configuration <canaille.core.configuration.ACLSettings>`.
fr: Les champs que l'utilisateur peut modifier selon la :class:`configuration <canaille.core.configuration.ACLSettings>`.

source: Add leading 0 if the code length does not match the defined length.
fr: Ajoute des 0 au début si la longueur du code ne correspond pas la longueur définie.

source: For instance, parameter ``digit=6``, but ``code=123``, this method would return ``000123``:
fr: Par exemple, avec le paramètre ``digit=6`` et le ``code=123``, cette méthode retournerait ``000123`` :

source: OpenID Connect temporary authorization code definition.
fr: Définition du code temporaire d'autorisation OpenID Connect.

source: Time when the End-User authentication occurred.
fr: Heure à laquelle l’authentification de l’utilisateur final a eu lieu.

source: OpenID Connect client definition.
fr: Définition de client OpenID Connect.

source: Based on the :rfc:`OAuth 2.0 Dynamic Client Registration protocols <7591>` and the `OpenID Connect RP-Initiated Logout <https://openid.net/specs/openid-connect-rpinitiated-1_0.html>`_ specifications.
fr: Basée sur les protocoles `OAuth 2.0 Dynamic Client Registration <https://datatracker.ietf.org/doc/html/rfc7591.html>`_ et les spécifications `OpenID Connect RP-Initiated Logout <https://openid.net/specs/openid-connect-rpinitiated-1_0.html>`_.

source: OAuth 2.0 client identifier string. It SHOULD NOT be currently valid for any other registered client, though an authorization server MAY issue the same client identifier to multiple instances of a registered client at its discretion.
fr: Chaîne de caractères contenant l'identifiant du client OAuth 2.0. L'identifiant NE DOIT PAS être actuellement valide pour un autre client inscrit, bien qu'un serveur d'autorisation PUISSE donner le même identifiant client à plusieurs instances d'un client inscrit à sa discrétion.

source: OPTIONAL.
fr: OPTIONNEL.

source: Time at which the client identifier was issued. The time is represented as the number of seconds from 1970-01-01T00:00:00Z as measured in UTC until the date/time of issuance.
fr: La date à laquelle l'identifiant client a été émis. La date est représentée comme le nombre de secondes écoulées depuis 1970-01-01T00:00:00Z mesuré en UTC jusqu'à la date d'émission.

source: Human-readable string name of the client to be presented to the end-user during authorization.
fr: Le nom du client à présenter à l'utilisateur final durant l'autorisation, sous la forme d'une chaîne de caractères lisible par un être humain.

source: If omitted, the authorization server MAY display the raw "client_id" value to the end-user instead. It is RECOMMENDED that clients always send this field. The value of this field MAY be internationalized, as described in Section 2.2.
fr: Si omis, le serveur d'autorisation PEUT afficher la valeur brute "client_id" à l'utilisateur final à la place. Il est RECOMMANDÉ que les clients envoient toujours ce champ. La valeur de ce champ PEUT être internationalisée, comme décrit dans la Section 2.2.

source: OAuth 2.0 client secret string. If issued, this MUST be unique for each "client_id" and SHOULD be unique for multiple instances of a client using the same "client_id". This value is used by confidential clients to authenticate to the token endpoint, as described in OAuth 2.0 [RFC6749], Section 2.3.1.
fr: Chaîne secrète du client OAuth 2.0. Si généré, il DOIT être unique pour chaque « client_id » et DEVRAIT être unique pour de multiple instances du client utilisant le même « client_id ». Cette valeur est utilisée par des clients confidentiels pour authentifier le terminal du jeton, tel que décrit dans OAuth 2.0 [RFC6749], Section 2.3.1.

source: REQUIRED if "client_secret" is issued.
fr: REQUIS si "client_secret" est émis.

source: Time at which the client secret will expire or 0 if it will not expire. The time is represented as the number of seconds from 1970-01-01T00:00:00Z as measured in UTC until the date/time of expiration.
fr: La date à laquelle le secret du client va expirer ou 0 s'il n'expire pas. La date est représentée comme le nombre de secondes écoulées depuis 1970-01-01T00:00:00Z mesuré en UTC jusqu'à la date d'expiration.

source: URL string of a web page providing information about the client.
fr: URL d'une page web fournissant des informations à propos du client.

source: If present, the server SHOULD display this URL to the end-user in a clickable fashion. It is RECOMMENDED that clients always send this field. The value of this field MUST point to a valid web page. The value of this field MAY be internationalized, as described in Section 2.2.
fr: Si présent, le serveur DEVRAIT afficher cette URL à l'utilisateur final de manière cliquable. Il est RECOMMANDÉ que les clients envoient toujours ce champ. La valeur de ce champ DOIT pointer vers une page web valide. La valeur de ce champ DEVRAIT être internationalisée, comme décrit dans la section 2.2.

source: Array of strings representing ways to contact people responsible for this client, typically email addresses.
fr: Un tableau de chaînes de caractères représentant différentes façon de contacter les personnes responsables de ce client, généralement des adresses e-mail.
