Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: Here are the different features that Canaille provides. You can enable any of those features with the :doc:`configuration <references/configuration>` to fit any :doc:`use cases <usecases>` you may meet. Check our :ref:`roadmap <features:Roadmap>` to see what is coming next.
fr: Voici les différentes fonctionnalités que Canaille propose. Vous pouvez activer n’importe laquelle de ces fonctionnalités avec la :doc:`configuration <references/configuration>` pour que Canaille s’adapte au :doc:`cas d’usage <usecases>` que vous rencontrez. Jetez un œil à notre :ref:`feuille de route <features:Roadmap>` pour savoir ce qui arrive dans le futur.

source: Users can interact with Canaille through its :ref:`web interface <features:Web interface>` and administrators can also use its :ref:`command line interface <feature_cli>`. Canaille can handle data stored in different :ref:`database backends <feature_databases>`.
fr: Les utilisateurs peuvent interagir avec Canaille grâce à son :ref:`web interface <features:interface web>` et les administrateurs peuvent aussi utiliser son :ref:`interface en ligne de commande <feature_cli>`. Canaille peut enregistrer les données dans différentes :ref:`bases de données <feature_databases>`.

source: User and group management
fr: Gestion d’utilisateurs et de groupes

source: Canaille web interface can be used either in :doc:`production environments <tutorial/deployment>` or locally for development purposes.
fr: L'interface web de Canaille web interface peut être utilisé dans des :doc:`environnements de production <tutorial/deployment>` ou localement pour permettre les développements.

source: Profile management
fr: Gestion de profil

source: The user profile edition page.
fr: La page d'édition de profil utilisateur.

source: Canaille provides an interface to manage user profiles.
fr: Canaille fournit une interface pour gérer les profils utilisateur.

source: The exact list of displayed fields, and whether they are :attr:`writable <canaille.core.configuration.ACLSettings.WRITE>` or :attr:`read-only <canaille.core.configuration.ACLSettings.READ>` depends on the user :class:`Access Control List settings (ACL) <canaille.core.configuration.ACLSettings>`.
fr: La liste exacte des champs affichés ainsi que s'ils sont accessible en :attr:`écriture <canaille.core.configuration.ACLSettings.WRITE>` ou en :attr:`lecture seule <canaille.core.configuration.ACLSettings.READ>` dépend du paramètre utilisateur :class:`liste de contrôle d'accès (ACL) <canaille.core.configuration.ACLSettings>`.

source: Depending on their ACL :class:`permissions <canaille.core.configuration.Permission>`, users can either be allowed to edit their own profile, edit any user profile, or do nothing at all.
fr: Selon les :class:`droits <canaille.core.configuration.Permission>` de leur liste de contrôle d'accès (ACL) , les utilisateurs peuvent soit modifier leur profil, modifier le profil de n'importe quel utilisateur ou ne rien faire du tout.

source: Email confirmation
fr: Confirmation de l'e-mail

source: If the :attr:`email confirmation feature <canaille.core.configuration.CoreSettings.EMAIL_CONFIRMATION>` is enabled, any modification or addition of a profile email will send a confirmation mail to the new address. The mail will contain a link that users will need to click on to confirm their email address.
fr: Si la :attr:`fonctionnalité de confirmation d'e-mail <canaille.core.configuration.CoreSettings.EMAIL_CONFIRMATION>` est activée, toute modification ou ajout de profil enverra un e-mail de confirmation à la nouvelle adresse. L'e-mail contiendra un lien sur lequel l'utilisateur devra cliquer pour confirmer son adresse.

source: Users with :attr:`user management permission <canaille.core.configuration.Permission.MANAGE_USERS>` can set user emails without confirmation though.
fr: Les utilisateurs avec le :attr:`droit de gérer les utilisateurs <canaille.core.configuration.Permission.MANAGE_USERS>` peut paramétrer les e-mails des utilisateurs sans confirmation.

source: Group management
fr: Gestion de groupes

source: Group edition
fr: Modification de groupes

source: In a similar fashion than :ref:`profile management <feature_profile_management>` Canaille provides an interface to manage user groups.
fr: De manière similaire à la :ref:`gestion de profil <feature_profile_management>`, Canaille fournit une interface pour gérer les groupes d'utilisateur.

source: The group management is quite simple at the moment and consists in a group name and description, and the list of its members. Group membership can be use as :attr:`ACL Filter <canaille.core.configuration.ACLSettings.FILTER>` to define user permissions.
fr: La gestion de groupe est assez simple actuellement et consiste en un nom de groupe, une description et la liste de ses membres. Appartenir au groupe peut être utilisé comme :attr:`filtre ACL <canaille.core.configuration.ACLSettings.FILTER>` pour définir les droits utilisateur.

source: Due to limitations in the :ref:`LDAP backend <tutorial/databases:LDAP>`, groups must have at least one member. Thus it is not possible to remove the last user of a group without removing the group.
fr: À cause d'une contrainte dans :ref:`LDAP <tutorial/databases:LDAP>`, les groupes doivent avoir au moins un membre. Il n'est donc pas possible de supprimer le dernier utilisateur d'un groupe sans supprimer le groupe.

source: User authentication
fr: Authentification utilisateur

source: Unless their account is :ref:`locked <feature_account_locking>`, users can authenticate with a login and a password.
fr: Sauf si leur compte est :ref:`verrouillé <feature_account_locking>`, les utilisateurs peuvent s'authentifier avec un identifiant et un mot de passe.

source: For security reasons, it won't be told to users if they try to sign in with an unexisting logging, unless explicitly :attr:`set in the configuration <canaille.core.configuration.CoreSettings.HIDE_INVALID_LOGINS>`.
fr: Pour des raisons de sécurité, si un utilisateur essaie de se connecter avec un identifiant inexistant, cela ne sera pas précisé, sauf :attr:`paramétrage explicite dans la configuration <canaille.core.configuration.CoreSettings.HIDE_INVALID_LOGINS>`.

source: User registration
fr: Enregistrement d'un utilisateur

source: The registration page.
fr: La page d'inscription.

source: Users can create accounts on Canaille if the :attr:`registration feature <canaille.core.configuration.CoreSettings.ENABLE_REGISTRATION>` is enabled. They will be able to fill a registration form with the fields detailed in the default :class:`ACL settings <canaille.core.configuration.ACLSettings>`.
fr: Les utilisateurs peuvent créer des comptes sur Canaille si la fonctionnalité :attr:`d'enregistrement <canaille.core.configuration.CoreSettings.ENABLE_REGISTRATION>` est activée. Ils pourront remplir un formulaire d'enregistrement contenant les champs détaillés dans les :class:`paramètres ACL <canaille.core.configuration.ACLSettings>` par défaut.

source: If :attr:`email confirmation <canaille.core.configuration.CoreSettings.EMAIL_CONFIRMATION>` is also enabled, users will be sent a confirmation link to their email address, on which they will need to click in order to finalize their registration.
fr: Si la :attr:` confirmation par e-mail <canaille.core.configuration.CoreSettings.EMAIL_CONFIRMATION>` est aussi activée, les utilisateurs recevront un lien de confirmation sur leur adresse e-mail. Ils devront cliquer dessus pour valider la création du compte.

source: User invitation
fr: Invitation d'utilisateur

source: The invitation form page.
fr: La page de formulaire d'invitation.

source: If a :class:`mail server <canaille.core.configuration.SMTPSettings>` is configured, users with :attr:`user management permission <canaille.core.configuration.Permission.MANAGE_USERS>` can create an invitation link for one user.
fr: Si un :class:`serveur e-mail <canaille.core.configuration.SMTPSettings>` est configuré, les utilisateurs avec le :attr:`droit de gérer les utilisateurs <canaille.core.configuration.Permission.MANAGE_USERS>` peuvent créer un lien d'invitation pour un autre utilisateur.

source: The link goes to a registration form, even if regular :ref:`user registration <feature_user_registration>` is disabled.
fr: Le lien pointe vers le formulaire d'neregistrement, même si :ref:`l'enregistrement d'utilisateur <feature_user_registration>` est désactivée.

source: It can be automatically sent by email to the new user.
fr: Il peut être envoyé automatiquement par e-mail au nouvel utilisateur.

source: Account locking
fr: Verrouillage de compte

source: If Canaille is plugged to a :ref:`backend <feature_databases>` that supports it, user accounts can be locked by users with :attr:`user management permission <canaille.core.configuration.Permission.MANAGE_USERS>`. The lock date can be set instantly or at a given date in the future.
fr: Si Canaille est branché à un :ref:`backend <feature_databases>` supportant cette fonctionnalité, les comptes utilisateurs peuvent être verrouillés avec la :attr:`permission de gestion des utilisateurs <canaille.core.configuration.Permission.MANAGE_USERS>`. La date de verrouillage du compte peut être immédiate, ou bien effective à une date future définie.

source: At the moment a user account is locked:
fr: Au moment où un compte utilisateur est verrouillé :

source: their open sessions will be closed;
fr: leurs sessions ouvertes seront fermées ;

source: they won't be able to sign in again;
fr: ils ne pourront plus se connecter à nouveau ;

source: no new OIDC token will be issued;
fr: aucun nouveau token OIDC ne sera émis ;

source: User accounts must be manually unlocked by an administrator for the users to regain access to those actions.
fr: Les comptes utilisateur doivent être déverrouillés manuellement par un administrateur pour que les utilisateurs concernés récupèrent l'accès à ces actions.

source: Account deletion
fr: Suppression de compte

source: Users with the :attr:`account deletion permission <canaille.core.configuration.Permission.DELETE_ACCOUNT>` are allowed to delete their own account.
fr: Les utilisateurs avec la :attr:`permission de suppression de compte <canaille.core.configuration.Permission.DELETE_ACCOUNT>` peuvent supprimer leur propre compte.

source: Users that also have the :attr:`user management permission <canaille.core.configuration.Permission.MANAGE_USERS>` are also allowed to delete other users accounts.
fr: Les utilisateurs qui ont additionnellement la :attr:`permission de gestion des utilisateurs <canaille.core.configuration.Permission.MANAGE_USERS>` peuvent également supprimer les comptes d'autres utilisateurs.

source: Password recovery
fr: Récupération de mot de passe

source: The password reset page.
fr: La page de réinitialisation de mot de passe.

source: If a :class:`mail server <canaille.core.configuration.SMTPSettings>` is configured and the :attr:`password recovery feature <canaille.core.configuration.CoreSettings.ENABLE_PASSWORD_RECOVERY>` is enabled, then users can ask for a password reset email if they cannot remember their password.
fr: Si un :class:`serveur e-mail <canaille.core.configuration.SMTPSettings>` est configuré, et la :attr:`fonctionnalité de récupération de mot de passe <canaille.core.configuration.CoreSettings.ENABLE_PASSWORD_RECOVERY>` est activée, les utilisateurs peuvent demander l'envoi d'un e-mail de réinitialisation de mot de passe s'ils ont oublié leur mot de passe.

source: The email will be sent to the email addresses filled in their profile, and will contain a link that will allow them to choose a new password. .
fr: L'e-mail sera envoyé à l'adresse e-mail saisie dans leur profil, et contiendra un lien leur permettant de choisir un nouveau mot de passe.

source: Password reset
fr: Réinitialisation de mot de passe

source: If a :class:`mail server <canaille.core.configuration.SMTPSettings>` is configured, :attr:`user management permission <canaille.core.configuration.Permission.MANAGE_USERS>` can send password reset mails to users. The mails contains a link that allow users to choose a new password without having to retrieve the old one.
fr: Si un :class:`serveur e-mail <canaille.core.configuration.SMTPSettings>` est configuré, la :attr:`permission de gestion des utilisateurs <canaille.core.configuration.Permission.MANAGE_USERS>` permet d'envoyer des e-mails de réinitialisation de mot de passe aux utilisateurs. Les e-mails contiennent un lien qui permet aux utilisateurs de choisir un nouveau mot de passe sans avoir besoin de retrouver l'ancien.

source: Password initialization
fr: Initialisation de mot de passe

source: The first login page.
fr: La page de première connexion.

source: User :attr:`passwords <canaille.core.models.User.password>` are optional. If a :class:`mail server <canaille.core.configuration.SMTPSettings>` is configured, when users with no password attempt to sign in, they are invited to click a button that will send them a password initialization mail. The mail contains a link that leads to a form that allows users to choose a password.
fr: Les :attr:`mots de passe <canaille.core.models.User.password>` utilisateur sont optionnels. Si un :class:`serveur e-mail <canaille.core.configuration.SMTPSettings>` est configuré, quand un utilisateur sans mot de passe tente de se connecter, il est invité à cliquer sur un bouton déclenchant l'envoi d'un e-mail de réinitialisation de mot de passe. Cet e-mail contient un lien dirigeant vers un formulaire permettant à l'utilisateur de choisir un mot de passe.

source: Password compromission check
fr: Vérification de la compromission du mot de passe

source: If :attr:`password compromission check feature <canaille.core.configuration.CoreSettings.ENABLE_PASSWORD_COMPROMISSION_CHECK>` is enabled, Canaille will check for password compromise on HIBP (https://haveibeenpwned.com/) every time a new password is register. You will need to set an :attr:`admin email <canaille.core.configuration.CoreSettings.ADMIN_EMAIL>`.
fr: Si l' :attr:`option de vérification de compromission du mot de passe <canaille.core.configuration.CoreSettings.ENABLE_PASSWORD_COMPROMISSION_CHECK>` est activée, Canaille va vérifier la compromission du mot de passe sur HIBP (https://haveibeenpwned.com/) à chaque fois qu'un nouveau mot de passe est saisi. La configuration d'un :attr:`e-mail administrateur <canaille.core.configuration.CoreSettings.ADMIN_EMAIL>` est nécessaire.

source: Multi-factor authentication
fr: Authentification multi-facteurs

source: Intruder lockout
fr: Blocage des connexions infructueuses

source: If the :attr:`intruder lockout feature <canaille.core.configuration.CoreSettings.ENABLE_INTRUDER_LOCKOUT>` is enabled, then users will have to wait for an increasingly long time between each failed login attempt.
fr: Si le :attr:`blocage de connexions infructueuses <canaille.core.configuration.CoreSettings.ENABLE_INTRUDER_LOCKOUT>` est activé, alors les utilisateurs devront attendre un temps croissant entre deux connexions infructueuses.

source: Web interface
fr: Interface web

source: Internationalization
fr: Internationalisation

source: Translation state
fr: État de la traduction

source: Canaile will display in your :attr:`preferred language <canaille.core.models.User.preferred_language>` if available, or your browser language if available (and if it is not you can :ref:`help us with the translation <development/contributing:Code translation>`). If you prefer, you can also :attr:`force a language <canaille.core.configuration.CoreSettings.FAVICON>` for every users.
fr: Canaille va s'afficher dans votre :attr:`langue préférée <canaille.core.models.User.preferred_language>` si disponible, ou la langue de votre navigateur si disponible (si elle ne l'est pas, vous pouvez :ref:`noud aider à la traduire <development/contributing:Code translation>`). Si vous le souhaitez, vous pouvez également :attr:`forcer une langue <canaille.core.configuration.CoreSettings.FAVICON>` pour tous les utilisateurs.

source: Lightweight
fr: Léger

source: The web interface is lightweight, so everything should load quickly. There is a few Javascript here and there to smooth the experience, but no Javascript at all is needed to use Canaille.
fr: L'interface web est légère, donc tout devrait se charger rapidement. Il y a un peu de Javascript ici et là pour lisser l'expérience, mais aucun Javascript n'est absolument nécessaire à l'utilisation de Canaille.

source: Customizable
fr: Personnalisable

source: The default theme should be good enough for most usages. It has a dark theme, display well on mobile, and let you choose a :attr:`logo <canaille.core.configuration.CoreSettings.LOGO>` and a :attr:`favicon <canaille.core.configuration.CoreSettings.FAVICON>`.
fr: Le thème par défaut devrait suffir à la plupart des usages. Il dispose d'un thème sombre, s'affiche bien sur mobile, et vous laissez choisir un :attr:`logo <canaille.core.configuration.CoreSettings.LOGO>` et un :attr:`favicon <canaille.core.configuration.CoreSettings.FAVICON>`.

source: If you need more you can also use a :attr:`custom theme <canaille.core.configuration.CoreSettings.THEME>`.
fr: Si vous avez besoin de plus, vous pouvez utiliser un :attr:`thème personnalisé <canaille.core.configuration.CoreSettings.THEME>`.

source: Consent management
fr: Gestion des autorisations

source: The consent request dialog.
fr: La page de requête de consentement.

source: Users can give their consent to application requesting access to their personal information, and then revoke those consent at their will.
fr: Les utilisateurs peuvent donner leur autorisation aux applications qui demandent un accès à leurs informations personnelles, et révoquer ces autorisations lorsqu'ils le souhaitent.

source: Application management
fr: Gestion des applications

source: The client edition page.
fr: La page d'édition d'application cliente.

source: Users with the right :attr:`permission <canaille.core.configuration.Permission.MANAGE_OIDC>` can manage OIDC clients through the web interface.
fr: Les utilisateurs ayant la :attr:`permission <canaille.core.configuration.Permission.MANAGE_OIDC>` nécessaire peuvent gérer les clients OIDC depuis l'interface web.

source: In some cases, it might be useful to avoid the consent page for some trusted applications, so clients can be pre-consented.
fr: Dans certains cas, il peut être utile d'éviter la page d'autorisation pour certaines applications de confiance, pour que des clients puissent être pré-autorisés.

source: Discovery
fr: Découverte

source: Canaille implements the :doc:`Discovery specifications <development/specifications>` so most of the applications plugged to Canaille can auto-configure themselves.
fr: Canaille implémente les :doc:`spécifications de découverte <development/specifications>` donc la plupart des applications branchées à Canaille peuvent se configurer automatiquement par eux-même.

source: Dynamic Client Registration
fr: Enregistrement de client dynamique

source: Canaille implements the :doc:`Dynamic Client Registration specifications <development/specifications>`, so when the :attr:`feature is enabled <canaille.oidc.configuration.OIDCSettings.DYNAMIC_CLIENT_REGISTRATION_OPEN>`, clients can register themselves on Canaille without an administrator intervention.
fr: Canaille implémente les :doc:`spécifications d'enregistrement de client dynamique <development/specifications>`, donc quand la :attr:`fonctionnalité est activée <canaille.oidc.configuration.OIDCSettings.DYNAMIC_CLIENT_REGISTRATION_OPEN>`, les clients peuvent s'enregistrer eux-même sur Canaille sans l'intervention d'un administrateur.

source: Application provisioning
fr: Provisionnement d'applications

source: System administration
fr: Administration système

source: Command Line Interface
fr: Interface en ligne de commande

source: Canaille comes with a :abbr:`CLI (Command Line Interface)` to help administrators in hosting and management.
fr: Canaille est équipé d'un :abbr:`CLI (Command Line Interface)`, ou interface en ligne de commande, pour aider les administrateurs à l'hébergement et à la gestion.

source: There are tools to :ref:`generate and check a configuration file <cli_config>` or to :ref:`install missing parts <cli_install>`. You can use the CLI to :ref:`create <cli_create>`, :ref:`read <cli_get>`, :ref:`update <cli_set>` and :ref:`delete <cli_delete>` models such as :class:`users <canaille.core.models.User>`, :class:`groups <canaille.core.models.Group>` or :class:`OIDC clients <canaille.oidc.basemodels.Client>`.
fr: L'interface en ligne de commande dispose d'outils pour :ref:`générer et vérifier votre configuration <cli_check>` ou pour :ref:`installer des éléments manquants <cli_install>`. Vous pouvez utiliser le CLI pour :ref:`créer <cli_create>`, :ref:`lire <cli_get>`, :ref:`mettre à jour <cli_set>` et :ref:`supprimer <cli_delete>` des modèles comme les :class:`utilisateurs <canaille.core.models.User>`, :class:`groupes <canaille.core.models.Group>` ou les :class:`clients OIDC <canaille.oidc.basemodels.Client>`.

source: There are also tools to :ref:`fill your database <cli_populate>` with random objects, for tests purpose for instance.
fr: Elle dispose également d'outils pour :ref:`remplir votre base de données <cli_populate>` avec des objets aléatoires, par exemple à des fins de test.

source: Databases
fr: Bases de données

source: Canaille can handle data from the most :ref:`common SQL databases <tutorial/databases:SQL>` such as PostgreSQL, MariaDB or SQLite, as well as :ref:`OpenLDAP <tutorial/databases:LDAP>`. It also comes with a no-dependency :ref:`in-memory database <tutorial/databases:Memory>` that can be used in unit tests suites.
fr: Canaille peut manipuler de la donnée depuis des :ref:`bases de données SQL <tutorial/databases:SQL>` les plus communes, telles que PostgreSQL, MariaDB ou SQLite, ainsi que depuis :ref:`OpenLDAP <tutorial/databases:LDAP>`. Canaille dispose également d'une :ref:`base de données en mémoire <tutorial/databases:Memory>` sans dépendances qui peut être utilisée dans des tests unitaires.

source: Logging
fr: Connexion

source: Canaille writes :attr:`logs <canaille.core.configuration.CoreSettings.LOGGING>` for every important event happening, to help administrators understand what is going on and debug funky situations.
fr: Canaille écrit des :attr:`journaux <canaille.core.configuration.CoreSettings.LOGGING>` pour tous les événements importants dans le but d'aider les administrateurs à comprendre ce qui se passe et déboguer les cas bizarres.

source: The following security events are logged with the log level "security" for easy retrieval :
fr: Les événements de sécurité suivants sont enregistrés avec l'étiquette « security » pour les retrouver facilement :

source: Authentication attempt
fr: Tentative d'authentification

source: Password update
fr: Mise à jour du mot de passe

source: Email update
fr: Mise à jour de l'e-mail

source: Forgotten password mail sent to user
fr: Mail d'oubli de mot de passe envoyé à l'utilisateur

source: One-time passcode mail sent to user
fr: Le code de passe à usage unique a correctement envoyé par email à l'utilisateur

source: Multi-factor authentication reset
fr: Réinitialisation de l'authentification multi-facteurs

source: Token emission
fr: Emission de jeton

source: Token refresh
fr: Rafraichissement de jeton

source: Token revokation
fr: Révocation de jeton

source: New consent given for client application
fr: Nouvelle autorisation donnée pour l'application client

source: Consent revokation
fr: Révocation de l'autorisation

source: Development and testing tool
fr: Outil de développement et de test

source: Unit-testing tool
fr: Outil de test unitaire
