Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: You may want to configure a `WebFinger`_ endpoint on your main website to allow the automatic discovery of your Canaille installation based on the account name of one of your users. For instance, suppose your domain is ``mydomain.example`` and your Canaille domain is ``auth.mydomain.example`` and there is a user ``john.doe``. A third-party application could require to authenticate the user and ask them for a user account. The user would give their account ``john.doe@mydomain.example``, then the application would perform a WebFinger request at ``https://mydomain.example/.well-known/webfinger`` and the response would contain the address of the authentication server ``https://auth.mydomain.example``. With this information the third party application can redirect the user to the Canaille authentication page.
fr: Vous pourriez vouloir configurer un terminal `WebFinger`_ sur votre site web principal pour permettre la découverte automatique de votre installation Canaille basée sur le nom de compte d'un de vos utilisateurs. Par exemple, supposons que votre domaine soit ``mydomain.example`` et que votre domaine Canaille soit ``auth.mydomain.example`` et qu'il existe un utilisateur ``john.doe``. Une application tierce pourrait avoir besoin d'authentifier l'utilisateur et lui demander son compte. L'utilisateur fournirait son compte ``john.doe@mydomain.example``, alors l'application exécuterait une requête WebFinger sur ``https://mydomain.example/.well-known/webfinger`` et la réponse contiendrait l'adresse du serveur d'authentification ``https://auth.mydomain.example``. Avec cette information, l'application tierce pourrait rediriger l'utilisateur vers la page d'authentification Canaille.

source: The difficulty here is that the WebFinger endpoint must be hosted at the top-level domain (i.e. ``mydomain.example``) while the authentication server might be hosted on a sublevel (i.e. ``auth.mydomain.example``). Canaille provides a WebFinger endpoint, but if it is not hosted at the top-level domain, a web redirection is required on the ``/.well-known/webfinger`` path.
fr: La difficulté est que le terminal WebFinger doit être hébergé sur le domaine de plus haut niveau (c'est-à-dire ``mydomain.example``) alors que le serveur d'authentification peut être hébergé sur un sous-niveau(par exemple ``auth.mydomain.example``). Canaille fournit un terminal WebFinger, mais il n'est pas hébergé sur le domaine de plus haut niveau, une redirection est obligatoire sur le chemin ``/.well-known/webfinger``.

source: Here are configuration examples for Nginx or Apache:
fr: Voici des exemples de configuration pour Nginx ou Apache :

source: Nginx webfinger configuration for a top level domain
fr: Configuration webfinger Nginx pour le domaine de plus haut niveau

source: Apache webfinger configuration for a top level domain
fr: Configuration webfinger Apache pour le domaine de plus haut niveau

source: Tutorial
fr: Tutoriel

source: This page describes how to get and set-up Canaille.
fr: Cette page décrit comment obtenir et installer Canaille.

source: *I have no time, spare me the details !*
fr: *Je n'ai pas le temps, épargnez-moi les détails !*

source: Get the code
fr: Récupérer le code source

source: Binaries
fr: Exécutables

source: Canaille provides a ready-to-use single file executable for Linux. The binary installation is the easiest way to get a production-ready Canaille release, though this is not the most customizable. This is generally the recommended method to use Canaille in production.
fr: Canaille fournit un fichier exécutable unique prêt à l'emploi pour Linux. L'installation binaire est le moyen le plus simple d'obtenir une version de Canaille prête pour la production, bien qu'elle ne soit pas la plus personnalisable. C'est généralement la méthode recommandée pour utiliser Canaille en production.

source: Canaille binaries comes with lesser performances than other installation methods on startup. This is generally not an issue, since Canaille is used as a long-running service, but if this is important for you, you might want to choose another installation method.
fr: L'exécutable de Canaille offre de moins bonnes performances au démarrage que les autres méthodes. Ça n'est généralement pas un problème, puisque Canaille est utilisé comme un processus à longue durée de vie, mais si c'est important pour vous, vous voudriez sans doute choisir une autre méthode d'installation.

source: Linux packages
fr: Paquets Linux

source: Canaille provides a `Python package <Canaille_PyPI>`_ that you can install with package managers like ``uv`` or ``pip``. This is the recommended method if you want fast CLI performances, if you need to customize the dependencies, or if you want to use Canaille in a development environment.
fr: Canaille fournit un `paquet Python <Canaille_PyPI>`_ que vous pouvez installer avec des gestionnaires de paquets comme ``uv`` ou ``pip``. C'est la méthode d'installation recommandée si vous souhaitez de bonnes performances en ligne de commande, si vous souhaitez personnaliser l'installation des dépendances, ou si vous souhaitez utiliser Canaille dans un environnement de développement.

source: In the following example, we use a custom virtualenv to install Canaille. Note that you should customize the ``EXTRAS`` packages, depending on your needs.
fr: Dans l'exemple suivant, nous utilisons un virtualenv personnalisé pour installer Canaille. Notez que vous devez personnaliser les paquets ``EXTRAS`` en fonction de vos besoins.

source: Canaille installation using a Python virtualenv
fr: Installation de Canaille à l'aide d'un environnement virtuel Python

source: In the rest of the documentation, we consider that your virtualenv is activated, and that the ``canaille`` command is available.
fr: Dans le reste de la documentation, nous considérons que votre virtualenv est activé, et que la commande ``canaille`` est fonctionnelle.

source: Canaille provides different package options:
fr: Canaille fournit différentes options de paquet :

source: `front` provides all the things needed to produce the user interface;
fr: `front` fournit tous les éléments nécessaires pour produire l'interface utilisateur ;

source: `oidc` provides the dependencies to perform OAuth2/OIDC authentication;
fr: `oidc` fournit les dépendances pour exécuter une authentification OAuth2/OIDC ;

source: `ldap` provides the dependencies to enable the LDAP backend;
fr: `ldap` fournit les dépendances pour activer le backend LDAP ;

source: `sqlite` provides the dependencies to enable the SQLite backend;
fr: `sqlite` fournit les dépendances pour activer le backend SQLite ;

source: `postgresql` provides the dependencies to enable the PostgreSQL backend;
fr: `postgresql` fournit les dépendances pour activer le backend PostgreSQL :;

source: `mysql` provides the dependencies to enable the MySQL backend;
fr: `mysql` fournit les dépendances pour activer le backend MySQL ;

source: `sentry` provides sentry integration to watch Canaille exceptions;
fr: `sentry` fournit l'intégration Sentry pour visualiser les exceptions survenues dans Canaille ;

source: `sms` provides the dependencies to enable sms sending;
fr: `sms` fournit les dépendances pour activer l'envoi de SMS ;

source: `server` provides the dependencies to run a production server.
fr: `server` fournit les dépendances pour l'exécution d'un serveur de production.

source: They can be installed with:
fr: Ils peuvent être installés avec :

source: Configure
fr: Configurer

source: The :doc:`configuration documentation<../references/configuration>` describe several ways to configure Canaille, however the most common is to use a TOML configuration file and pass its path with the :envvar:`CONFIG` environment variable. A configuration file with default values can be initialized with the :ref:`config dump <cli_config>` command.
fr: La :doc:`documentation sur la configuration <../references/configuration>` décrit plusieurs manières de configurer Canaille, cependant la plus fréquente est d'utiliser un fichier de configuration TOML et le passer à la variable d'environnement :envvar:`CONFIG`. Une configuration par défaut peut-être initialisée avec la commande :ref:`config dump <cli_config>`.

source: Initialize a configuration file.
fr: Initialise un fichier de configuration.

source: You can then edit your configuration file and tune its values. Have a look at the :ref:`reference <references/configuration:Parameters>` to know the exhaustive list of available parameters.
fr: Vous pouvez éditer votre fichier de configuration et ajuster ses valeurs. Jetez un œil à la :ref:`référence <references/configuration:Parameters>` pour connaître la liste exhaustive des paramètres disponibles.

source: In the rest of the documentation, we consider that your Canaille instance is configured by one of the available methods (either with a :envvar:`CONFIG` environment var, either with ``.env`` files etc.).
fr: Dans le reste de la documentation, nous considérons que votre instance de Canaille est configurée avec l'une des méthodes disponibles (soit avec la variable d'environnement :envvar:`CONFIG` , soit avec un fichier ``.env`` etc.).

source: Install
fr: Installer

source: The :ref:`install command <cli_install>` will apply most of the things needed to get Canaille working. Depending on the configured :doc:`database <databases>` it will create the SQL tables, or install the LDAP schemas for instance.
fr: La :ref:`commande d'installation <cli_install>` appliquera la plupart des choses nécessaires au fonctionnement de Canaille. Selon la :doc:`base de données <databases>` configurée, il créera les tables SQL ou installera les schémas LDAP par exemple.

source: Check
fr: Vérifier

source: After a manual installation, you can test the network parameters in your configuration file using the :ref:`config check command <cli_config>`. It will attempt to connect your :class:`SMTP server <canaille.core.configuration.SMTPSettings>`, or your :class:`SMPP server <canaille.core.configuration.SMPPSettings>` if defined.
fr: Après une installation manuelle, vous pouvez tester les paramètres réseau de votre configuration en utilisant la commande :ref:`config check <cli_config>`. Elle tentera d'effectuer une connexion à votre :class:`serveur SMTP <canaille.core.configuration.SMTPSettings>`, ou votre :class:`serveur SMPP <canaille.core.configuration.SMPPSettings>` s'ils sont définis.

source: Create the first user
fr: Créer le premier utilisateur

source: Once canaille is installed, soon enough you will need to add users. To create your first user you can use the :ref:`canaille create <cli_create>` CLI.
fr: Une fois Canaille installé, vous allez assez rapidement avoir besoin d'ajouter des utilisateurs. Pour créer votre premier utilisateur, vous pouvez utiliser la ligne de commande :ref:`canaille create <cli_create>`.

source: Provisioning
fr: Provisionnement

source: Canaille partially implement the :rfc:`SCIM <7642>` provisioning protocol, so user and group modifications can be spread across an entire application ecosystem.
fr: Canaille implémente partiellement le protocole de provisionnement :rfc:`SCIM <7642>`, ce qui permet aux modifications sur les utilisateurs et les groupes d'être répandues à travers l'ensemble de votre écosystème d'applications.

source: Provisioning server
fr: Serveur de provisionnement

source: Canaille acts as a provisioning server. This means that client applications can perform requests on the ``/scim/v2`` endpoint, using the SCIM2 protocol, to manage user and group objects.
fr: Canaille fonctionne comme un serveur de provisionnement. Cela signifie que les applications clientes peuvent effectuer des requêtes sur le terminal ``/scim/v2``, en utilisant le protocole SCIM2, afin de manipuler des utilisateurs et des groupes.

source: Provisioning client
fr: Client de provisionnement

source: Canaille also acts a provisioning client. This means that all modifications on user and groups are spread among the client applications implementing the SCIM2 server specification. This ensures that the details of users and groups are always synchronized among all your client applications.
fr: Canaille fonctionne aussi comme un client de provisionnement. Cela signifie que les modifications sur les utilisateurs et les groupes sont transmises aux applications clientes implémentant la spécification serveur SCIM2. Cela permet de s'assurer que les utilisateurs et les groupes sont toujours synchronisés dans toutes vos applications clientes.

source: Modifications are sent to client applications whether they come from the :ref:`web interface <feature_profile_management>`, the :ref:`CLI <references/commands:Command Line Interface>` or from another client application requesting the Canaille SCIM server endpoint.
fr: Les modifications sont envoyées aux applications clientes, qu'elles viennent de :ref:`l'interface web <feature_profile_management>`, de la :ref:`ligne de commandes <references/commands:Command Line Interface>` ou bien d'une autre application cliente effectuant une requête sur l'API SCIM de Canaille.

source: Canaille will attempt to authenticate against the client SCIM2 server endpoint with a Bearer token it has emitted on behalf of the client. Please make sure that your client application is properly configured to accept Canaille tokens.
fr: Canaille va tenter de s'authentifier sur le terminal d'API SCIM2 des applications clientes avec un jeton d'authentification que Canaille aura émis au nom du client. Veuillez vous assurer que vos applications clientes sont correctement configurées pour accepter les jetons provenant de Canaille.

source: Note that the SCIM client feature is at early development stage and comes with poor performances at the moment.
fr: Notez que la fonctionnalité de client SCIM en est à un stade de développement peu avancé, et vient avec des performances limitées pour le moment.

source: Todo
fr: À faire

source: Some SCIM :ref:`features and endpoints <scim_unimplemented>` are not implemented. In addition to these, Canaille will implement in the future:
fr: Certaines :ref:`fonctionnalités et terminaux <scim_unimplemented>` de SCIM ne sont pas implémentées. En plus de celles-ci, Canaille implémentera dans le future :

source: Access control for clients on the SCIM API endpoint, to finely manage permissions depending on clients.
fr: Contrôle d'accès pour les clients sur le terminal API de SCIM, pour gérer finement les droits en fonction des clients.

source: Client-side implementation, to broadcast user and groups modifications among all the clients.
fr: Implémentation côté client, pour envoyer les modification d'utilisateur et de groupes à tous les clients.

source: Then the :attr:`CANAILLE_SCIM.ENABLE_SERVER <canaille.scim.configuration.SCIMSettings.ENABLE_SERVER>` configuration parameter must be enabled.
fr: Alors le paramètre de configuration :attr:`CANAILLE_SCIM.ENABLE_SERVER <canaille.scim.configuration.SCIMSettings.ENABLE_SERVER>` doit être activé.

source: To allow Canaille to act as a SCIM client and broadcast modifications to client applications, the :attr:`CANAILLE_SCIM.ENABLE_CLIENT <canaille.scim.configuration.SCIMSettings.ENABLE_CLIENT>` configuration parameter must be enabled.
fr: Afin d'activer la fonctionnalité de client SCIM et de répandre les modifications aux applications clientes, le paramètre de configuration :attr:`CANAILLE_SCIM.ENABLE_CLIENT <canaille.scim.configuration.SCIMSettings.ENABLE_CLIENT>` doit être activé.

source: Implementation details
fr: Détails d'implémentation

source: Due to technical reasons, the server-side Canaille *User* and *Group* resources implementation subtly differs from the :rfc:`RFC7643 <7643>` definitions:
fr: Pour des raisons techniques, les implémentations côté serveur des ressources *User* et *Group* diffèrent subtilement entre Canaille et la :rfc:`RFC7643 <7643>` :

source: ``User.userName`` is immutable (while it is read-write in RFC7643).
fr: ``User.userName`` est immuable (tandis qu'il est en lecture-écriture dans la RFC7643).

source: ``User.name.familyName`` is required (while it is optional in RFC7643).
fr: ``User.name.familyName`` est requis (tandis qu'il est optionnel dans la RFC7643).

source: ``Group.displayName`` is required (while it is optional in RFC7643).
fr: ``Group.displayName`` est requis (tandis qu'il est optionnel dans la RFC7643).

source: ``Group.members`` is required (while it is optional in RFC7643), i.e. groups cannot be empty.
fr: ``Group.members`` est requis (tandis qu'il est optionnel dans la RFC7643), c'est à dire que les groupes ne peuvent être vides.

source: Debugging
fr: Débogage

source: To check what data are exposed through the Canaille SCIM API, you need a *client token* and a SCIM client application. To generate a client token, you can simply manually create a token from the button on the client administration page. Then, we recommend the use of :doc:`scim2-cli:index` to interact with the API:
fr: Afin de vérifier les données exposées par l'API SCIM de Canaille, vous aurez besoin d'un *jeton client* et d'une application SCIM cliente. Afin de générer un jeton, vous pouvez simplement en créer un manuellement avec le bouton présent sur la page d'administration des clients. Enfin, nous vous recommandons l'utilisation de :doc:`scim2-cli:index` pour interagir avec l'API :

source: scim2-cli usage example
fr: Exemple d'utilisation de scim2-cli

source: Single Sign-On
fr: Authentification unique

source: Name
fr: Nom

source: This is the name that will be displayed on the web interface, and notably on the consent page.
fr: Le nom qui sera affiché sur l'interface web, notamment sur la page de consentement.

source: Those are the email addresses of people responsible for the client.
fr: Ce sont les adresses e-mail des personnes responsables du client.

source: Redirect URIs
fr: URI de redirection

source: URIs for use in redirect-based flows such as the authorization code and implicit flows.
fr: URIs qui peuvent servir au flux d'authentification comprenant des redirections, tels le code d'autorisation ou le flux implicite.

source: Post logout redirect URIs
fr: URI de redirection post-déconnexion

source: URIs that the client may redirect users to after logging them out.
fr: Les URI vers lesquelles le client peut rediriger les utilisateurs après déconnexion.

source: Grant types
fr: Types de consentement

source: Grant types that the client can use at the token endpoint.
fr: Types de consentement que le client peut utiliser sur le terminal de jetons.

source: Scope
fr: Portée

source: Kind of information that the client can request about users.
fr: Type d'informations que le client peut demander à propos des utilisateurs.

source: Response types
fr: Types de réponse

source: Response types that the client can use at the authorization endpoint.
fr: Types de réponse que le client peut utiliser sur le terminal d'autorisation.

source: Token endpoint authentication method
fr: Méthode d'authentification du point terminal des jetons

source: Authentication method that the client will use at the token endpoint.
fr: Méthode d'authentification que le client utilise sur le terminal de jeton.

source: JSON Web Keys URI
fr: URI vers les JSON Web Keys

source: Theming
fr: Habillage

source: Canaille comes with a default theme based on `Fomantic UI <https://fomantic-ui.com/>`__ but any part of the UI can be slightly modified or even entierely rewritten if needed.
fr: Canaille est fourni avec un thème par défaut basé sur `Fomantic UI <https://fomantic-ui.com/>`__, mais n'importe quelle partie de l'interface utilisateur peut être légèrement modifiée, ou bien complètement ré-écrite si besoin.

source: Custom templates
fr: Patrons personnalisés

source: To use a custom theme, set the :attr:`~canaille.core.configuration.CoreSettings.THEME` to a path to a directory where you will host your custom templates.
fr: Pour utiliser un thème personnalisé, pointez le paramètre de configuration :attr:`~canaille.core.configuration.CoreSettings.THEME` vers un répertoire dans lequel sont enregistrés vos patrons.

source: Then in this directory, create new files for templates you want to override. The exhaustive list of templates is available in the :doc:`reference <../references/templates>`. You must respect the template file paths. So for instance if you want to customize the *about page*, you need to do it in a ``core/about.html`` file. You can inherit from the origin template by using the Jinja ``extend`` directive.
fr: Dans ce répertoire, créez de nouveaux fichiers pour les patrons que vous voulez remplacer ou affiner. Une liste exhaustive des patrons est disponible dans la :doc:`référence <../references/templates>`. Vous devez respecter les chemins des patrons. Par exemple, si vous souhaitez personnaliser la *page « À propos »*, vous devez le faire dans un fichier ``core/about.html``. Vous pouvez hériter du patron original en utilisant la directive Jinja ``extend``.

source: Custom style sheets
fr: Feuilles de style personnalisées

source: If you simply want to put your custom style sheets in the default theme, you can just push it in the ``base.html`` template. Put your file in a ``static`` subdirectory of your theme, for instance ``static/css/custom.css`` and reference it with ``theme_static``.
fr: Si vous souhaitez simplement utiliser votre feuille de style dans le thème par défaut, vous pouvez simplement l'insérer dans le patron ``base.html``. Placez votre fichier dans un sous-répertoire ``static`` de votre thème, par exemple ``static/css/custom.css`` et référencez-le avec ``theme_static``.

source: Troubleshooting
fr: Dépannage

source: The web interface throws useless error messages
fr: L'interface web affiche des messages erreurs inutiles

source: My application return errors with the Canaille connection
fr: Mon application retourne des erreurs avec la connexion à Canaille

source: If your Canaille client is misconfigured, you can get error messages in your application logs such as ``{"error": "invalid_client"}``. If this happens, check you application documentation to find what is the expected configuration. A common misconfiguration is to use ``client_secret_basic`` instead of ``client_secret_post`` as client authentication method.
fr: Si votre client Canaille est mal configuré, vous pouvez obtenir des messages d'erreur dans les journaux de l'application logs tel que ``{"error": "invalid_client"}``. Si cela survient, vérifiez la documentation de l'application pour trouver la configuration attendue. Un mauvaise configuration courante est d'utiliser ``client_secret_basic`` à la place de ``client_secret_post`` pour la méthode d'authentification du client.

source: Use cases
fr: Cas d'usage

source: Canaille is a lightweight IAM for simple needs. Here are a few use cases you might recognize in, where Canaille would fit your needs.
fr: Canaille est un Gestionnaire des Identités et des Accès (en anglais « Identity and Access Management » ou IAM) pour des besoins simples. Voici quelques cas d'usage dans lesquels vous pourriez vous reconnaître où Canaille pourrait répondre à votre besoin.

source: A lightweight IAM for unit testing
fr: un GIA (IAM) léger pour les tests unitaires
