Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: Password reset and initialization mails were not sent at all the user addresses if one email address could not be reached.
fr: Les courriels d’initialisation et de réinitialisation de mots de passe n’étaient pas tous envoyés si l’un des envois échouait.

source: Password comparison was too permissive on login.
fr: La comparaison des mots de passe était trop permissive à la connexion.

source: Encrypt passwords in the SQL backend.
fr: Chiffrement des mots de passe dans la base de données SQL.

source: Refresh token grant supports other client authentication methods. :pr:`157`
fr: Support de méthodes d’authentifications additionnels pour les jetons de rafraîchissement. :pr:`157`

source: Implement a SQLAlchemy backend. :issue:`30` :pr:`158`
fr: Support des bases de données SQL avec SQLAlchemy. :issue:`30` :pr:`158`

source: Model attributes cardinality is closer to SCIM model. :pr:`155`
fr: La cardinalité des attributs des modèles est un peu plus ressemblante à celle des attributs de modèles SCIM. :pr:`155`

source: Bump to `HTMX` 1.9.9. :pr:`159`
fr: Mise à jour vers `HTMX` 1.9.9. :pr:`159`

source: Disable `HTMX` boosting during the OIDC dance. :pr:`160`
fr: Désactivation de `HTMX` pendant la phase d’identification OIDC. :pr:`160`

source: Canaille installations without account lockabilty could not delete users. :pr:`153`
fr: Les installations de Canaille n’ayant pas la fonctionnalité de verrouillage des comptes ne pouvaient pas supprimer des utilisateurs. :pr:`153`

source: If users register or authenticate during a OAuth Authorization phase, they get redirected back to that page afterwards. :issue:`168` :pr:`151`
fr: Si les utilisateurs s’enregistrent durant la phase d’authentification OAuth, ils sont ensuite redirigés vers la page dont ils viennent. :issue:`168` :pr:`151`

source: The `flask-babel` and `pytz` libraries are now part of the `front` packaging extras.
fr: Les bibliothèques `flask-babel` et `pytz` font désormais partie de l’extra d'empaquetage `front`.

source: Bump to `fomantic-ui` 2.9.3. :pr:`152`
fr: Mise à jour vers `fomantic-ui` 2.9.3. :pr:`152`

source: Bump to `HTMX` 1.9.6. :pr:`154`
fr: Mise à jour vers `HTMX` 1.9.6. :pr:`154`

source: Support for Python 3.12. :pr:`155`
fr: Support de Python 3.12 :pr:`155`

source: OIDC jwks endpoint do not return empty `kid` claim.
fr: Le point de terminaison OIDC jwks ne retourne plus le paramètre `kid` lorsqu’il est vide.

source: Documentation details on the Canaille models.
fr: Documentation des modèles de Canaille.

source: Additional inmemory backend. :issue:`30` :pr:`149`
fr: Implémentation d’un connecteur de base de données en mémoire. :issue:`30` :pr:`149`

source: Installation extras. :issue:`167` :pr:`150`
fr: Définition de dépendances `extra`. :issue:`167` :pr:`150`

source: Configuration option to disable the forced usage of OIDC `nonce` parameter. :pr:`143`
fr: Option de configuration pour désactiver l’utilisation du paramètre OIDC `nonce`. :pr:`143`

source: Validate phone numbers with a regex. :pr:`146`
fr: Validation des numéros de téléphone avec des expressions régulières. :pr:`146`

source: Email verification. :issue:`41` :pr:`147`
fr: Vérification des adresses email. :issue:`41`:pr:`147`

source: Account registration. :issue:`55` :pr:`133` :pr:`148`
fr: Enregistrement de comptes utilisateur. :issue:`55` :pr:`133` :pr:`148`

source: The `check` command uses the default configuration values.
fr: La commande `check` utilise les valeurs de configuration par défaut.

source: Modals do not need use Javascript at the moment. :issue:`158` :pr:`144`
fr: Les fenêtres modales ne nécessitent plus l’utilisation de Javascript. :issue:`158` :pr:`144`

source: Configuration files must be updated. Check the new format with ``git diff 0.0.29 0.0.30 canaille/conf/config.sample.toml``
fr: Les fichiers de configuration doivent être mis à jour. Vérifiez le nouveau format avec ``git diff 0.0.29 0.0.30 canaille/conf/config.sample.toml``

source: Configuration option to disable Javascript. :pr:`141`
fr: Option de configuration pour désactiver Javascript. :pr:`141

source: The configuration parameter ``USER_FILTER`` is parsed with Jinja.
fr: Le paramètre de configuration ``USER_FILTER`` est analysé avec Jinja.

source: Configuration use ``PRIVATE_KEY_FILE`` instead of ``PRIVATE_KEY`` and ``PUBLIC_KEY_FILE`` instead of ``PUBLIC_KEY``.
fr: La configuration utilise ``PRIVATE_KEY_FILE`` à la place de ``PRIVATE_KEY`` et ``PUBLIC_KEY_FILE`` à la place de ``PUBLIC_KEY``.

source: Disabled `HTMX` boosting on OIDC forms to avoid errors.
fr: Désactivation d’`HTMX` sur les formulaires OIDC pour éviter des erreurs lors des redirections.

source: A template variable was misnamed.
fr: Une variable de template était mal nommée.

source: Configuration files must be updated. Check the new format with ``git diff 0.0.26 0.0.27 canaille/conf/config.sample.toml``
fr: Les fichiers de configuration doivent être mis à jour. Vérifiez le nouveau format avec ``git diff 0.0.26 0.0.27 canaille/conf/config.sample.toml``

source: Configuration entries can be loaded from files if the entry key has a *_FILE* suffix and the entry value is the path to the file. :issue:`134` :pr:`134`
fr: Les paramètres de configuration peuvent être lus à partir de fichiers si le paramètre a un suffixe *_FILE* et que sa valeur correspond à un chemin de fichier. :issue:`134` :pr:`134`

source: Field list support. :issue:`115` :pr:`136`
fr: Support pour les listes de champ. :issue:`115` :pr:`136`

source: Pages are boosted with `HTMX`. :issue:`144` :issue:`145` :pr:`137`
fr: Les pages sont boostées avec `HTMX`. :issue:`144` :issue:`145` :pr:`137`

source: Bump to jquery 3.7.0. :pr:`138`
fr: Mise à jour vers jquery 3.7.0. :pr:`138`

source: Profile edition when the user RDN was not ``uid``. :issue:`148` :pr:`139`
fr: L’édition des profils utilisateurs lorsque le RDN n’était pas ``uid`. :issue:`148` :pr:`139`

source: Stop support for Python 3.7. :pr:`131`
fr: Arrêt du support pour Python 3.7. :pr:`131`

source: Implemented account expiration based on OpenLDAP ppolicy overlay. Needs OpenLDAP 2.5+. :issue:`13` :pr:`118`
fr: Implémentation de l’expiration des comptes en se basant sur l’overlay OpenLDAP `ppolicy``. Nécessite au minimun OpenLDAP 2.5. :issue:`13` :pr:`118`

source: Timezone configuration entry. :issue:`137` :pr:`130`
fr: Paramètre de configuration des fuseaux horaire. :issue:`137` :pr:`130`

source: Avoid setting ``None`` in JWT claims when they have no value.
fr: Les paramètres du jeton d'accès ne sont pas ``None`` lorsqu'ils n’ont pas de valeur définie.

source: Display password recovery button on OIDC login page. :pr:`129`
fr: Affichage du bouton de réinitialisation de mots de passe sur la page de connexion OIDC. :pr:`129`

source: Check the new format with ``git diff 0.0.25 0.0.24 canaille/conf/config.sample.toml``
fr: Vérifiez le nouveau format avec ``git diff 0.0.25 0.0.24 canaille/conf/config.sample.toml``

source: Renamed user model attributes to match SCIM naming convention. :pr:`123`
fr: Renommage des modèles d’attributs d’'utilisateurs en suivant la convention SCIM. :pr:`123`

source: Moved OIDC related configuration entries in ``OIDC``.
fr: Déplacement des paramètres de configuration OIDC dans ``OIDC``.

source: Moved ``LDAP`` configuration entry to ``BACKENDS.LDAP``.
fr: Déplacement des paramètres de configuration ``LDAP`` dans ``BACKENDS.LDAP``.

source: Bumped to `HTMX` 1.9.0. :pr:`124`
fr: Mise à jour vers HTMX 1.9.0. :pr:`184`

source: ACL filters are no more LDAP filters but user attribute mappings. :pr:`125`
fr: Les filtres de permissions ne sont plus des filtres LDAP mais des associations de paramètres utilisateur. :pr:`125`

source: Bumped to `HTMX` 1.9.2. :pr:`127`
fr: Mise-à-jour vers `HTMX` 1.9.2. :pr:`127`

source: ``OIDC.JWT.MAPPING`` configuration entry is really optional now.
fr: Le paramètre de configuration ``OIDC.JWT.MAPPING`` est réellement facultatif.

source: Fixed empty model attributes registration. :pr:`125`
fr: Correction des attributs vides lors de l’enregistrement. :pr:`125`

source: Password initialization mails were not correctly sent. :pr:`128`
fr: Les courriels d’initialisation de mot de passe n’étaient pas correctement envoyés. :pr:`128`

source: Fixed avatar update. :pr:`122`
fr: Correction de la mise à jour des avatars. :pr:`122`

source: Organization field. :pr:`116`
fr: Champ `organization` :pr:`116`

source: ETag and Last-Modified headers on user photos. :pr:`116`
fr: En-têtes `ETag` et `Last-Modified` sur les avatars. :pr:`116`

source: Dynamic form validation. :pr:`120`
fr: Validation dynamique des formulaires. :pr:`120`

source: UX rework. Submenu addition. :pr:`114`
fr: Travaux sur l’interface utilisateur. Ajout de sous-menus. :pr:`114`

source: Properly handle LDAP date timezones. :pr:`117`
fr: Gestion correcte des fuseaux horaire des dates dans LDAP. :pr:`117`

source: CSRF protection on every forms. :pr:`119`
fr: Protection CSRF sur tous les formulaires. :pr:`119`

source: The `Faker` library is not imported anymore when the `clean` command is called.
fr: La bibliothèque `Faker` n’est plus importée lorsque la commande `clean` est appelée.

source: Display TOS and policy URI on the consent list page. :pr:`102`
fr: Affichage des liens vers les conditions d’utilisation sur la page de liste des consentements. :pr:`102`

source: Admin token deletion. :pr:`100` :pr:`101`
fr: Suppression des jetons via l’interface administrateur. :pr:`100` :pr:`101`

source: Revoked consents can be restored. :pr:`103`
fr: Les consentements révoqués peuvent être restaurés. :pr:`103`

source: Trusted clients are displayed in the user consent list, and their consents can be revoked. :issue:`69` :pr:`103`
fr: Les applications de confiance apparaissent dans la liste de consentement des utilisateurs, et leur consentement peut être révoqué. :issue:`69` :pr:`103`

source: A ``populate`` command can be used to fill the database with random users generated with faker. :pr:`105`
fr: Implémentation d’une commande ``populate`` qui remplit la base de données avec des valeurs aléatoires générées avec la bibliothèque `Faker`. :pr:`105`

source: SMTP SSL support. :pr:`108`
fr: Support des connexions SMTP avec SSL. :pr:`108`

source: Server side pagination. :issue:`114` :pr:`111`
fr: Pagination côté serveur. :issue:`114`:pr:`111`

source: Department number support. :issue:`129`
fr: Support du champs de numéro de département. :issue:`129`

source: Address edition support (but not in the OIDC claims yet). :pr:`112`
fr: Support de l’édition de l’adresse (sans que cela apparaisse dans les paramètres du jeton OIDC). :pr:`112`

source: Title edition support. :pr:`113`
fr: Support de l’édition du paramètre `title`. :pr:`113`

source: Client deletion also deletes related :class:`~canaille.oidc.basemodels.Consent`, :class:`~canaille.oidc.basemodels.Token` and :class:`~canaille.oidc.basemodels.AuthorizationCode` objects. :issue:`126` :pr:`98`
fr: La suppression d’un client supprime aussi les objets des classes liées :class:`~canaille.oidc.basemodels.Consent`, :class:`~canaille.oidc.basemodels.Token` et :class:`~canaille.oidc.basemodels.AuthorizationCode`. :issue:`126` :pr:`98`

source: Removed the `DataTables` Javascript library.
fr: Suppression de la bibliothèque Javascript `Datatables`.

source: Spanish translation. :pr:`85` :pr:`88`
fr: Traduction espagnole. :pr:`85` :pr:`88`

source: Dedicated connectivity test email. :pr:`89`
fr: Test de connectivité. :pr:`89`

source: Update to jquery 3.6.3. :pr:`90`
fr: Mise à jour vers jquery 3.6.3. :pr:`90`

source: Update to fomantic-ui 2.9.1. :pr:`90`
fr: Mise à jour vers Fomantic-UI 2.9.1. :pr:`90`

source: Update to DataTables 1.13.1. :pr:`90`
fr: Mise à jour vers DataTAbles 1.13.1. :pr:`90`

source: Fix typos and grammar errors. :pr:`84`
fr: Correction de fautes de frappe et d’erreurs de grammaire. :pr:`84`

source: Fix wording and punctuation. :pr:`86`
fr: Correction de formulations et de ponctuation. :pr:`86`

source: Fix HTML lang tag. :issue:`122` :pr:`87`
fr: Correction de la balise HTML de langue. :issue:`122` :pr:`87`

source: Automatically trims the HTML translated strings. :pr:`91`
fr: Suppression automatique des espaces autour des chaîne de caractères à traduire. :pr:`91`

source: Fixed dynamic registration scope management. :issue:`123` :pr:`93`
fr: Correction de la gestion du domaine de l’enregistrement dynamique. :issues:`123` :pr:`93`

source: Ensures the token `expires_in` claim and the `access_token` `exp` claim have the same value. :pr:`83`
fr: Le paramètre ``expires_in`` du flux d’autorisation et le paramètre ``exp``du jeton d’accès ont la même valeur. :pr:`83

source: OIDC end_session was not returning the ``state`` parameter in the ``post_logout_redirect_uri``. :pr:`82`
fr: Le paramètre ``state`` n’était pas transmis à l’URL de redirection post déconnexion. :pr:`82`

source: Fixed group deletion button. :pr:`80`
fr: Correction du bouton de suppression de groupe. :pr:`80`

source: Fixed post requests in oidc clients views. :pr:`81`
fr: Correction des requêtes POST sur la vue de gestion des clients OIDC. :pr:`81`

source: Fixed LDAP operational attributes handling.
fr: Correction sur le comportement des attributs LDAP opérationnels.

source: User can chose their display name. :pr:`77`
fr: Les utilisateurs peuvent choisir leur nom d’affichage. :pr:`77`

source: Bumped to Authlib 1.2. :pr:`78`
fr: Mise à jour vers Authlib 1.2. :pr:`78`

source: Implemented :rfc:`RFC7592 <7592>` OAuth 2.0 Dynamic Client Registration Management Protocol. :pr:`79`
fr: Implémentation de la :rfc:`RFC7592 <7592>` OAuth 2.0 Dynamic Client Registration Management Protocol. :pr:`79`

source: Add the ``nonce`` parameter to the ``claims_supported`` server metadata list.
fr: Ajout du paramètre ``nonce`` à la métadonnée du serveur OIDC ``claims_supported``.

source: Fixed translation catalogs packaging.
fr: Correction de l'empaquetage des catalogues de traduction.

source: Fixed a bug on the contacts field in the admin client form following the LDAP schema update of 0.0.12.
fr: Correction d’une erreur sur le champs `contacts` du formulaire d’administration des clients OIDC, du à la mise à jour des schémas LDAP de la version 0.0.12.

source: Fixed a bug happening during RP initiated logout on clients without `post_logout_redirect_uri` defined.
fr: Correction d’une erreur survenant dans la phase de déconnexion initiée par les clients sans paramètre `post_logout_redirect_uri` défini.

source: Gitlab CI fix. :pr:`64`
fr: Correction de l’intégration continue de Gitlab. :pr:`64`

source: Fixed `client_secret` display on the client administration page. :pr:`65`
fr: Correction de l’affichage de l’attribut `client_secret` sur la page d’administration des clients. :pr:`65`

source: Fixed non-square logo CSS. :pr:`67`
fr: Correction de la feuille de style pour les logos non carrés. :pr:`67`

source: Fixed schema path on installation. :pr:`68`
fr: Correction des chemins d’installation des schémas. :pr:`68`

source: Fixed RFC7591 ``software_statement`` claim support. :pr:`70`
fr: Correction du paramètre ``software_statement` de la RFC7591. :pr:`70`

source: Fixed client preconsent disabling. :pr:`72`
fr: Correction de la désactivation du pré-consentement des clients. :pr:`72`

source: Python 3.11 support. :pr:`61`
fr: Support de Python 3.11. :pr:`61`

source: ``apparmor`` slapd configuration instructions in the documentation page for contributions. :pr:`66`
fr: Instructions concernant la configuration ``apparmor`` pour OpenLDAP dans la page de documentation sur les contributions. :pr:`66`

source: ``preferredLanguage`` attribute support. :pr:`75`
fr: Support de l’attribut utilisateur ``preferredLanguage``. :pr:`75`

source: Replaced the use of the deprecated `FLASK_ENV` environment variable by `FLASK_DEBUG`.
fr: Remplacement de la variable d’environnement dépréciée `FLASK_ENV` par `FLASK_DEBUG`.

source: Dynamically generate the server metadata. Users won't have to copy and manually edit ``oauth-authorizationserver.json`` and ``openid-configuration.json``. :pr:`71`
fr: Génération dynamique des métadonnées du serveur. Les utilisateurs n’auront plus à copier manuellement et éditer les fichiers ``oauth-authorizationserver.json`` et ``openid-configuration.json``. :pr:`71`

source: The `FROM_ADDR` configuration option is not mandatory anymore. :pr:`73`
fr: L’option de configuration ``FROM_ADDR``n’est plus obligatoire. :pr:`73`

source: The `JWT.ISS` configuration option is not mandatory anymore. :pr:`74`
fr: L’option de configuration ``JWT.ISS``n’est plus obligatoire. :pr:`74`

source: Basic WebFinger endpoint. :pr:`59`
fr: Support basique du point de terminaison WebFinger. :pr:`59`

source: Bumped to FomanticUI 2.9.0.
fr: Mise à jour vers FomanticUI 2.9.0.

source: Implemented Dynamic Client Registration. :pr:`60`
fr: Implémentation de l’enregistrement dynamique des clients OIDC. :pr:`60`

source: Default theme has a dark variant. :pr:`57`
fr: Le thème par défaut a une variante sombre. :pr:`57`

source: Fixed missing ``canaille`` binary. :pr:`58`
fr: Correction du binaire manquant ``canaille``. :pr:`58`

source: Online demo. :pr:`55`
fr: Démo en ligne. :pr:`55`

source: The consent page was displaying scopes not supported by clients. :pr:`56`
fr: La page de consentement affichait des domaines non supportés par les clients. :pr:`56`

source: Fixed end session when user are already disconnected.
fr: Correction de la fin de session lorsque les utilisateurs sont déjà déconnectés.

source: ``DISABLE_PASSWORD_RESET`` configuration option to disable password recovery. :pr:`46`
fr: Mise en place de l’option de configuration ``DISABLE_PASSWORD_RESET`` pour désactiver la fonctionnalité de réinitialisation des mots de passe. :pr:`46`

source: ``edit_self`` ACL permission to control user self edition. :pr:`47`
fr: Ajout de la permission ``edit_self`` pour contrôler l'auto-édition des données personnelles par les utilisateurs. :pr:`47`

source: `RP-initiated logout` implementation. :pr:`54`
fr: Implémentation de la norme OIDC `RP-initiated logout` :pr:`54`

source: Bumped to Authlib 1. :pr:`48`
fr: Mise à jour vers Authlib 1. :pr:`48`

source: Various documentation improvements. :pr:`50`
fr: Diverses améliorations de la documentation. :pr:`50`

source: Use poetry instead of setuptools as project management tool. :pr:`51`
fr: Utilisation de poetry à la place de setuptools comme outil de gestion de projet. :pr:`51`

source: Additional tests for the OIDC ``nonce`` parameter. :pr:`52`
fr: Tests additionnels concernant le paramètre OIDC ``nonce``. :pr:`52`

source: ``HIDE_INVALID_LOGIN`` behavior and default value.
fr: Comportement et valeur par défaut de ``HIDE_INVALID_LOGIN``.

source: Compiled translation catalogs are not versioned anymore. :pr:`49` :pr:`53`
fr: Les catalogues de traduction compilés ne sont plus versionnés. :pr:`49` :pr:`53`

source: Fixed dependencies.
fr: Correction des dépendances.

source: Fixed spaces and escaped special char in LDAP ``cn/dn`` attributes. :pr:`43`
fr: Correction des espaces et échappement des caractères spéciaux dans les attributs LDAP ``cn`` et ``dn``. :pr:`43`

source: Access token are JWT. :pr:`38`
fr: Les jetons d’accès sont des JWT. :pr:`38`

source: Default groups on invitations. :pr:`41`
fr: Groupes par défaut lors des invitations. :pr:`41`

source: LDAP schemas are shipped within the Canaille package. :pr:`42`
fr: Les schémas LDAP sont fournis avec le paquet Canaille. :pr:`42`

source: LDAP model objects have new identifiers. :pr:`37`
fr: Les objects LDAP ont de nouveaux identifiants. :pr:`37`

source: Admin menu dropdown display. :pr:`39`
fr: Le menu d’administration est déroulant. :pr:`39`

source: ``GROUP_ID_ATTRIBUTE`` configuration typo. :pr:`40`
fr: Correction d’une faute de frappe pour le paramètre de configuration ``GROUP_ID_ATTRIBUTE`` :pr:`40`

source: Client pre-authorization. :pr:`11`
fr: Pré-autorisation des clients OIDC. :pr:`11`

source: LDAP permissions check with the check command. :pr:`12`
fr: Vérification des permissions LDAP grâce à la commande `check`. :pr:`12`

source: Update consents when a scope required is larger than the scope of an already given consent. :pr:`13`
fr: Mise à jour des consentements lorsque le domaine requis est plus large que le domaine déjà autorisé. :pr:`13`

source: Theme customization. :pr:`15`
fr: Personnalisation du thème. :pr:`15`

source: Logging configuration. :pr:`16`
fr: Configuration de la journalisation. :pr:`16`

source: Installation command. :pr:`17`
fr: Commande d’installation. :pr:`17`

source: Invitation links. :pr:`18`
fr: Liens d’invitation. :pr:`18`

source: Advanced permissions. :pr:`20`
fr: Permissions avancées. :pr:`20`

source: An option to not use OIDC. :pr:`23`
fr: Une option pour désactiver OIDC. :pr:`23`

source: Disable some features when no SMTP server is configured. :pr:`24`
fr: Désactivation de quelques fonctionnalités lorsqu’aucun serveur SMTP n’a été configuré. :pr:`24`

source: Login placeholder dynamically generated according to the configuration. :pr:`25`
fr: Le texte d’exemple du champ de connexion est généré dynamiquement en fonction de la configuration. :pr:`25`

source: Added an option to tune object IDs. :pr:`26`
fr: Ajout d’une option pour paramétrer les identifiants des objets. :pr:`26`

source: Avatar support. :pr:`27`
fr: Support des avatars. :pr:`27`

source: Dynamical and configurable JWT claims. :pr:`28`
fr: Paramètres des jetons d’accès dynamiques et configurables. :pr:`28`

source: UI improvements. :pr:`29`
fr: Améliorations de l’interface utilisateur. :pr:`29`

source: Invitation links expiration. :pr:`30`
fr: Expiration des liens d’invitation. :pr:`30`

source: Invitees can choose their IDs. :pr:`31`
fr: Les invités peuvent choisir leur identifiant. :pr:`31`

source: LDAP backend refactoring. :pr:`35`
fr: Ré-usinage concernant la base de données LDAP. :pr:`35`

source: Fixed ghost members in a group. :pr:`14`
fr: Correction des membres fantômes dans les groupes. :pr:`14`

source: Fixed email sender names. :pr:`19`
fr: Correction de l’adresse email des émetteurs. :pr:`19`

source: Fixed filter being not escaped. :pr:`21`
fr: Les filtres n’étaient pas échappés. :pr:`21`

source: Demo script good practices. :pr:`32`
fr: Bonnes pratiques du script de démo. :pr:`32`

source: Binary path for Debian. :pr:`33`
fr: Chemins des binaires pour Debian. :pr:`33`

source: Last name was not mandatory in the forms while this was mandatory in the LDAP server. :pr:`34`
fr: Le nom de famille était facultatif dans les formulaires alors que c’est un paramètre obligatoire pour LDAP. :pr:`34`

source: Spelling typos. :pr:`36`
fr: Corrections de fautes d’orthographe. :pr:`36`

source: Two-steps sign-in. :issue:`49`
fr: Connexion en deux étapes. :issue:`49`

source: Tokens can have several audiences. :issue:`62` :pr:`9`
fr: Les jetons peuvent avoir plusieurs audiences. :issue:`62` :pr:`9`

source: Configuration check command. :issue:`66` :pr:`8`
fr: Commande de vérification de la configuration. :issue:`66` :pr:`8`

source: Groups management. :issue:`12` :pr:`6`
fr: Gestion des groupes. :issue:`12` :pr:`6`

source: Introspection access bugfix. :issue:`63` :pr:`10`
fr: Correction de l’accès au point de terminaison d’introspection OIDC. :issue:`63`:pr:`10`

source: Introspection sub claim. :issue:`64` :pr:`7`
fr: Support du paramètre ``sub``dans l’introspection OIDC. :issue:`64` :pr:`7`

source: Login page is responsive. :issue:`1`
fr: La page de connexion est réactive. :issue:`1`

source: Adapt mobile keyboards to login page fields. :issue:`2`
fr: Adaptation des claviers mobiles sur les champs de la page de connexion. :issue:`2`

source: Password recovery interface. :issue:`3`
fr: Interface de réinitialisation des mots de passe. :issue:`3`
