Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: Release notes
fr: Notes de version

source: All notable changes to this project will be documented in there.
fr: Tous les changements notables du projet seront documentés ici.

source: The format is based on `Keep a Changelog <https://keepachangelog.com/en/1.0.0/>`_, and this project adheres to `Semantic Versioning <https://semver.org/spec/v2.0.0.html>`_.
fr: Le format est basé sur `Keep a Changelog <https://keepachangelog.com/fr/1.0.0/>`_, et ce projet adhère à la politique de `versionnage sémantique <https://semver.org/lang/fr/spec/v2.0.0.html>`_.

source: Added
fr: Ajouté

source: Fixed
fr: Corrigé

source: Changed
fr: Modifié

source: Removed
fr: Supprimé

source: This version comes with a configuration breaking change.
fr: Cette version vient avec un changement majeur de configuration.

source: The OIDC configuration part have been reworked:
fr: La configuration OIDC a été retravaillée :

source: ``CANAILLE_OIDC.JWT.MAPPING`` becomes ``CANAILLE_OIDC.USERINFO_MAPPING``
fr: ``CANAILLE_OIDC.JWT.MAPPING`` devient ``CANAILLE_OIDC.USERINFO_MAPPING``

source: ``CANAILLE.JWT`` is removed. You can migrate your keys with this script:
fr: ``CANAILLE.JWT`` a été supprimé. Vous pouvez migrer vos clés grâce à ce script :

source: This version comes with a schema breaking change. The LDAP schema has evolved. If you use the LDAP schema, please follow the :ref:`ldap_schema_update` section.
fr: Cette version contient un changement majeur. Le schéma LDAP a évolué. Si vous utilisez LDAP, veuillez suivre la section :ref:`ldap_schema_update`.

source: Reworked the JWK configuration. :issue:`119`
fr: Réusinage de la configuration des JSON Web Keys. :issue:`119`

source: Mock gettext when ``flask-babel`` dependency is not installed.
fr: ``gettext`` factice lorsque la dépendance ``flask-babel`` n'est pas installée.

source: Support for OIDC authorization endpoint ``login`` and ``consent`` prompt parameters. :issue:`187`
fr: Support des valeurs ``login`` et ``consent`` du paramètre ``prompt`` du terminal d'autorisation OIDC. :issue:`187`

source: Return errors as redirection parameters in the authorization endpoint.
fr: Les erreurs du terminal d'autorisation sont passées en paramètres de réponses redirigées.

source: Clients without scope defined don't restrict scopes for token emission. :issue:`264`
fr: Les clients sans portée définie n'appliquent pas de restriction aux portées des jetons émis à leur compte. :issue:`264`

source: Userinfo ``address`` claim was not a JSON object. :issue:`269`
fr: Le paramètre UserInfo ``address`` n'était pas un objet JSON. :issue:`269`

source: ``updated_at`` claim in ``id_token`` and ``userinfo`` endpoint.
fr: Implémentation des paramètres ``updated_at`` et ``id_token`` en réponse du terminal ``userinfo``.

source: Support for POST method in OIDC authorization endpoint. :issue:`263`
fr: Support de la méthode d'authentification POST sur le point terminal d'autorisation. :issue:`263`

source: Client JWT authentication for OIDC refresh_token and password grants. :issue:`233`
fr: Authentification cliente par JWT pour les octrois OIDC `refresh_token` et `password`. :issue:`233`

source: Ensure `id_token` has a `kid` header. :issue:`245`
fr: Assurance que les `id_token` possèdent une en-tête `kid`. :issue:`245`

source: ``id_token`` session authentication time.
fr: Inclusion de la date d'authentification dans les ``id_token``.

source: Configuration exception when a feature is configured but its dependencies are missing.
fr: Exception de configuration lorsqu'une fonctionnalité est activée mais que les dépendances correspondantes sont manquantes.

source: Remove config dump in about page.
fr: Suppression de l'affichage de la configuration sur la page « à propos ».

source: Add a :attr:`~canaille.core.configuration.CoreSettings.FORCE_HTTPS` configuration parameter to allow to disable https forced redirections.
fr: Implémentation du paramètre de configuration :attr:`~canaille.core.configuration.CoreSettings.FORCE_HTTPS` qui permet de désactiver les redirections automatiques en HTTPS.

source: Configuration automatically discovers local SMTP server when available. :issue:`216`
fr: La configuration détecte automatiquement les serveurs SMTP locaux lorsqu'ils sont disponibles. :issue:`216`

source: :class:`~canaille.oidc.configuration.OIDCSettings.ENABLE_OIDC` configuration parameter.
fr: Paramètre de configuration :attr:`~canaille.core.configuration.CoreSettings.ENABLE_OIDC`.

source: Content Security Policy. :pr:`266`
fr: Implémentation de *Content Policy Security*. :pr:`266`

source: Locked account cannot reset their password. :issue:`250`
fr: Les comptes verrouillés ne peuvent pas réinitialiser leurs mots de passe. :issue:`250`

source: Canaille has default admin ACLs. :issue:`253`
fr: Canaille a une configuration de permissions par défaut. :issue:`253`

source: Phone number edition raising 400 with HTMX. :issue:`259`
fr: L'édition des numéros de téléphones levait une erreur HTTP 400 avec HTMX. :issue:`259`

source: LDAP partial restore. :issue:`257`
fr: Restauration partielle avec LDAP. :issue:`257`

source: Full OIDC Dynamic Client Registration implementation. :issue:`231`
fr: Implémentation complète de « OIDC Dynamic Client Registration ». :issue:`231`

source: This version comes with a CLI breaking change. The :ref:`delete command <cli_delete>` don't take arguments anymore. ``canaille delete user XXX`` becomes ``canaille delete user --id XXX``.
fr: Cette version vient avec un changement majeur concernant la commande terminal. La :ref:`commande delete <cli_delete>` ne prend plus d'argument. ``canaille delete user XXX`` devient ``canaille delete user --id XXX``.

source: The :ref:`delete command <cli_delete>` can use filter parameters.
fr: La :ref:`commande delete <cli_delete>` peut prendre des paramètres de filtrage.

source: This version comes with security fix. It is strongly advised to update to this version as soon as possible.
fr: Cette version apporte un correctif de sécurité. Il est vivement recommandé de mettre à jour vers cette version dès que possible.

source: Instructions in CONTRIBUTING.rst to update the docker image :issue:`59`
fr: Instructions dans CONTRIBUTING.rst pour mettre à jour l'image Docker :issue:`59`

source: Instructions in README.md to discover Canaille interface with a docker image :issue:`59`
fr: Instructions dans README.md pour utiliser l'image Docker :issue:`59`

source: The :ref:`cli dump <cli_dump>` command can dump only some given models.
fr: La commande :ref:`cli dump <cli_dump>` peut n'exporter que certains modèles choisis.

source: Implement the :class:`~canaille.app.configuration.RootSettings.TRUSTED_HOSTS` configuration parameter, to secure password reset e-mails.
fr: Implémentation du paramètre de configuration :class:`~canaille.app.configuration.RootSettings.TRUSTED_HOSTS` pour sécuriser les emails de réinitialisation de mot de passe.

source: :ref:`restore <cli_restore>` command implementation. :issue:`212` :issue:`215`
fr: Implémentation de la commande :ref:`restore <cli_restore>`. :issue:`212` :issue:`215`

source: Prevent clients from registering with fragment components in their redirect uri :issue:`235`
fr: Les clients OIDC ne peuvent plus s'enregistrer avec des ``redirect_uri`` contenant des fragments. :issue:`235`

source: Ensure there is a `redirect_uri` in authorization requests from clients. :issue:`232`
fr: Les clients doivent impérativement passer le paramètre `redirect_uri` dans les requêtes d'autorisation. :issue:`232`

source: Display client TOS uri and policy uri in authorization page if set during client registration
fr: Affichage des liens vers les conditions d'utilisation et vers la politique de confidentialité sur la page de consentement

source: User group membership is ordered with the SQL backend. :issue:`169`
fr: Les groupes d'utilisateurs sont ordonnés avec les bases de données SQL. :issue:`169`

source: This version comes with a configuration breaking change. The configuration parameter ``CANAILLE_LDAP.USER_FILTER`` is removed in favor of :class:`~canaille.core.configuration.CoreSettings.LOGIN_ATTRIBUTES`.
fr: Cette version vient avec une rupture de compatibilité dans la configuration. Le paramètre ``CANAILLE_LDAP.USER_FILTER`` est supprimé en faveur de :class:`~canaille.core.configuration.CoreSettings.LOGIN_ATTRIBUTES`.

source: Implement :rfc:`RFC7523 <7523>`. :issue:`112`
fr: Implémentation de la :rfc:`RFC7523 <7523>`. :issue:`112`

source: Implement the :class:`~canaille.core.configuration.CoreSettings.LOGIN_ATTRIBUTES` configuration parameter, to tweak the login attributes. :issue:`196`
fr: Implémentation du paramètre de configuration :class:`~canaille.core.configuration.CoreSettings.LOGIN_ATTRIBUTES` qui permet de personnaliser les attributs des utilisateurs à utiliser comme identifiants de connexion. :issue:`196`

source: Client dynamic registration with the ``jwks`` parameter. :pr:`228`
fr: Enregistrement dynamique des clients avec le paramètre ``jwks``. :pr:`228`

source: Use a custom LDAP image in the demo environment. :issue:`136`
fr: Utilisation d'une image Docker LDAP personnalisée dans l'environnement de démo :issue:`136`

source: Implement :rfc:`RFC9207 <9207>`. :pr:`227`
fr: Implémentation de la :rfc:`RFC9207 <9207>`. :pr:`227`

source: Canaille executable did not support i18n. :issue:`227`
fr: Les traductions ne fonctionnaient pas avec l'exécutable de Canaille. :issue:`227`

source: Dynamic `kid` parameter for JWKs. :issue:`222`
fr: Paramètre `kid` dynamique pour les JWKS. :issue:`222`

source: Improve ``canaille config check`` output.
fr: Amélioration de la sortie de ``canaille config check``.

source: Fix SQL ``install`` command. :issue:`221`
fr: Correction de la commande ``install`` avec SQL. :issue:`221`

source: Add screenshots in the documentation. :issue:`210`
fr: Captures d'écran dans la documentation. :pr:`210`

source: Implement a ``canaille run`` command that runs a production server with Hypercorn. :pr:`219`
fr: Implémentation d'une commande ``canaille run`` qui lance un serveur de production avec Hypercorn. :pr:`219`

source: Implement a ``canaille config dump`` command that create a commented config file. :pr:`223`
fr: Implémentation d'une commande ``canaille config dump`` qui crée un fichier de configuration commenté. :pr:`223`

source: Load configuration from local ``canaille.toml`` files. :pr:`225`
fr: Chargement de la configuration depuis un fichier ``canaille.toml`` local. :pr:`225`

source: Avoid displaying password strength progress bar in login form.
fr: L'indicateur de force de mot de passe n'est plus affiché sur la page de connexion.

source: Mysql extra depends on ``pymysql`` instead of ``mysql-connector``.
fr: L'extra MySQL dépend de ``pymysql`` au lieu de ``mysql-connector``.

source: :attr:`~canaille.app.configuration.RootSettings.SECRET_KEY` is not mandatory anymore, but displays warnings when unset. :pr:`221`
fr: Le paramètre de configuration :attr:`~canaille.app.configuration.RootSettings.SECRET_KEY` n'est plus obligatoire, mais affiche des avertissements lorsqu'il est manquant. :pr:`221`

source: Move the ``canaille check`` command under ``canaille config``.
fr: Déplacement de la commande ``canaille check`` vers ``canaille config``.

source: Dynamic client registration with missing ``scope`` parameter. :issue:`221` :pr:`222`
fr: Ajout du paramètre ``scope`` manquant lors de l'enregistrement dynamique des clients. :issue:`221` :pr:`222`

source: Fix password fields auto-refilling when input is reset. :issue:`218` :pr:`215`
fr: Correction du remplissage automatique du champs de mot de passe lorsqu'il est vidé. :issue:`218` :pr:`215`

source: Fix HTMX integration with the email confirmation form. :pr:`216`
fr: Correction de l'intégration d'HTMX avec le champ de confirmation des adresses email. :pr:`216`

source: Bump to HTMX 2.0.4
fr: Mise à jour vers HTMX 2.0.4

source: ``--version`` option to the CLI. :pr:`209`
fr: Option ``--version`` pour l'interface en ligne de commandes :pr:`209`

source: Password hashing scheme customization with the :attr:`~canaille.backends.sql.configuration.SQLSettings.PASSWORD_SCHEMES` parameter. :issue:`175`
fr: Personnalisation de l'algorithme de hachage des mots de passe avec le paramètre de configuration :attr:`~canaille.backends.sql.configuration.SQLSettings.PASSWORD_SCHEMES`. :issue:`175`

source: `canaille dump` command option to perform full database dumps.
fr: Option ``canaille dump`` pour effectuer des sauvegardes complètes de la base de données.

source: Automatic SQL database migrations. :issue:`217` :pr:`214`
fr: Migration automatique des bases de données SQL. :issue:`217` :pr:`214`

source: CLI commands dump hashed passwords. :issue:`214`
fr: Les commandes console affichent les mots de passe hachés. :issue:`214`

source: A bug on updating user's settings. :issue:`206`
fr: Correction d'un bug sur la mise à jours des paramètres utilisateurs. :issue:`206`

source: Intruder lockout, controlled by the :attr:`~canaille.core.configuration.CoreSettings.ENABLE_INTRUDER_LOCKOUT` configuration setting. :issue:`173`
fr: Verrouillage des comptes utilisateurs après connexions infructueuses, contrôlé par le paramètre de configuration :attr:`~canaille.core.configuration.CoreSettings.ENABLE_INTRUDER_LOCKOUT`. :issue:`173`

source: Multi-factor authentication, controlled by the :attr:`~canaille.core.configuration.CoreSettings.OTP_METHOD`, :attr:`~canaille.core.configuration.CoreSettings.EMAIL_OTP`, :attr:`~canaille.core.configuration.CoreSettings.SMS_OTP` configuration settings. :issue:`47`
fr: Authentification multi-facteurs, contrôlée par les paramètres de configuration :attr:`~canaille.core.configuration.CoreSettings.OTP_METHOD`, :attr:`~canaille.core.configuration.CoreSettings.EMAIL_OTP`, et :attr:`~canaille.core.configuration.CoreSettings.SMS_OTP`. :issue:`47`

source: Password compromission check, controlled by the :attr:`~canaille.core.configuration.CoreSettings.ENABLE_PASSWORD_COMPROMISSION_CHECK` and :attr:`~canaille.core.configuration.CoreSettings.PASSWORD_COMPROMISSION_CHECK_API_URL` settings. :issue:`179`
fr: Vérification de la compromission des mots de passe, contrôlée par les paramètres de configuration :attr:`~canaille.core.configuration.CoreSettings.ENABLE_PASSWORD_COMPROMISSION_CHECK` et :attr:`~canaille.core.configuration.CoreSettings.PASSWORD_COMPROMISSION_CHECK_API_URL`. :issue:`179`

source: :attr:`~canaille.core.configuration.CoreSettings.ADMIN_EMAIL` configuration setting.
fr: Paramètre de configuration :attr:`~canaille.core.configuration.CoreSettings.ADMIN_EMAIL`.

source: OIDC ``client_credentials`` flow implementation. :issue:`207`
fr: Implémentation du flux OIDC ``client_credentials``. :issue:`207`

source: Button in the client admin page to create client tokens.
fr: Bouton de création de jetons sur la page d’administration des clients.

source: Basic SCIM implementation. :issue:`116` :pr:`197`
fr: Implémentation basique du protocole SCIM. :issue:`116` :pr:`197`

source: Password expiry policy, controlled by the :attr:`~canaille.core.configuration.CoreSettings.PASSWORD_LIFETIME` configuration setting. :issue:`176`
fr: Politique d'expiration des mots de passe, contrôlée par le paramètre de configuration :attr:`~canaille.core.configuration.CoreSettings.PASSWORD_LIFETIME`. :issue:`176`

source: PostgreSQL and MySQL extras does not rely on libraries that need to be compiled.
fr: Les extras PostgreSQL et MySQL ne dépendent plus de bibliothèques qui doivent être compilées.

source: ``.env`` files are not loaded by default. The ``ENV_FILE`` env var must be passed so ``.env`` files are loaded.
fr: Les fichiers ``.env`` ne sont pas chargés par défaut. La variable d'environnement ``ENV_FILE`` doit être passé pour que les fichiers ``.env`` soient chargées.

source: With LDAP backend, updating another user groups could result in a permission lost for the editor. :issue:`202`
fr: Avec la base de données LDAP, la mise à jour des groupes d’utilisateurs pouvait engendrer une perte de permissions de l’éditeur. :issue:`202`

source: :attr:`~canaille.core.configuration.CoreSettings.MAX_PASSWORD_LENGTH` and :attr:`~canaille.core.configuration.CoreSettings.MIN_PASSWORD_LENGTH` configuration options :issue:`174`
fr: Options de configuration :attr:`~canaille.core.configuration.CoreSettings.MAX_PASSWORD_LENGTH` et :attr:`~canaille.core.configuration.CoreSettings.MIN_PASSWORD_LENGTH` :issue:`174`

source: Password strength visual indicator. :issue:`174`
fr: Indicateur visuel de la force des mots de passe :issue:`174`

source: Security events logs. :issue:`177`
fr: Journalisation des évènements de sécurité. :issue:`177`

source: Support for Python 3.13. :pr:`186`
fr: Support de Python 3.13. :pr:`186`

source: Update to `HTMX` 2.0.3. :pr:`184`
fr: Mise à jour vers HTMX 2.0.3. :pr:`184`

source: Migrate the Python project management tool from poetry to uv. :pr:`187`
fr: Migration de poetry à uv comme outil de gestion de projet Python. :pr:`187`

source: The ``sql`` package extra is now split between ``sqlite``, ``postgresql`` and ``mysql``.
fr: L’extra de paquet ``sql`` a été divisé en ``sqlite``, ``postgresql`` et ``mysql``.

source: End support for Python 3.9. :pr:`179`
fr: Fin de support pour Python 3.9. :pr:`179`

source: Use poetry-core build backend. :pr:`178`
fr: Utilisation de `poetry-core` comme outil de construction de paquets. :pr:`178`

source: Group member removal can be achieved from the group edition page. :issue:`192`
fr: La suppression des membres de groupes peut être effectuée depuis la page d’édition des groupes. :issue:`192`

source: Model management commands. :issue:`117` :issue:`54`
fr: Commande de gestion des modèles. :issue:`117` :issue:`54`

source: Model `identifier_attributes` are fixed.
fr: L’attribut `identifier_attributes` des models est fixe.

source: Bump to `HTMX` 1.9.12. :pr:`172`
fr: Mise-à-jour vers `HTMX` 1.9.12. :pr:`172`

source: Dark theme colors for better readability.
fr: Couleurs des champs dans le thème sombre.

source: Crash for passwordless users at login when no SMTP server was configured.
fr: Erreur lorsque les utilisateurs sans mots de passe lorsqu’aucun serveur SMTP n’a été configuré.

source: `env_prefix` `create_app`` variable can select the environment var prefix.
fr: La variable `env_prefix`de la méthode ``create_app`` permet de choisir le préfixe des variables d’environnement.

source: `env_file` create_app variable can customize/disable the .env file.
fr: La variable `env_file` de la méthode `create_app` permet de désactiver ou personnaliser le fichier `.env`.

source: Locked users cannot be impersonated anymore.
fr: Les comptes verrouillés ne peuvent plus être incarnés.

source: Minimum Python requirement is 3.9.
fr: La version minimum requise de Python est 3.9.

source: Display the menu bar on error pages.
fr: Affichage de la barre de menu sur les pages d’erreur.

source: Sign in/out events are logged in. :issue:`177`
fr: Journalisation des évènements de connexion et déconnexion. :issue:`177`

source: `HTMX` and `JAVASCRIPT` configuration settings.
fr: Paramètres de configuration `HTMX` et `JAVASCRIPT`.

source: Compatibility with old sessions IDs.
fr: Compatibilité avec les anciens identifiants de session.

source: LDAP user group removal.
fr: Suppression des groupes d’utilisateurs avec LDAP.

source: Display an error message when trying to remove the last user from a group.
fr: Affichage d’un message d’erreur lors de tentatives de suppression du dernier utilisateur d’un groupe.

source: LDAP ``objectClass`` guessing exception.
fr: Exception lors de la détection des classes d’objet LDAP.

source: Lazy permission loading exception.
fr: Exception lors du chargement paresseux des permissions.

source: Saving an object with the LDAP backend keeps the ``objectClass`` un-managed by Canaille. :pr:`171`
fr: La sauvegarde des objets avec LDAP garde les valeurs de ``objectClass`` non gérés par Canaille. :pr:`171`

source: Internal indexation mechanism of ``MemoryModel``.
fr: Mécanisme d’indexation interne de ``MemoryModel``.

source: Fix the default LDAP ``USER_FILTER`` value.
fr: Correction de la valeur par défaut de ``USER_FILTER`` pour LDAP.

source: Fix the OIDC feature detection.
fr: Correction de la détection de la fonctionnalité OIDC.

source: Configuration files must be updated.
fr: Les fichiers de configuration doivent être mis à jour.

source: Add ``created`` and ``last_modified`` datetime for all models.
fr: Ajout des dates ``created`` et ``last_modified`` pour tous les modèles.

source: Sitemap to the documentation. :pr:`169`
fr: Cartographie de la documentation. :pr:`169

source: Configuration management with `pydantic-settings`. :issue:`138` :pr:`170`
fr: Gestion des paramètres de configuration avec `pydantic-settings`. :issue:`138` :pr:`170`

source: Use default Python logging configuration format. :issue:`188` :pr:`165`
fr: Utilisation de la configuration de journalisation par défaut de Python. :issue:`188` :pr:`165`

source: Bump to `HTMX` 1.99.11. :pr:`166`
fr: Mise à jour vers ``HTMX`` 1.9.11. :pr:`166`

source: Use the standard tomllib Python module instead of `toml` starting from Python 3.11. :pr:`167`
fr: Utilisation du module Python standard `tomllib` à la place de `toml` à partir de Python 3.11. :pr:`167`

source: Use shibuya as the documentation theme :pr:`168`
fr: Utilisation du thème de documentation `shibuya`. :pr:`168`

source: Avoid to fail on imports if ``cryptography`` is missing.
fr: Correction d’une erreur d’import lorsque ``cryptography`` était manquant.

source: OIDC support for the ``create`` value of the ``prompt`` parameter. :issue:`185` :pr:`164`
fr: Support pour la valeur ``create`` du paramètre ``prompt`` d’OIDC. :issue:`185` :pr:`164`

source: Correctly set up :attr:`~canaille.oidc.basemodels.Client.audience` during OIDC dynamic registration.
fr: Configuration correcte de l’:attr:`~canaille.oidc.basemodels.Client.audience` durant l’enregistrement dynamique OIDC.

source: ``post_logout_redirect_uris`` was ignored during OIDC dynamic registration.
fr: ``post_logout_redirect_uris`` était ignoré durant l’enregistrement dynamique OIDC.

source: Group field error prevented the registration form validation.
fr: Une erreur sur le champ `groupe` empêchait la validation du formulaire d’enregistrement.

source: The ``THEME`` setting can be a relative path.
fr: Le paramètre de configuration ``THEME`` peut être un chemin relatif.

source: Crash when no ACL were defined.
fr: Erreur lorsqu’aucun ACL n’était défini.

source: OIDC Userinfo endpoint is also available in POST.
fr: Le point de terminaison OIDC `Userinfo` est aussi disponible avec la méthode POST.

source: Fix redirection after password reset. :issue:`159`
fr: Correction de la redirection après réinitialisation du mot de passe. :issue:`159`

source: Convert all the `PNG` pictures in `Webp`. :pr:`162`
fr: Conversion de toutes les images `PNG` en `Webp`. :pr:`162`

source: Update to Flask 3. :issue:`161` :pr:`163`
fr: Mise à jour vers Flask 3. :issue:`161` :pr:`163`

source: Handle 4xx and 5xx error codes with HTMX. :issue:`171` :pr:`161`
fr: Gestion des codes d’erreur 4xx et 5xx avec `HTMX`. :issue:`171` :pr:`161`

source: Avoid crashing when LDAP groups references unexisting users.
fr: Correction d’une erreur avec LDAP lorsque des groupes référencent des utilisateurs inexistants.

source: Password reset and initialization mails were only sent to the preferred user email address.
fr: Les courriels d’initialisation et de réinitialisation de mots de passe n’étaient envoyés qu’à l’adresse préférée des utilisateurs.
