Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: Thanks to its lightweight :ref:`in-memory database <tutorial/databases:Memory>` and its curated :ref:`dependency list <tutorial/install:Get the code>`, Canaille can be used in the unit test suite of your application, so you can check how it behaves against a real world OpenID Connect server. If you work with python you might want to check :doc:`pytest-iam:index`.
fr: Grâce à sa :ref:`base de données en mémoire <tutorial/databases:Memory>`légère et sa :ref:`liste de dépendances <tutorial/install:Get the code>`, Canaille peut être utilisé dans la suite de tests unitaires de votre application, pour que vous puissiez vérifier comment l'application se comporte face à un vrai serveur OpenID Connect. Si vous travaillez en python, vous pourriez être intéressé par :doc:`pytest-iam:index`.

source: Development server
fr: Serveur de développement

source: It can also being launched in your development environment, if you find that launching a Keycloak in a Docker container is too heavy for your little web application.
fr: Canaille peut également être lancé dans votre environnement de développement, si vous trouvez que lancer un Keycloak dans un conteneur Docker est trop lourd pour votre application web.

source: Continuous Integration tools
fr: Outils d'intégration continue

source: It also fits well in continuous integration scenarios. Thanks to its :ref:`CLI <feature_cli>`, you can prepare data in Canaille, let your application interact with it, and then check the side effects.
fr: Canaille s'intègre également bien dans des scénarios d'intégration continue. Grâce à son :ref:`CLI <feature_cli>`, vous pouvez préparer la donnée dans Canaille, laisser votre application interagir avec, puis observer les effets secondaires.

source: Roadmap
fr: Prévisionnel

source: Stable version
fr: Version stable

source: Before we push Canaille in stable version we want to achieve the following tasks:
fr: Avant de déployer Canaille en version stable, nous voulons réaliser les taches suivantes :

source: And beyond
fr: Et au-delà

source: :issue:`OpenID Connect certification <182>`
fr: :issue:`Certification OpenID Connect <182>`

source: Lightweight Identity and Authorization Management
fr: Serveur d’identité et d'autorisations ultra-léger

source: **Canaille** is a French word meaning *rascal*. It is roughly pronounced **Can I?**, as in *Can I access your data?* Canaille is a lightweight identity and authorization management software. It aims to be very light, simple to install and simple to maintain. Its main features are :
fr: **Canaille** est un mot français dont la prononciation (en anglais) ressemble à **Can I?**, comme dans *Can I access your data?* (Puis-je accéder à vos données ?). Canaille est un logiciel de gestion d'autorisation et d'identité léger. Il est conçu pour être très léger, simple à installer et simple à maintenir. Ses fonctionnalités principales sont :

source: User profile and groups management, Basic permissions
fr: Gestion de profils utilisateur et de groupes, permissions simples

source: SSO
fr: Authentification unique (SSO)

source: OpenID Connect identity provider
fr: Fournisseur d'identité OpenID Connect

source: Multi-database support
fr: Gestion de multiples bases de données

source: PostgreSQL, Mariadb and OpenLDAP first-class citizenship
fr: PostgreSQL, Mariadb et OpenLDAP sont des citoyens de première classe

source: Customization
fr: Personnalisation

source: Put Canaille at yours colors by choosing a logo or use a custom theme!
fr: Mettez Canaille à vos couleurs en choisissant un logo ou en utilisant un thème personnalisé !

source: Developers friendliness
fr: Facilité de développement

source: Canaille can easily fit in your unit tests suite or in your Continuous Integration.
fr: Canaille peut s'intégrer facilement dans votre suite de tests unitaires ou dans votre Intégration Continue.

source: :doc:`Full feature list <features>` :doc:`Common use cases <usecases>`
fr: :doc:`Liste complète des fonctionnalités <features>` :doc:`Cas d'usage <usecases>`

source: Canaille provide several commands to help administrator manage their data.
fr: Canaille dispose de plusieurs commandes pour aider les administrateurs à gérer leurs données.

source: Generally, some configuration has to be loaded by `Canaille`. This can be achieved by :ref:`configuration loading method<references/configuration:Load the configuration>` available, but most of the time a ``CONFIG`` environment variable is used. For the sake of readability, it is omitted in the following examples.
fr: Généralement, une configuration doit être chargée par `Canaille`. Cela peut être réalisé par :ref:`une méthode de chargement de la configuration<references/configuration:Load the configuration>` disponible, mais la plupart du temps une variable d'environnement ``CONFIG`` est utilisée. Pour des raisons de lisibilité, elle est omise dans les exemples suivants.

source: Handle Canaille configuration file.
fr: Manipule le fichier de configuration de Canaille.

source: Test the network connections defined in the configuration file.
fr: Test des connexions réseau définies dans le fichier de configuration.

source: Attempt to reach the database and the SMTP server with the provided credentials.
fr: Tentative pour accéder à la base de données et le serveur SMTP avec les identifiants fournis.

source: Export the configuration in TOML format.
fr: Exporte le fichier de configuration au format TOML.

source: The path to the config file
fr: Le chemin du fichier de configuration.

source: Run Canaille in a hypercorn application server.
fr: Lance un serveur de production Canaille avec Hypercorn.

source: Have a look at the :doc:`Hypercorn configuration documentation <hypercorn:how_to_guides/configuring>` to find how to configure it.
fr: Jetez un œil à la :doc:`documentation d'Hypercorn <hypercorn:how_to_guides/configuring>` pour savoir comment le configurer.

source: JSON Web Key management.
fr: Gestion des JSON Web Keys.

source: JSON Web Key creation.
fr: Création d'une JSON Web Key.

source: The key CRV
fr: La clé CRV

source: The key size
fr: La taille de clé

source: Remove expired tokens and authorization codes.
fr: Suppression des jetons expirés et des codes d'autorisation.

source: Dump all the available models.
fr: Retourne tous les objets disponibles.

source: If no argument is passed, all model instances are dumped.
fr: Si aucun argument n'est passé, toutes les instances de tous les modèles sont exportées.

source: Arguments
fr: Paramètres

source: Optional argument(s)
fr: Arguments optionnels

source: Installs canaille elements from the configuration.
fr: Installe les éléments de Canaille issus de la configuration.

source: For instance, depending on the configuration, this can generate OIDC keys or install LDAP schemas.
fr: Par exemple, selon la configuration, cela peut générer les clefs OIDC ou installer des schémas LDAP.

source: Populate the database with generated random data.
fr: Remplit la base de données avec des données générées aléatoirement.

source: Number of items to create
fr: Nombre d'éléments à créer

source: Populate the database with generated random groups.
fr: Remplit la base de données avec des groupes générés aléatoirement.

source: The maximum number of users that will randomly be affected in the group
fr: Le nombre maximum d'utilisateurs qui seront aléatoirement affectés dans le groupe

source: Populate the database with generated random users.
fr: Remplit la base de données avec des utilisateurs générés aléatoirement.

source: Search for authorizationcodes and display the matching models as JSON.
fr: Recherche les codes d'autorisation et affiche les modèles correspondants en JSON.

source: Search for clients and display the matching models as JSON.
fr: Recherche les clients et affiche les modèles correspondants en JSON.

source: Search for consents and display the matching models as JSON.
fr: Recherche les consentements et affiche les modèles correspondants en JSON.

source: Search for groups and display the matching models as JSON.
fr: Recherche les groupes et affiche les modèles correspondants en JSON.

source: Search for tokens and display the matching models as JSON.
fr: Recherche les jetons et affiche les modèles correspondants en JSON.

source: Search for users and display the matching models as JSON.
fr: Recherche les utilisateurs et affiche les modèles correspondants en JSON.

source: Update a authorizationcode and display the edited model in JSON format in the standard output.
fr: Met à jour un code d'autorisation et affiche le modèle modifié au format JSON sur la sortie standard.

source: IDENTIFIER should be a authorizationcode id or authorization_code_id
fr: IDENTIFIER devrait être un code d'autorisation ou authorization_code_id

source: Required argument
fr: Paramètre obligatoire

source: Update a client and display the edited model in JSON format in the standard output.
fr: Mise-à-jour du client et affiche le modèle modifié au format JSON sur la sortie standard.

source: IDENTIFIER should be a client id or client_id
fr: IDENTIFIER devrait être un identifiant client ou client_id

source: Update a consent and display the edited model in JSON format in the standard output.
fr: Met à jour un consentement et affiche un modèle modifié au format JSON sur la sortie standard.

source: IDENTIFIER should be a consent id or consent_id
fr: IDENTIFIER devrait être un identifiant de consentement ou consent_id

source: Update a group and display the edited model in JSON format in the standard output.
fr: Met à jour un groupe et affiche le modèle modifié au format JSON sur la sortie standard.

source: IDENTIFIER should be a group id or display_name
fr: IDENTIFIER devrait être un identifiant de groupe ou display_name

source: Update a token and display the edited model in JSON format in the standard output.
fr: Met à jour un jeton et affiche un modèle modifié au format JSON sur la sortie standard.

source: IDENTIFIER should be a token id or token_id
fr: IDENTIFIER devrait être un identifiant de token ou token_id

source: Update a user and display the edited model in JSON format in the standard output.
fr: Met à jour un utilisateur et affiche un modèle modifié au format JSON sur la sortie standard.

source: IDENTIFIER should be a user id or user_name
fr: IDENTIFIER devrait être un identifiant utilisateur ou user_name

source: Create a new authorizationcode and display the created model in JSON format in the standard output.
fr: Crée un nouveau code d'autorisation et affiche le modèle créé au format JSON sur la sortie standard.

source: Create a new client and display the created model in JSON format in the standard output.
fr: Crée un nouveau client et affiche le modèle créé au format JSON sur la sortie standard.

source: Create a new consent and display the created model in JSON format in the standard output.
fr: Crée un nouveau consentement et affiche le modèle créé au format JSON sur la sortie standard.

source: Create a new group and display the created model in JSON format in the standard output.
fr: Crée un nouveau groupe et affiche le modèle créé au format JSON sur la sortie standard.

source: Create a new token and display the created model in JSON format in the standard output.
fr: Crée un nouveau jeton et affiche le modèle créé au format JSON sur la sortie standard.

source: Create a new user and display the created model in JSON format in the standard output.
fr: Crée un nouvel utilisateur et affiche le modèle créé au format JSON sur la sortie standard.

source: Delete a authorizationcode.
fr: Supprime un code d'autorisation.

source: Ask for confirmation before deleting objects.
fr: Demander une confirmation avant de supprimer des objets.

source: Delete a client.
fr: Supprime un client.

source: Delete a consent.
fr: Supprime un consentement.

source: Delete a group.
fr: Supprime un groupe.

source: Delete a token.
fr: Supprime un jeton.

source: Delete a user.
fr: Supprime un utilisateur.

source: Load the configuration
fr: Chargement de la configuration

source: Canaille can be configured either by a environment variables, environment file, or by a configuration file.
fr: Canaille peut être configuré soit par des variables d'environnement variables, un fichier d'environnement ou par un fichier de configuration.

source: Configuration file
fr: Fichier de configuration

source: The configuration can be written in `toml` configuration file which path is passed in the :envvar:`CONFIG` environment variable.
fr: La configuration peut être écrite dans un fichier de configuration `toml` dont le chemin est passé dans la variable d'environnement :envvar:`CONFIG`.

source: You can have a look at the :ref:`example file <references/configuration:Example file>` for inspiration.
fr: Regardez le :ref:`fichier d'exemple <references/configuration:Example file>` pour vous inspirer.

source: Environment variables
fr: Variables d'environnement

source: In addition, parameters that have not been set in the configuration file can be read from environment variables. The way environment variables are parsed can be read from the `pydantic-settings documentation <https://docs.pydantic.dev/latest/concepts/pydantic_settings/#parsing-environment-variable-values>`_.
fr: De plus, les paramètres qui n'ont pas été définis dans le fichier de configuration peuvent être lus depuis les variables d'environnement. La façon dont les variables d'environnement sont analysées peut être lu dans la `documentation pydantic-settings <https://docs.pydantic.dev/latest/concepts/pydantic_settings/#parsing-environment-variable-values>`_.

source: For environment vars, the separator between sections and variables is a double underscore: ``__``. For instance, the ``NAME`` var in the ``CANAILLE`` section shown above is ``CANAILLE__NAME``.
fr: Pour les variables d'environnement, le séparateur entre les sections et les variables est un double souligné (underscore) : ``__``. Par exemple, la variable ``NAME`` dans la section ``CANAILLE`` affichée au-dessus est ``CANAILLE__NAME``.

source: Environment file
fr: Fichier d'environnement

source: Any environment variable can also be written in an environment file, which path should be passed in the ``ENV_FILE`` environment variable. For instance, set ``ENV_FILE=.env`` to load a ``.env`` file.
fr: N'importe quel variable d'environnement peut aussi être écrit dans un fichier d'environnement, dont le chemin devrait être passé dans la variable d'environnement ``ENV_FILE``. Par exemple, paramétrer ``ENV_FILE=.env`` pour charger un fichier ``.env``.

source: Configuration methods priority
fr: Priorité des méthodes de configuration

source: If a same configuration option is defined by different ways, here is how Canaille will choose which one to use:
fr: Si une option de configuration est définie de multiples façons, voici comment Canaille sélectionnera celle à utiliser :

source: environment vars have priority over the environment file and the configuration file;
fr: Les variables d'environnement sont prioritaires sur le fichier d'environnement et le fichier de configuration ;

source: environment file will have priority over the configuration file;
fr: Le fichier d'environnement est prioritaire sur le fichier de configuration;

source: if no configuration method is used, Canaille will look for a ``canaille.toml`` configuration file in the current working directory.
fr: si aucune méthode de configuration n'est utilisée, Canaille cherchera un fichier de configuration ``canaille.toml`` dans le répertoire de travail actuel.

source: Parameters
fr: Paramètres

source: The top-level namespace contains the configuration settings unrelated to Canaille.
fr: L'espace de nom de plus haut niveau contient les paramètres de configuration sans rapport avec Canaille.

source: The configuration parameters from the following libraries can be used:
fr: Les paramètres de configuration provenant des bibliothèques suivantes peuvent être utilisées :

source: The cache type.
fr: Le type de cache.

source: The default ``SimpleCache`` is a lightweight in-memory cache. See the :doc:`Flask-Caching documentation <flask-caching:index>` for further details.
fr: Le cache par défaut ``SimpleCache`` est un cache en-mémoire très léger. Consultez :doc:`la documentation de Flask-Caching <flask-caching:index>` pour plus d'informations.

source: The Flask :external:py:data:`DEBUG` configuration setting.
fr: Le paramétrage de configuration de Flask :external:py:data:`DEBUG`.

source: This enables debug options.
fr: Cela active les options de débogage.

source: This is useful for development but should be absolutely avoided in production environments.
fr: C'est utile lors du développement mais devrait être absolument évité sur des environnements de production.

source: The Flask :external:py:data:`PREFERRED_URL_SCHEME` configuration setting.
fr: Le paramétrage de la configuration de Flask :external:py:data:`PREFERRED_URL_SCHEME`.

source: This sets the url scheme by which canaille will be served.
fr: Cela paramètre le schéma d'URL avec lequel Canaille sera servi.

source: The Flask :external:py:data:`SECRET_KEY` configuration setting.
fr: Le paramétrage de la configuration de Flask :external:py:data:`SECRET_KEY`.

source: You MUST set a value before deploying in production.
fr: Vous DEVEZ indiquer une valeur avant de déployer en production.

source: The Flask :external:py:data:`SERVER_NAME` configuration setting.
fr: Le paramétrage de la configuration de Flask :external:py:data:`SERVER_NAME`.

source: This sets domain name on which canaille will be served.
fr: Cela paramètre le nom de domaine sur lequel Canaille sera servi.

source: This sets trusted values for hosts and validates hosts during requests.
fr: Cela définit des valeurs approuvées pour les hôtes et valide les hôtes lors des demandes.

source: The settings from the ``CANAILLE`` namespace.
fr: Les paramètres issus de l'espace de nom ``CANAILLE``.

source: Those are all the configuration parameters that controls the behavior of Canaille.
fr: Ce sont tous les paramètres de configuration contrôlant le comportement de Canaille.

source: Mapping of permission groups. See :class:`ACLSettings` for more details.
fr: Correspondance des groupes de droits. Voir :class:`ACLSettings` pour plus de détails.

source: The ACL name can be freely chosen. For example:
fr: Le nom des ACL peut être choisi librement. Par exemple :

source: Administration email contact.
fr: Contact e-mail de l'administration.

source: In certain special cases (example : questioning about password corruption), it is necessary to provide an administration contact email.
fr: Dans certains cas particuliers (par exemple en cas de questionnement sur la corruption de mot de passe), il est nécessaire de fournir un e-mail de contact pour l'administration.

source: Default is "sql" if available, else "memory".
fr: Par défaut, c’est "sql" si disponible, sinon "memory".

source: If :py:data:`True`, users will need to click on a confirmation link sent by email when they want to add a new email.
fr: Si :py:data:`True`, les utilisateurs auront besoin de cliquer sur un lien de confirmation envoyé par e-mail quand ils voudront en ajouter un nouveau.

source: By default, this is true if ``SMTP`` is configured, else this is false. If explicitly set to true and ``SMTP`` is disabled, the email field will be read-only.
fr: Par défaut, cela est vrai si ``SMTP`` est configuré, sinon c'est faux. S'il est explicitement paramétré à `true` et que ``SMTP`` est désactivé, le champ e-mail sera en lecture seule.

source: If :py:data:`True`, then users will have to wait for an increasingly long time between each failed login attempt.
fr: Si :py:data:`True`, les utilisateurs devront attendre un temps croissant entre des tentatives de connexion infructueuses.

source: If :py:data:`True`, Canaille will check if passwords appears in compromission databases such as `HIBP <https://haveibeenpwned.com>`_ when users choose a new one.
fr: Si :py:data:`True`, Canaille vérifiera si les mots de passe apparaissent dans des bases contenant des mots de passe compromis telles que `HIBP <https://haveibeenpwned.com>`_ quand les utilisateurs en choisiront un nouveau.

source: If :py:data:`False`, then users cannot ask for a password recovery link by email.
fr: Si :py:data:`False`, alors les utilisateurs ne peuvent pas demander un lien de récupération de mot de passe par e-mail.

source: If :py:data:`True`, then users can freely create an account at this instance.
fr: Si :py:data:`True`, les utilisateurs peuvent librement créer un compte sur cette instance.

source: If email verification is available, users must confirm their email before the account is created.
fr: Si la vérification d'e-mail est disponible, les utilisateurs doivent confirmer leur e-mail avant que le compte ne soit créé.

source: You favicon.
fr: Votre favicon.

source: If unset and :attr:`LOGO` is set, then the logo will be used.
fr: Si non paramétré et :attr:`LOGO` renseigné, alors le logo sera utilisé.

source: Whether to force the rediction of http requests to https.
fr: Indique s’il faut forcer la redirection des requêtes http vers https.

source: If :py:data:`True`, when users try to sign in with an invalid login, a message is shown indicating that the password is wrong, but does not give a clue whether the login exists or not.
fr: Si :py:data:`True`, quand les utilisateurs essaient de se connecter avec un identifiant invalide, un message indique que le mot de passe est incorrect mais ne fournit pas d'indice si l'identifiant existe ou non.

source: If :py:data:`False`, when a user tries to sign in with an invalid login, a message is shown indicating that the login does not exist.
fr: Si :py:data:`False`, quand un utilisateur essaie de se connecter avec un identifiant invalide, un message indique que l'identifiant n'existe pas.

source: Accelerates webpages loading with asynchronous requests.
fr: Accélère le chargement des pages web grâce à des requêtes asynchrones.

source: The validity duration of registration invitations, in seconds.
fr: Durée de validité des invitations, en secondes.

source: Defaults to 2 days.
fr: Deux jours par défaut.

source: Enables Javascript to smooth the user experience.
fr: Active Javascript pour améliorer l'expérience utilisateur.

source: If a language code is set, it will be used for every user.
fr: Si un code de langue est paramétré, il sera utilisé pour tous les utilisateurs.

source: If unset, the language is guessed according to the users browser.
fr: Si non renseigné, la langue est déterminée selon les préférences navigateur des utilisateurs.

source: Configures the logging output using the python logging configuration format:
fr: Configure l'enregistrement des journaux en utilisant le format de configuration des journaux Python :

source: If :data:`None`, everything is logged in the standard error output. The log level is :data:`~logging.DEBUG` if the :attr:`~canaille.app.configuration.RootSettings.DEBUG` setting is :py:data:`True`, else this is :py:data:`~logging.INFO`.
fr: Si :py:data:`None`, tout est écrit sur la sortie d'erreur standard. Le niveau de verbosité est :py:data:`~logging.DEBUG` si le paramètre :attr:`~canaille.app.configuration.RootSettings.DEBUG` est :py:data:`True`, sinon elle est:py:data:`~logging.

source: If this is a :class:`dict`, it is passed to :func:`logging.config.dictConfig`:
fr: Si c’est un :class:`dict`, il est passé à :func:`logging.config.dictConfig` :

source: If this is a :class:`str`, it is expected to be a file path that will be passed to :func:`logging.config.fileConfig`.
fr: Si c'est une :class:`str`, c'est supposé être un chemin de fichier qui sera passé à :func:`logging.config.fileConfig.

source: For example:
fr: Par exemple :
