Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: The authorization server MAY make these contact addresses available to end-users for support requests for the client. See Section 6 for information on Privacy Considerations.
fr: Le serveur d'autorisation PEUT rendre ces adresse de contact disponibles aux utilisateurs finaux pour traiter les requêtes pour le client. Consultez la section 6 pour obtenir des informations sur des considérations concernant la vie privée.

source: Array of OAuth 2.0 grant type strings that the client can use at the token endpoint. These grant types are defined as follows:
fr: Tableau de chaînes de caractères de type autorisation (« grant ») OAuth 2.0 que le client peut utiliser au terminal jeton. Ces types d'autorisation sont définies comme suit :

source: "authorization_code": The authorization code grant type defined in OAuth 2.0, Section 4.1.
fr: "authorization_code" : le type de code d'autorisation défini dans OAuth 2.0, section 4.1.

source: "implicit": The implicit grant type defined in OAuth 2.0, Section 4.2.
fr: "implicit" : le type d'autorisation implicite définie dans OAuth 2.0, section 4.2.

source: "password": The resource owner password credentials grant type defined in OAuth 2.0, Section 4.3.
fr: "password" : le type d'autorisation avec le mot de passe du propriétaire de la ressource défini dans OAuth 2.0, section 4.3.

source: "client_credentials": The client credentials grant type defined in OAuth 2.0, Section 4.4.
fr: "client_credentials" : le type d'autorisation par identification du client défini dans OAuth 2.0, section 4.4.

source: "refresh_token": The refresh token grant type defined in OAuth 2.0, Section 6.
fr: "refresh_token" : le type d'autorisation par jeton renouvelé dans OAuth 2.0, section 6.

source: "urn:ietf:params:oauth:grant-type:jwt-bearer": The JWT Bearer Token Grant Type defined in OAuth JWT Bearer Token Profiles [RFC7523].
fr: "urn:ietf:params:oauth:grant-type:jwt-bearer" : le type d'autorisation de jeton Bearer JWT défini dans OAuth JWT Bearer Token Profiles [RFC7523].

source: "urn:ietf:params:oauth:grant-type:saml2-bearer": The SAML 2.0 Bearer Assertion Grant defined in OAuth SAML 2 Bearer Token Profiles [RFC7522].
fr: "urn:ietf:params:oauth:grant-type:saml2-bearer" : l'autorisation SAML 2.0 « Bearer Assertion » défini dans OAuth SAML 2 Bearer Token Profiles [RFC7522].

source: If the token endpoint is used in the grant type, the value of this parameter MUST be the same as the value of the "grant_type" parameter passed to the token endpoint defined in the grant type definition. Authorization servers MAY allow for other values as defined in the grant type extension process described in OAuth 2.0, Section 4.5. If omitted, the default behavior is that the client will use only the "authorization_code" Grant Type.
fr: Si le terminal du jeton est utilisé dans le type d'autorisation, la valeur de ce paramètre DOIT être la même que la valeur du paramètre "grant_type" passé au terminal du jeton défini dans la définition du type d'autorisation. Les serveurs d'autorisation PEUVENT accepter d'autres valeurs comme défini dans le processus d'extension destype d'autorisation dans OAuth 2.0, section 4.5. S'il est omis, le comportement par défaut est un client utilisant uniquement le type d'autorisation "authorization_code".

source: Client's JSON Web Key Set [RFC7517] document value, which contains the client's public keys.
fr: Valeur du document JSON Web Key Set [RFC7517] du client, qui contient les clés publiques du client.

source: The value of this field MUST be a JSON object containing a valid JWK Set. These keys can be used by higher-level protocols that use signing or encryption. This parameter is intended to be used by clients that cannot use the "jwks_uri" parameter, such as native clients that cannot host public URLs. The "jwks_uri" and "jwks" parameters MUST NOT both be present in the same request or response.
fr: La valeur de ce champ DOIT être un objet JSON contenant un « JWK Set » valide. Ces clefs peuvent être utilisées par des protocoles de plus haut niveau qui utilise des signatures ou le chiffrement. Ce paramètre est conçu pour être utilisé par des clients qui ne peuvent pas utiliser le paramètre "jwks_uri", tel que des clients natifs qui ne peuvent pas disposer d'URL publiques. Les paramètres "jwks_uri" et "jwks" NE DOIVENT PAS être présent dans la même requête our réponse.

source: URL string referencing the client's JSON Web Key (JWK) Set [RFC7517] document, which contains the client's public keys.
fr: Chaîne de caractères URL référençant le document JSON Web Key (JWK) Set [RFC7517] du client, qui contient les clefs publiques du client.

source: The value of this field MUST point to a valid JWK Set document. These keys can be used by higher-level protocols that use signing or encryption. For instance, these keys might be used by some applications for validating signed requests made to the token endpoint when using JWTs for client authentication [RFC7523]. Use of this parameter is preferred over the "jwks" parameter, as it allows for easier key rotation. The "jwks_uri" and "jwks" parameters MUST NOT both be present in the same request or response.
fr: La valeur de ce champ DOIT pointer vers un document JWK Set valide. Ces clefs peuvent être utilisées par des protocoles de plus haut niveau utilisant des signatures ou du chiffrement. Par exemple, ces clefs peuvent être utilisées par des applications pour valider des requêtes signées faites pour le terminal du jeton quand des JWTs sont utilisées pour l'authentification cliente [RFC7523]. L'utilisation de ce paramètre est préféré au paramètre "jwks", car il permet une rotation des clefs plus facile. Les paramètres "jwks_uri" et "jwks" NE DOIVENT PAS être tous les deux présents dans la même requête ou réponse.

source: URL string that references a logo for the client.
fr: URL en chaîne de caractères pointant vers un logo pour le client.

source: If present, the server SHOULD display this image to the end-user during approval. The value of this field MUST point to a valid image file. The value of this field MAY be internationalized, as described in Section 2.2.
fr: Si présente, le serveur DOIT afficher cette image à l'utilisateur final pendant l'approbation. La valeur de ce chant DOIT pointer vers un fichier d'image valide. La valeur de ce champ PEUT être dans plusieurs langues, comme décrit dans la Section 2.2.

source: URL string that points to a human-readable privacy policy document that describes how the deployment organization collects, uses, retains, and discloses personal data.
fr: URL en chaîne de caractères pointant vers un document de politique de confidentialité compréhensible, décrivant la façon dont l'organisation déployant l'application collecte, utilise, conserve et partage les données personnelles.

source: The authorization server SHOULD display this URL to the end-user if it is provided. The value of this field MUST point to a valid web page. The value of this field MAY be internationalized, as described in Section 2.2.
fr: Le serveur d'autorisation DEVRAIT afficher cette URL à l'utilisateur final s'il est fourni. La valeur de ce champ DOIT pointer vers une page web valide. La valeur de ce champ PEUT être internationalisée, comme décrit dans la section 2.2.

source: Array of URLs supplied by the RP to which it MAY request that the End-User's User Agent be redirected using the post_logout_redirect_uri parameter after a logout has been performed. These URLs SHOULD use the https scheme and MAY contain port, path, and query parameter components; however, they MAY use the http scheme, provided that the Client Type is confidential, as defined in Section 2.1 of OAuth 2.0 [RFC6749], and provided the OP allows the use of http RP URIs.
fr: Tableau d'URL fourni par le RP qui PEUT demander que l'agent utilisateur de d'utilisateur final soit redirigé en utilisant le paramètre post_logout_redirect_uri après que la déconnexion ait été réalisée. Ces URL DEVRAIT utiliser le schéma https et PEUVENT contenir des composants tel que le port, chemin et des paramètres de requête ; cependant, ils PEUVENT utiliser le schéma http, à condition que le type du client est confidentiel, tel que défini dans la section 2.1 de OAuth 2.0 [RFC6749], et que l'OP autorise l'utilisation d'URI RP http.

source: Array of redirection URI strings for use in redirect-based flows such as the authorization code and implicit flows.
fr: Tableau de chaîne de caractères de redirection URI à utiliser pour les flux basés sur les redirections tel que le code d'autorisation et les flux implicites.

source: As required by Section 2 of OAuth 2.0 [RFC6749], clients using flows with redirection MUST register their redirection URI values. Authorization servers that support dynamic registration for redirect-based flows MUST implement support for this metadata value.
fr: La section 2 de OAuth 2.0 [RFC6749] oblige à ce que les clients utilisant des flux avec une redirection DOIVENT enregistrer les valeurs des URI de redirection. Les serveurs d'autorisation acceptant l'enregistrement dynamique pour des flux basés sur les redirections DOIVENT implémenter la gestion de la valeur de cette métadonnéee.

source: Array of the OAuth 2.0 response type strings that the client can use at the authorization endpoint. These response types are defined as follows:
fr: Tableau de chaînes de caractères de type réponse OAuth 2.0 que le client peut utiliser dans un terminal d'autorisation. Ces types de réponse sont définies comme suit :

source: "code": The authorization code response type defined in OAuth 2.0, Section 4.1.
fr: "code" : le type de réponse du code d'autorisation défini dans OAuth 2.0, section 4.1.

source: "token": The implicit response type defined in OAuth 2.0, Section 4.2.
fr: "token" : le type de réponse implicite défini dans OAuth 2.0, section 4.2.

source: If the authorization endpoint is used by the grant type, the value of this parameter MUST be the same as the value of the "response_type" parameter passed to the authorization endpoint defined in the grant type definition. Authorization servers MAY allow for other values as defined in the grant type extension process is described in OAuth 2.0, Section 4.5. If omitted, the default is that the client will use only the "code" response type.
fr: Si le terminal d'autorisation est utilisé par le type d'autorisation, la valeur de ce paramètre DOIT être le même que la valeur du paramètre "response_type" passé au terminal d'autorisation défini dans la définition du type d'autorisation. Les serveurs d'autorisation PEUVENT autoriser d'autres valeurs telles que définies dans le processus d'extension des types d'autorisation tel que décrit dans OAuth 2.0, section 4.5. S'il est omis, la valeur par défaut est que le client utilisera uniquement le type de réponse "code".

source: String containing a space-separated list of scope values (as described in Section 3.3 of OAuth 2.0 [RFC6749]) that the client can use when requesting access tokens.
fr: Chaîne de caractères contenant une liste séparée par des espaces de valeurs de périmètre (comme décrit dans la section 3.3 de OAuth 2.0 [RFC6749]) que le client peut utiliser quand il demande des jetons d'accès.

source: The semantics of values in this list are service specific. If omitted, an authorization server MAY register a client with a default set of scopes.
fr: La sémantique des valeur dans cette liste sont spécifiques au service. Si omis, un serveur d'autorisation PEUT enregistrer un client avec un ensemble de périmètres par défaut.

source: A unique identifier string (e.g., a Universally Unique Identifier (UUID)) assigned by the client developer or software publisher used by registration endpoints to identify the client software to be dynamically registered.
fr: Une chaîne de caractère servant d'identifiant unique (par exemple un « Universally Unique Identifier » (UUID)) assigné par le développeur du client ou le fournisseur du logiciel utilisé par les terminaux d'enregistrement identifie le logiciel client pour l'enregistrer dynamiquement.

source: Unlike "client_id", which is issued by the authorization server and SHOULD vary between instances, the "software_id" SHOULD remain the same for all instances of the client software. The "software_id" SHOULD remain the same across multiple updates or versions of the same piece of software. The value of this field is not intended to be human readable and is usually opaque to the client and authorization server.
fr: Contrairement à "client_id", qui est généré par le serveur d'autorisation et DEVRAIT varier selon les instances, "software_id" DEVRAIT rester le même pour toutes les instances du logiciel client. La valeur "software_id" DEVRAIT rester la même après de multiple mises-à-jour ou version du logiciel. La valeur de ce champ n'est pas prévu pour être lisible par des humain et est généralement opaque pour le client et le serveur d'autorisation.

source: A version identifier string for the client software identified by "software_id".
fr: Une chaîne de caractère identifiant une version pour le logiciel client identifié par "software_id".

source: The value of the "software_version" SHOULD change on any update to the client software identified by the same "software_id". The value of this field is intended to be compared using string equality matching and no other comparison semantics are defined by this specification. The value of this field is outside the scope of this specification, but it is not intended to be human readable and is usually opaque to the client and authorization server. The definition of what constitutes an update to client software that would trigger a change to this value is specific to the software itself and is outside the scope of this specification.
fr: La valeur de "software_version" DEVRAIT changer à chaque mise-à-jour du logiciel client identifié par le même "software_id". La valeur de ce champ est conçu pour être comparé en utilisant les comparaisons de chaînes et aucune autre sémantique de comparaison n'est définie dans cette spécification. La valeur de ce champ est exclu du périmètre de cette spécification, mais elle n'est pas conçu pour être lisible par des humains et est généralement opaque pour le client et le serveur d'autorisation. La définition de ce qui constitue une mise-à-jour du logiciel client provoquant un changement de cette valeur est spécifique au logiciel lui-même et est exclu du périmètre de cette spécification.

source: String indicator of the requested authentication method for the token endpoint. Values defined by this specification are:
fr: Indicateur en chaîne de caractères de la méthode d'authentification demandée pour le terminal du jeton. Les valeurs définies par cette spécification sont :

source: "none": The client is a public client as defined in OAuth 2.0, Section 2.1, and does not have a client secret.
fr: "none" : le client est un client public tel que défini dans OAuth 2.0, section 2.1, et n'a pas de secret client.

source: "client_secret_post": The client uses the HTTP POST parameters as defined in OAuth 2.0, Section 2.3.1.
fr: "client_secret_post" : le client utilise les paramètres HTTP POST tel que défini dans OAuth 2.0, section 2.3.1.

source: "client_secret_basic": The client uses HTTP Basic as defined in OAuth 2.0, Section 2.3.1.
fr: "client_secret_basic" : le client utilise HTTP Basic tel que défini dans OAuth 2.0, section 2.3.1.

source: Additional values can be defined via the IANA "OAuth Token Endpoint Authentication Methods" registry established in Section 4.2. Absolute URIs can also be used as values for this parameter without being registered. If unspecified or omitted, the default is "client_secret_basic", denoting the HTTP Basic authentication scheme as specified in Section 2.3.1 of OAuth 2.0.
fr: Des valeurs supplémentaires peuvent être défini par le registre "OAuth Token Endpoint Authentication Methods" IANA indiqué dans la section 4.2. Des URI absolues peuvent aussi être utilisées comme valeurs pour ce paramètre sans être enregistrées. Si non définie ou omise, la valeur par défaut est "client_secret_basic", indiquant un schéma « HTTP Basic authentication » comme spécifié dans la section 2.3.1 de OAuth 2.0.

source: URL string that points to a human-readable terms of service document for the client that describes a contractual relationship between the end-user and the client that the end-user accepts when authorizing the client.
fr: Chaîne de caractères URL pointant vers un document des conditions d'utilisation du service lisible par des humains pour le client, décrivant la relation contractuelle entre l'utilisateur final et le client que l'utilisateur final accepte quand il autorise le client.

source: Long-term user consent to an application.
fr: Consentement utilisateur à long terme à une application.

source: OpenID Connect token definition.
fr: Définition de jeton OpenID Connect.

source: Indicate whether the user accounts can be locked.
fr: Indique si les comptes utilisateur peuvent être verrouillés.

source: It depends on the backend used by Canaille. This is only disabled for OpenLDAP versions under 2.6.
fr: Cela dépend de la base de données utilisée par Canaille. C'est uniquement désactivé pour les versions d'OpenLDAP inférieures à 2.6.

source: Indicate whether the user email confirmation is enabled.
fr: Indique si la confirmation des adresses email des utilisateurs est activée.

source: It is controlled by the :attr:`CANAILLE.EMAIL_CONFIRMATION <canaille.core.configuration.CoreSettings.EMAIL_CONFIRMATION>` configuration parameter.
fr: Contrôlé par le paramètre de configuration :attr:`CANAILLE.EMAIL_CONFIRMATION <canaille.core.configuration.CoreSettings.EMAIL_CONFIRMATION>`.

source: Indicate whether the intruder lockout feature is enabled.
fr: Indique si le verrouillage temporaire des comptes utilisateur après échecs de connexion est activé.

source: It is controlled by the :attr:`CANAILLE.ENABLE_INTRUDER_LOCKOUT <canaille.core.configuration.CoreSettings.ENABLE_INTRUDER_LOCKOUT>` configuration parameter.
fr: Contrôlé par le paramètre de configuration :attr:`CANAILLE.ENABLE_INTRUDER_LOCKOUT <canaille.core.configuration.CoreSettings.ENABLE_INTRUDER_LOCKOUT>`.

source: Indicate whether the OIDC feature is enabled.
fr: Indique si la fonctionnalité OIDC est activé.

source: This feature is required to make Canaille an authorization server for other applications and enable SSO. It is controlled by the :class:`CANAILLE_OIDC <canaille.oidc.configuration.OIDCSettings>` configuration parameter, and needs the ``oidc`` extra package to be installed.
fr: Cette fonctionnalité est requise pour que Canaille fasse office de serveur d'authentification et d'autorisation pour d'autres applications, et permettre l'authentification unique des utilisateurs. Cette fonctionnalité est contrôlée par le paramètre de configuration :class:`CANAILLE_OIDC <canaille.oidc.configuration.OIDCSettings>` ainsi que le paquet extra ``oidc``.

source: Indicate whether the OTP authentication factor is enabled.
fr: Indique si le facteur d'authentification de mot de passe à usage unique est actif.

source: It is controlled by the :attr:`CANAILLE.OTP_METHOD <canaille.core.configuration.CoreSettings.OTP_METHOD>` configuration parameter, and needs the ``otp`` extra package to be installed.
fr: Cette fonctionnalité est contrôléé par le paramètre de configuration :attr:`CANAILLE.OTP_METHOD <canaille.core.configuration.CoreSettings.OTP_METHOD>`, et nécessite le paquet extra ``otp``.

source: Indicate whether the password recovery feature is enabled.
fr: Indique si la fonctionnalité de réinitialisation de mot de passe est activée.

source: It is controlled by the :attr:`CANAILLE.ENABLE_PASSWORD_RECOVERY <canaille.core.configuration.CoreSettings.ENABLE_PASSWORD_RECOVERY>` configuration parameter.
fr: Cette fonctionnalité est contrôlé par le paramètre de configuration :attr:`CANAILLE.ENABLE_PASSWORD_RECOVERY <canaille.core.configuration.CoreSettings.ENABLE_PASSWORD_RECOVERY>`.

source: Indicate whether the user account registration is enabled.
fr: Indique si la fonctionnalité d'enregistrement de comptes utilisateurs est activée.

source: It is controlled by the :attr:`CANAILLE.ENABLE_REGISTRATION <canaille.core.configuration.CoreSettings.ENABLE_REGISTRATION>` configuration parameter.
fr: Cette fonctionnalité est contrôlée par le paramètre de configuration :attr:`CANAILLE.ENABLE_REGISTRATION <canaille.core.configuration.CoreSettings.ENABLE_REGISTRATION>`.

source: Indicate whether the SCIM client feature is enabled.
fr: Indique si la fonctionnalité de client SCIM est activée.

source: This feature is required to make Canaille a provisioning client. It is controlled by the :attr:`CANAILLE_SCIM.ENABLE_CLIENT <canaille.scim.configuration.SCIMSettings.ENABLE_CLIENT>` configuration parameter, and needs the ``scim`` extra package to be installed.
fr: Cette fonctionnalité est requise pour faire de Canaille un client de provisionnement. Elle est contrôlée par le paramètre de configuration :attr:`CANAILLE_SCIM.ENABLE_CLIENT <canaille.scim.configuration.SCIMSettings.ENABLE_SERVER>`, et nécessite que l'extra ``scim`` soit installé.

source: Indicate whether the SCIM server feature is enabled.
fr: Indique si la fonctionnalité de serveur SCIM est activée.

source: This feature is required to make Canaille a provisioning server. It is controlled by the :attr:`CANAILLE_SCIM.ENABLE_SERVER <canaille.scim.configuration.SCIMSettings.ENABLE_SERVER>` configuration parameter, and needs the ``scim`` extra package to be installed.
fr: Cette fonctionnalité est requise pour faire de Canaille un serveur de provisionnement. Elle est contrôlée par le paramètre de configuration :attr:`CANAILLE_SCIM.ENABLE_SERVER <canaille.scim.configuration.SCIMSettings.ENABLE_SERVER>`, ainsi que le paquet extra ``scim``.

source: Indicate whether the mail sending feature is enabled.
fr: Indique si la fonctionnalité d'envoi de mail est activée.

source: This feature is required to :attr:`validate user email addresses <canaille.app.features.Features.has_email_confirmation>`, send email OTP passwords etc. It is controlled by the :attr:`CANAILLE.SMTP <canaille.core.configuration.CoreSettings.SMTP>` configuration parameter.
fr: Cette fonctionnalité est requise pour :attr:`valider les adresses email des utilsiateurs <canaille.app.features.Features.has_email_confirmation>`, envoyer des mots de passe à usage unique par mail etc. Elle est contrôlée par le paramètre de configuration :attr:`CANAILLE.SMTP <canaille.core.configuration.CoreSettings.SMTP>`.

source: Templates
fr: Patrons

source: This references the template files, their role and the variables available in their contexts. The intended audience for this reference is designers wishing to build their custom Canaille theme.
fr: Cette page référence les fichiers de patrons (« template »), leurs rôles ainsi que les variables disponibles dans leurs contextes. L'audience visée pour cette référence sont les designers qui souhaitent construire un thème personnalisé pour Canaille.

source: Those templates are shared by all the pages rendered by Canaille.
fr: Ces patrons sont partagés par toutes les pages de Canaille.

source: Template files
fr: Fichiers de patrons

source: The main template inherited by almost every other templates.
fr: Le patron principal dont hérite à peu près tous les autres patrons.

source: The current user, if logged in.
fr: L'utilisateur courant, si connecté.

source: The features enabled and available in Canaille.
fr: Les fonctionnalités disponibles, et activées dans Canaille.

source: The user locale.
fr: La code de la langue utilisée par l'utilisateur.
