Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: User profile interface. :issue:`4`
fr: Interface de gestion des profiles utilisateur. :issue:`4`

source: Renamed the project *Canaille*. :issue:`5`
fr: Renommage du projet en *Canaille*. :issue:`5`

source: Command to remove old tokens. :issue:`17`
fr: Commande pour supprimer les jetons expirés. :issue:`17`

source: Improved password recovery email. :issue:`14` :issue:`26`
fr: Améliorations sur le courriel de réinitialisation de mot de passe. :issue:`14` :issue:`26`

source: Use Flask `SERVER_NAME` configuration variable instead of `URL`. :issue:`24`
fr: Utilisation du paramètre de configuration Flask ``SERVER_NAME`` à la place d’``URL``. :issue:`24`

source: Improved consents page. :issue:`27`
fr: Améliorations sur la page de consentement. :issue:`27`

source: Admin user page. :issue:`8`
fr: Page d’administration des utilisateurs. :issue:`8`

source: Project logo. :pr:`29`
fr: Logo pour le projet. :pr:`29`

source: User account self-deletion can be enabled in the configuration with `SELF_DELETION`. :issue:`35`
fr: L’auto-suppression des comptes est configurable avec le paramètre de configuration ``SELF_DELETION``. :issue:`35`

source: Admins can impersonate users. :issue:`39`
fr: Les administrateurs peuvent prendre l’identité des utilisateurs. :issue:`39`

source: Forgotten page UX improvement. :pr:`43`
fr: Améliorations sur l’interface utilisateur de la page des mots de passe oubliés. :pr:`43`

source: Admins can remove clients. :pr:`45`
fr: Les administrateurs peuvent supprimer des clients. :pr:`45`

source: Option `HIDE_INVALID_LOGIN` that can be unactivated to let the user know if the login he attempt to sign in with exists or not. :pr:`48`
fr: Le paramètre de configuration ``HIDE_INVALID_LOGIN`` peut-être utilisé pour laisser ou non les utilisateurs savoir si le compte avec lequel ils tentent de se connecter existe ou pas. :pr:`48`

source: Password initialization mail. :pr:`51`
fr: Courriels d’initialisation des mots de passe. :pr:`51`

source: Form translations. :issue:`19` :issue:`23`
fr: Traductions des formulaires. :issue:`19` :issue:`23`

source: Avoid to use Google Fonts. :issue:`21`
fr: Utilisations d’autres polices que celles de Google Fonts. :issue:`21`

source: 'My tokens' page. :issue:`22`
fr: Page « Mes jetons ». :issue:`22`

source: Initial release.
fr: Publication initiale.

source: Contributions are welcome!
fr: Les contributions sont bienvenues !

source: The repository is hosted at `gitlab.com/yaal/canaille <https://gitlab.com/yaal/canaille>`_.
fr: Le dépôt de code est hébergé sur `gitlab.com/yaal/canaille <https://gitlab.com/yaal/canaille>`_.

source: Discuss
fr: Discuter

source: If you want to implement a feature or a bugfix, please start by discussing it with us on the `bugtracker <https://gitlab.com/yaal/canaille/-/issues>`_ or the `matrix room <https://matrix.to/#/#canaille-discuss:yaal.coop>`_.
fr: Si vous souhaitez développer une fonctionnalité ou corriger un dysfonctionnement, veuillez commencer par en discuter sur `l’outil de gestion de ticket <https://gitlab.com/yaal/canaille/-/issues>`_ ou bien sur le `salon Matrix <https://matrix.to/#/#canaille-discuss:yaal.coop>`_.

source: Development environment
fr: Environnement de développement

source: You can either run the development server locally or with Docker.
fr: Vous pouvez lancer le serveur de développement localement ou bien avec Docker.

source: After having launched the development server, you have access to several services:
fr: Après avoir lancé le serveur de développement, vous avec accès à plusieurs services :

source: A canaille server at `canaille.localhost:5000 <http://canaille.localhost:5000>`__
fr: Un serveur Canaille à l’adresse `canaille.localhost:5000 <http://canaille.localhost:5000>`__

source: A dummy client at `client1.localhost:5001 <http://client1.localhost:5001>`__
fr: Un client factice à l’adresse `client1.localhost:5001 <http://client1.localhost:5001>`__

source: Another dummy client at `client2.localhost:5002 <http://client2.localhost:5002>`__
fr: Un autre client factice à l’adresse `client2.localhost:5002 <http://client2.localhost:5002>`__

source: A mail catcher at `maildump.localhost:1080 <http://maildump.localhost:1080>`__
fr: Un serveur mail factice à l'adresse `maildump.localhost:1080 <http://maildump.localhost:1080>`_

source: The canaille server has some default users:
fr: Le serveur Canaille embarque quelques utilisateurs par défaut :

source: A regular user which login and password are **user**;
fr: Un utilisateur de base dont l’identifiant et le mot de passe sont **user** ;

source: A moderator user which login and password are **moderator**;
fr: Un modérateur dont l’identifiant et le mot de passe sont **moderator** ;

source: An admin user which admin and password are **admin**;
fr: Un administrateur dont l’identifiant et le mot de passe sont **admin** ;

source: A new user which login is **james**. This user has no password yet, and his first attempt to log-in would result in sending a password initialization email (if a smtp server is configured).
fr: Un nouvel utilisateur dont l’identifiant est **james**. Cet utilisateur n’a pas de mot de passe défini, et sa première tentative de connexion résultera en l'envoi d’un email d’initialisation de mot de pass (si un serveur SMTP est configuré).

source: Canaille comes with several backends:
fr: Canaille peut se connecter à plusieurs types de bases de données :

source: a lightweight test purpose `memory` backend
fr: une base de données très légère `memory` à fins de tests

source: a `sql` backend, based on sqlalchemy
fr: une base de données `SQL`, utilsant SQLAlchemy

source: a production-ready `LDAP` backend
fr: une base de données `LDAP` prête à l’emploi

source: Local environment
fr: Environnement local

source: The only tool required for local development is `uv`. Make sure to have uv `installed on your computer <https://docs.astral.sh/uv/getting-started/installation/>`_ to be able to hack Canaille.
fr: Le seul outil requis pour développer localement est `uv`. Assurez-vous d’avoir uv `installé sur votre système <https://docs.astral.sh/uv/getting-started/installation/>`_ afin de pouvoir développer Canaille.

source: Initialize your development environment with:
fr: Initialisez votre environnement de développement avec :

source: ``uv sync --all-groups --all-extras`` if you want to have everything at your fingertips. Note that it may compile some Python dependencies that would expect things to be installed on your system;
fr: ``uv sync --all-groups --all-extras`` si vous souhaitez avoir tout à portée de main. Notez que cela requerra peut-être de compiler certaines dépendances Python, qui nécessiterons l’installation de certaines bibliothèques sur votre système ;

source: ``uv sync --extra front --extra oidc`` to have a minimal working development environment. This will allow you to run the tests with ``uv pytest --backend memory``.
fr: ``uv sync --extra front --extra oidc`` pour obtenir un environnement de développement minimal. Cela vous permettra d’exécuter les tests avec ``uv pytest --backend memory``.

source: ``uv sync --extra front --extra oidc --extra sqlite`` to have a minimal working development environment with SQLite backend support. This will allow you to run the tests with ``uv pytest --backend sql``.
fr: ``uv sync --extra front --extra oidc --extra sqlite`` pour obtenir un environnement de développement minimal avec le support des bases de données SQLite. Cela vous permettra d’exécuter les tests avec ``uv pytest --backend sql``.

source: ``uv sync --extra front --extra oidc --extra ldap`` to have a minimal working development environment with LDAP backend support. This will allow you to run the tests with ``uv pytest --backend ldap``. Some dependencies of Canaille might need to be compiled, so you probably want to check that `GCC` and `cargo` are available on your computer.
fr: ``uv sync --extra front --extra oidc --extra ldap`` pour obtenir un environnement de développement minimal avec le support pour les bases de données LDAP. Cela vous permettra d’exécuter les tests avec ``uv pytest --backend ldap``. Certaines dépendances de Canaille auront peut-être besoin d’être compilées, vous voudrez probablement vérifier que `GCC` et `cargo` sont installés sur votre système.

source: With the SQL backend, the development server will load and save data in a local sqlite database.
fr: Avec la base de données SQL, le serveur de développement chargera et enregistrera les données dans un fichier sqlite local.

source: Run the development server with the SQL backend
fr: Lancer l’instance de développement avec la base de données SQL

source: Memory
fr: En-mémoire

source: With the memory backend, all data is lost when Canaille stops.
fr: Avec la base de données en mémoire, toutes les données sont perdues lorsque Canaille s'arrête.

source: Run the development server with the memory backend
fr: Lancer l’instance de développement avec la base de données en mémoire

source: With the LDAP backend, all data is lost when Canaille stops.
fr: Avec LDAP, toutes les données sont perdues lorsque Canaille s’arrête.

source: Run the development server with the LDAP backend
fr: Lancer l’instance de développement avec le support de LDAP

source: If you want to run the development server locally with the LDAP backend, you need to have `OpenLDAP <https://www.openldap.org/>`_ installed on your system. It is generally shipped under the ``slapd`` or ``openldap`` package name.
fr: Si vous souhaitez exécuter l’instance de développement localement avec le support pour LDAP, vous devez avoir `OpenLDAP <https://www.openldap.org/>`_ installé sur votre système. OpenLDAP est généralement fourni via les paquets nommés ``slapd`` ou ``openldap``.

source: Docker environment
fr: Environnement Docker

source: Populate the database
fr: Remplissage de la base de données

source: The development server database comes populated with some random users and groups. If you need more, you can generate users and groups with the ``populate`` command:
fr: La base de donnée de développement est remplie avec des utilisateurs et des groupes générés aléatoirement. Si vous avez besoin de plus, vous pouvez générer des utilisateurs et des groupes avec la commande ``populate`` :

source: Adapt to use either the `ldap` or the `sql` configuration file. Note that this will not work with the memory backend.
fr: Adaptez pour utiliser le fichier de configuration `ldap` ou `sql`. Notez que cela ne fonctionnera pas avec la base de données en mémoire.

source: Unit tests
fr: Tests unitaires

source: To run the tests, you just can run `uv run pytest` and/or `uv run tox` to test all the supported python environments. Everything must be green before patches get merged.
fr: Pour exécuter les tests, vous pouvez simplement lancer la commande `uv run pytest`et/ou `uv run tox`pour tester tous les environnements Python supportés. Tout doit être au vert avant que les contributions soient fusionnées.

source: To test a specific backend you can pass ``--backend memory``, ``--backend sql`` or ``--backend ldap`` to pytest and tox.
fr: Pour tester une base de données en particulier, vous pouvez passer les argumentes ``--backend memory``, ``--backend sql`` ou ``--backend ldap`` à pytest et tox.

source: The test coverage is 100%, patches won't be accepted if not entirely covered. You can check the test coverage with ``uv run pytest --cov --cov-report=html`` or ``uv run tox -e coverage -- --cov-report=html``. You can check the HTML coverage report in the newly created `htmlcov` directory.
fr: La couverture de code est de 100%, les contributions ne seront acceptées que si leur code est entièrement couvert. Vous pouvez vérifier la couverture avec ``uv run pytest --cov --cov-report=html``ou ``uv run tox -e coverage -- --cov-report=html`. Vous pouvez ensuite consulter le rapport de couverture HTML dans le dossier `htmlcov` nouvellement créé.

source: Code style
fr: Style de code

source: Front
fr: Interface utilisateur

source: The interface is built upon the `Fomantic UI <https://fomantic-ui.com/>`_ CSS framework. The dynamical parts of the interface use `htmx <https://htmx.org/>`_.
fr: L’interface utilisateur est construite avec `Fomantic UI <https://fomantic-ui.com/>`_. Les parties dynamiques utilisent `HTMX <https://htmx.org/>`_.

source: Using Javascript in the interface is tolerated, but the whole website MUST be accessible for browsers without Javascript support, and without any feature loss.
fr: L’utilisation de Javascript dans l’interface est tolérée, mais l’ensemble de l’application DOIT pouvoir être utilisé par des navigateurs sans support Javascript, et sans perte de fonctionnalité.

source: Because of Fomantic UI we have a dependency to jQuery, however new contributions should not depend on jQuery at all. See the `related issue <https://gitlab.com/yaal/canaille/-/issues/130>`_.
fr: À cause de Fomantic UI, Canaille a une dépendance vers jQuery, cependant les nouvelles contributions ne devraient pas utiliser jQuery. Lisez le `ticket à ce sujet<https://gitlab.com/yaal/canaille/-/issues/130>`_.

source: The documentation is generated when the tests run:
fr: La documentation est générée lors de l’exécution des tests :

source: You can also run sphinx by hand, that should be faster since it avoids the tox environment initialization:
fr: Vous pouvez aussi exécuter `sphinx` à la main, cela devrait être plus rapide puisque cela évite l’initialisation des environnements tox :

source: The generated documentation is located at ``build/sphinx/html/en``.
fr: La documentation générée se situe à ``build/sphinx/html/en``.

source: The documentation generates dynamic screenshots of Canaille using `sphinxcontrib-screenshot`_, that internally uses `Playwright`_. Playwright needs to be initialized with the following command:
fr: La documentation génère dynamiquement des captures d'écran de Canaille en utilisiant `sphinxcontrib-screenshot`_, qui utilise `Playwright`_. Il est nécessaire d'initialiser Playwright avec la commande suivante :

source: Code translation
fr: Traduction du code

source: Translations are done with `Weblate <https://hosted.weblate.org/projects/canaille/canaille>`__.
fr: Les traductions s’effectuent sur `Weblate <https://hosted.weblate.org/projects/canaille/canaille>`_.

source: The following commands are there as documentation, only the message extraction is needed for contributors. All the other steps are automatically done with Weblate.
fr: Les commandes suivantes sont présentées à titre de documentation, seule l’extraction des messages est utile aux contributeurs. Toutes les autres étapes sont effectuées automatiquement par Weblate.

source: Message extraction
fr: Extraction des messages

source: After you have edited translatable strings, you should extract the messages with:
fr: Après avoir édité des chaînes de caractères traductibles, vous pouvez extraire les messages avec :

source: Language addition
fr: Ajout de langues

source: You can add a new language manually with the following command, however this should not be needed as Weblate takes car of this:
fr: Vous pouvez ajouter une nouvelle langue manuellement avec la commande suivante, cependant cela ne devrait pas être nécessaire puisque Weblate s'en occupe automatiquement :

source: Catalog update
fr: Mise à jour des catalogues

source: You can update the catalogs with the following command, however this should not be needed as Weblate automatically update language catalogs when it detects new strings or when someone translate some existing strings. Weblate pushes happen every 24h.
fr: Vous pouvez mettre à jour les catalogues avec la commande suivante, cependant cela ne devrait pas être nécessaire puisque Weblate met à jour automatiquement les catalogues lorsqu’il détecte de nouvelles chaînes de caractères ou lorsque quelqu’un traduit des chaînes de caractères existantes. Weblate pousse ses modifications toutes les 24 heures.

source: Catalog compilation
fr: Compilation des catalogues

source: You can compile the catalogs with the following command, however this should not be needed as catalogs are automatically compiled before running the unit tests, before launching the demo and before compiling the Canaille python package:
fr: Vous pouvez compiler les catalogues avec la commande suivante, cependant cela ne devrait pas être nécessaire puisque les catalogues sont automatiquement compilés avant le lancement des tests unitaires, avant le lancement de l’instance de démonstration et avant la compilation du paquet Python de Canaille :

source: Documentation translation
fr: Traduction de la documentation

source: Translations are done with `Weblate <https://hosted.weblate.org/projects/canaille/documentation>`__.
fr: Les traductions s’effectuent sur `Weblate <https://hosted.weblate.org/projects/canaille/documentation>`__.

source: The following commands are there as documentation, only the message extraction and the language addition is needed for contributors.
fr: Les commandes suivantes sont montrées à titre de documentation, seules l’extraction de message et l’ajout de langues de traduction sont utiles aux contributeurs.

source: Build the documentation in another language
fr: Construire la documentation dans une autre langue

source: Production Docker image
fr: Image Docker de production

source: Build
fr: Construction

source: Publish
fr: Publication

source: Build a release
fr: Construire une nouvelle version

source: Python package
fr: Paquet Python

source: The Python packaging step is took care of by uv:
fr: L'étape de création du paquet Python est gérée par *uv* :

source: Binary file
fr: Fichier exécutable

source: To build a single binary of Canaille, you can use pyinstaller by installing the `release` dependency group:
fr: Pour construire un exécutable unique de Canaille, vous pouvez utiliser pyinstaller en installant le groupe de dépendances `release` :

source: Publish a new release
fr: Publier une nouvelle version

source: Check that dependencies are up to date with ``uv sync --all-extras --all-groups --upgrade`` and update dependencies accordingly in separated commits;
fr: Vérifiez que les dépendances sont à jour avec ``uv sync --all-extras --all-groups --upgrade`` et mettez à jour chaque dépendance dans un commit séparé ;

source: Check that tests are still green for every supported python version, and that coverage is still at 100%, by running ``uv run tox``;
fr: Vérifiez que les tests sont toujours verts pour chaque version supportée de Python, et que la couverture de code est toujours de 100%, en lançant ``uv run tox`` ;

source: Check that the development environments are still working, both the local and the Docker one;
fr: Vérifiez que les instances de développement sont toujours fonctionnelles, à la fois en local et avec Docker ;

source: Check that the :ref:`development/changelog:Release notes` section is correctly filled up;
fr: Vérifiez que les :ref:`development/changelog:notes de versioin` sont correctement renseignées ;

source: Increase the version number in ``pyproject.toml``;
fr: Incrémentez le numéro de version dans ``pyproject.toml`` ;

source: Commit with ``git commit``;
fr: Commitez avec ``git commit`` ;

source: :ref:`Build the packages <development/contributing:Build a release>` with ``uv build``;
fr: :ref:`Construisez les paquets <development/contributing:Build a release>` avec ``uv build``;

source: Install from the .whl generated with ``uv pip install <path/to/dist/canaille-x.x.xx-py3-none-any.whl>[front,oidc,postgresql,server,otp,sms]``;
fr: Installez à partir du .whl généré par ``uv pip install <path/to/dist/canaille-x.x.xx-py3-none-any.whl>[front,oidc,postgresql,server,otp,sms]``;

source: Test creation of a user with ``canaille config dump`` and ``canaille create user --user-name admin --password admin --emails admin@mydomain.example --given-name George --family-name Abitbol`` and ``canaille run``;
fr: Testez la création d'un utilisateur avec ``canaille config dump`` puis ``canaille create user --user-name admin --password admin --emails admin@mydomain.example --given-name George --family-name Abitbol`` et enfin ``canaille run``;

source: Try to connect the user;
fr: Essayez de connecter l'utilisateur;

source: Publish the Python package on test PyPI with ``uv publish --publish-url https://test.pypi.org/legacy/``;
fr: Publiez le paquet sur l’instance de test de PyPI avec ``uv publish --publish-url https://test.pypi.org/legacy/``;

source: Install the test package somewhere with ``pip install --extra-index-url https://test.pypi.org/simple --upgrade "canaille[front,oidc,postgresql,server,otp,sms]"``. Check that everything looks fine;
fr: Installez le paquet dans un projet quelconque avec ``pip install --extra-index-url https ://test.pypi.org/simple --upgrade "canaille[front,oidc,postgresql,server,otp,sms]"``. Vérifiez que l’installation s’est bien passée ;

source: Publish the Python package on production PyPI ``uv publish``;
fr: Publiez le paquet Python sur l’instance de production de PyPI avec ``uv publish`` ;

source: Tag the commit with ``git tag XX.YY.ZZ``;
fr: Étiquetez le commit avec ``git tag XX.YY.ZZ`` ;

source: Push the release commit and the new tag on the repository with ``git push --tags``.
fr: Poussez le commit de publication avec la nouvelle étiquette avec ``git push --tags``.

source: Development
fr: Développement

source: Specifications
fr: Normes

source: This page details which specifications are implemented in Canaille, and compares Canaille with other well-known identity providers.
fr: Cette page détaille les spécifications implémentées dans Canaille, et compare Canaille avec d’autres serveurs d’identité renommés.

source: State of the specs in Canaille
fr: L’état des spécifications dans Canaille

source: Canaille provides a basic SCIM server implementation.
fr: Canaille fournit une implémentation basique du protocole SCIM.

source: Client-side implementation (i.e. broadcasting changes on users and groups among clients) and advanced features will be implemented in the future.
fr: L'implémentation côté client (c'est à dire la diffusion à tous les clients des modifications sur les utilisateurs et groupes) ainsi que les fonctionnalités avancées seront implémentées dans le futur.

source: What's implemented
fr: Ce qui est implémenté

source: Endpoints:
fr: Les points terminaux :

source: Features:
fr: Fonctionnalités :

source: :rfc:`pagination <7644#section-3.4.2.4>`
fr: la :rfc:`pagination <7644#section-3.4.2.4>`

source: What is not implemented yet
fr: Ce qui n'est pas encore implémenté

source: Features
fr: Fonctionnalités

source: :rfc:`filtering <7644#section-3.4.2.2>`
fr: les :rfc:`filtres <7644#section-3.4.2.2>`

source: :rfc:`sorting <7644#section-3.4.2.3>`
fr: le :rfc:`tri <7644#section-3.4.2.3>`

source: :rfc:`attributes selection <7644#section-3.4.2.5>`
fr: la :rfc:`sélection d'attributs <7644#section-3.4.2.5>`

source: :rfc:`ETags <7644#section-3.14>`
fr: les :rfc:`ETags <7644#section-3.14>`

source: Comparison with other providers
fr: Comparaison avec d’autres serveurs d’identité

source: Here is a feature comparison with other OpenID Connect server software.
fr: Voici une comparaison de fonctionnalités avec d’autres serveurs d’identité.

source: Canaille voluntarily only implements the OpenID Connect protocol to keep its codebase simple.
fr: Afin de garder la base de code réduite, Canaille n’implémente que le protocole OpenID Connect.

source: Software
fr: Logiciel

source: Project
fr: Projet

source: Protocols implementations
fr: Protocoles implémentés

source: FLOSS
fr: Libre

source: Language
fr: Langage
