Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: The Canaille instance defined in :attr:`~canaille.core.configuration.CoreSettings.NAME`.
fr: Le nom de l'instance de Canaille défini dans :attr:`~canaille.core.configuration.CoreSettings.NAME`.

source: The URL of the instance logo defined in :attr:`~canaille.core.configuration.CoreSettings.LOGO`.
fr: L'URL du logo de l'instance défini dans :attr:`~canaille.core.configuration.CoreSettings.LOGO`.

source: The URL of the instance favicon defined in :attr:`~canaille.core.configuration.CoreSettings.FAVICON`.
fr: L'URL du *favicon* de l'instance de Canaille défini dans :attr:`~canaille.core.configuration.CoreSettings.FAVICON`.

source: Whether the page is boosted by :attr:`~canaille.core.configuration.CoreSettings.HTMX`.
fr: Indique si les pages sont propulsées par :attr:`~canaille.core.configuration.CoreSettings.HTMX`.

source: Whether to display the menu or not.
fr: Indique si le menu doit être affiché ou non.

source: Whether the app has been launched in debug mode.
fr: Indique si Canaille a été lancé en mode débogage.

source: Whether a :attr:`~canaille.app.configuration.RootSettings.SECRET_KEY` has been defined.
fr: Indique si le paramètre :attr:`~canaille.app.configuration.RootSettings.SECRET_KEY` a été défini.

source: The error page. Displayed for all kinds of errors (not found, internal server error etc.).
fr: La page d'erreur. Cette page est affichée pour tous types d'erreurs (page non trouvée, erreur interne du serveur, etc.).

source: The code of the HTTP error (404, 500, etc.)
fr: Le code HTTP de l'erreur (404, 500, etc.)

source: The error code description.
fr: La description du code d'erreur.

source: An optional Font Awesome icon reference.
fr: La référence optionnelle à un icône *Font Awesome*.

source: Macros for Flask flash message rendering
fr: Macros pour l'affichage des messages informatifs de Flask

source: Macros for form and form field rendering.
fr: Macros pour l'affichage des formulaires et de leurs champs.

source: Connects WTForms, Fomantic-UI and HTMX.
fr: Connecte WTForms, Fomantic-UI et HTMX.

source: Macros for rendering table paginated with HTMX.
fr: Macros pour l'affichage de tables paginées avec HTMX.

source: Forms
fr: Formulaires

source: A form for table rendering of object collections.
fr: Un formulaire pour le rendu en tableau de collection d'objets.

source: Core
fr: Cœur

source: The core templates are displayed in the authentication and profile edition pages.
fr: Ces patrons sont affichés dans les pages d'authentification et d'édition de profiles utilisateurs.

source: The 'About' page.
fr: La page « À propos ».

source: This is an informational page, displaying the project links.
fr: Cette page est informationnelle, elle affiche les liens du projet.

source: The current Canaille version.
fr: La version de l'instance de Canaille.

source: The group edition page.
fr: La page d'édition des groupes.

source: Group edition page.
fr: Page d'édition des groupes.

source: Displays the group edition or creation form.
fr: Affiche le formulaire d'édition ou de création d'un groupe.

source: :data:`None` in a creation context. In edition context this is the edited group.
fr: :data:`None` dans un contexte de création. Dans un contexte d'édition, c'est le groupe édité.

source: The group edition/creation form.
fr: Le formulaire de création et d'édition de groupes.

source: The group list page.
fr: La page de liste des groupes.

source: A :class:`~canaille.core.models.Group` pagination form.
fr: Un formulaire de pagination de :class:`~canaille.core.models.Group`.

source: Displays the invitation form to users with the invitation permission.
fr: Affiche le formulaire d'invitation aux utilisateurs en ayant la permission.

source: The invitation form.
fr: Le formulaire d'invitation d'utilisateurs.

source: The invitation acceptation page.
fr: La page d'acceptation d'une invitation.

source: This page is displayed to users who have clicked on invitation links sent by mail (or by other media). It displays a basic account creation form.
fr: Cette page est affichée aux utilisateurs qui ont cliqué sur le lien d'invitation qui leur a été envoyé par mail (ou par un autre médium). Il affiche un formulaire basique de création de compte.

source: The account creation form.
fr: Le formulaire de création de compte.

source: The login page.
fr: La page de connexion.

source: This page displays a form to get the user identifier.
fr: Cette page affiche un formulaire qui récupère l'identifiant d'un utilisateur.

source: The login form.
fr: Le formulaire de connexion.

source: User account creation page.
fr: Page de création de compte utilisateur.

source: This template displays an account creation form. It is used in the registration page, and in the manual account creation page available for users with *user management* permission.
fr: Ce patron affiche un formulaire de création de compte. Il est utilisé par la page d'enregistrement, et sur la page de création manuelle de compte disponibles aux utilisateurs avec les permissions de gestion des utilisateurs.

source: The user creation form. Dynamically built according to the user :attr:`~canaille.core.configuration.ACLSettings.READ` and :attr:`~canaille.core.configuration.ACLSettings.WRITE` permissions. The available fields are those appearing in *READ* and *WRITE*, those only appearing in *READ* are read-only.
fr: Le formulaire de création d'utilisateur. Fabriqué dynamiquement à partir des permissions de :attr:`~canaille.core.configuration.ACLSettings.READ` et :attr:`~canaille.core.configuration.ACLSettings.WRITE`. Les champs disponibles sont ceux listés dans *READ* et *WRITE*. Ceux n'apparaissant que dans *READ* sont en lecture seule.

source: The profile edition template.
fr: Le patron d'édition de profil.

source: Displays a user profile edition form.
fr: Affiche un formulaire d'édition de profil utilisateur.

source: The user that the form will edit.
fr: L'utilisateur édité par le formulaire.

source: The user profile edition form. Dynamically built according to the user :attr:`~canaille.core.configuration.ACLSettings.READ` and :attr:`~canaille.core.configuration.ACLSettings.WRITE` permissions. The available fields are those appearing in *READ* and *WRITE*, those only appearing in *READ* are read-only.
fr: Le formulaire d'édition de profil utilisateur. Fabriqué dynamiquement à partir des permissions de :attr:`~canaille.core.configuration.ACLSettings.READ` et :attr:`~canaille.core.configuration.ACLSettings.WRITE`. Les champs disponibles sont ceux listés dans *READ* et *WRITE*. Ceux n'apparaissant que dans *READ* sont en lecture seule.

source: An email edition form. Used when the :attr:`~canaille.app.features.Features.has_email_confirmation` feature is enabled.
fr: Un formulaire d'édition d'adresse email. Utilisé lorsque la fonctionnalité de :attr:`confirmation des adresses email <canaille.app.features.Features.has_email_confirmation>` est activée.

source: The user profile settings edition page.
fr: La page de paramètres de profil utilisateur.

source: The profile settings template.
fr: Le patron de paramètres de profil utilisateur.

source: Displays the user settings edition form.
fr: Affiche le formulaire d'édition des paramètres utilisateur.

source: Whether the editor is allowed to delete the account of the edited user.
fr: Indique si l'éditeur a la permission de supprimé le compte de l'utilisateur édité.

source: The users list.
fr: La liste des utilisateurs.

source: Displays a paginated list of :class:`~canaille.core.models.User`.
fr: Affiche une liste paginée de :class:`~canaille.core.models.User`.

source: The paginated list form.
fr: Le formulaire de listes paginées.

source: The multi-factor authentication code verification template.
fr: Le patron de vérification de codes d'authentification multi-facteurs.

source: Displays a form that asks for the multi-factor authentication code.
fr: Affiche un formulaire qui requière un code d'authentification multi-facteurs.

source: The code verification form.
fr: Le formulaire de vérification de code.

source: This page is displayed to users who do not have set a password yet.
fr: Cette page est affichée aux utilisateurs qui n'ont pas encore paramétré un mot de passe.

source: The password reinitialization page.
fr: La page de réinitialisation de mot de passe.

source: Password forgotten page.
fr: Page d'oubli du mot de passe.

source: This page displays a form asking for the email address of users who cannot remember their password.
fr: Cette page affiche un formulaire requérant l'adresse email d'un utilisateur ayant oublié son mot de passe.

source: The password reset template.
fr: Le patron de réinitialisation de mot de passe.

source: Displays a password reset form.
fr: Affiche un formulaire de réinitialisation de mot de passe.

source: The password reset form.
fr: Le formulaire de réinitialisation de mot de passe.

source: The user associated with the URL.
fr: L'utilisateur associé à l'URL.

source: The multi-factor authentication initialization template.
fr: Le patron d'initialisation de l'authentification multi-facteurs.

source: Display a QR-code and the OTP secret.
fr: Affiche un QR-code et le secret OTP.

source: The OTP secret.
fr: Le secret de l'OTP.

source: A QR-code image representing the OTP secret.
fr: Une image QR-code représentant le secret OTP.

source: The group creation form.
fr: Le formulaire de création de groupes.

source: The group edition form.
fr: Le formulaire d'édition de groupes.

source: The user invitation form.
fr: Le formulaire d'invitation d'utilisateurs.

source: The OIDC templates are displayed in the OIDC consent pages.
fr: Les patrons OIDC sont affichés lors des étapes de consentement OIDC.

source: Consent request template.
fr: Le patron de requête de consentement.

source: This templates is displayed to users accessing a new application that requests to access to personal information. It lists the personal information requested by the application, and offers the user to accept or decline.
fr: Ce patron est affiché aux utilisateurs accédant à une nouvelle application qui requête l'accès à des informations personnelles. Il liste les informations personnelles demandées, et propose à l'utilisateur d'accepter ou de refuser.

source: The user whose consent is asked.
fr: L'utilisateur dont le consentement est requis.

source: The OIDC grant.
fr: Le flux OIDC.

source: The client addition page.
fr: La page d'ajout d'application cliente.

source: The client addition template.
fr: Le patron d'ajout d'application cliente.

source: Displays a form to create a new :class:`~canaille.oidc.basemodels.Client`.
fr: Affiche un formulaire de création de :class:`~canaille.oidc.basemodels.Client`.

source: The client creation form.
fr: Le formulaire de création de client.

source: The client edition template.
fr: Le formulaire d'édition de client.

source: Displays a form to edit a :class:`~canaille.oidc.basemodels.Client`.
fr: Affiche un formulaire d'édition de :class:`~canaille.oidc.basemodels.Client`.

source: The edited client.
fr: Le client édité.

source: The list of OIDC clients.
fr: La liste des clients OIDC.

source: Displays a paginated list of :class:`~canaille.oidc.basemodels.Client`.
fr: Affiche une liste paginée de :class:`~canaille.oidc.basemodels.Client`.

source: The consented applications list.
fr: La liste d'application avec consentement explicite.

source: Display a list of clients for which users have given or revoked their consent.
fr: Affiche une liste d'applications clientes auxquelles l'utilisateur a donné ou révoqué son consentement.

source: Description of the OIDC scopes.
fr: Description des *scopes* OIDC.

source: The scopes to hide.
fr: Les *scopes* à masquer.

source: The number of consents.
fr: Le nombre de consentements.

source: The number of trusted clients.
fr: Le nombre de clients de confiance.

source: The OIDC logout template.
fr: Le patron de déconnexion OIDC.

source: Used during OIDC RP-initiated logout, when an user confirmation is needed.
fr: Utilisé durant la *déconnexion initiée par les applications clients OIDC*, lorsque le consentement de l'utilisateur est nécessaire.

source: The logout form.
fr: Le formulaire de déconnexion.

source: The client requesting the logout.
fr: Le client requérant la déconnexion.

source: The list of tokens.
fr: La liste des jetons.

source: Displays a paginated list of :class:`~canaille.oidc.basemodels.Token`.
fr: Affiche une liste paginée de :class:`~canaille.oidc.basemodels.Token`.

source: The token view page.
fr: La page de visualisation de jeton.

source: The token view template.
fr: Le patron de visualisation de jetons.

source: Displays the details of a token :class:`~canaille.oidc.basemodels.Token`.
fr: Affiche les détails d'un :class:`~canaille.oidc.basemodels.Token`.

source: A token revokation form.
fr: Un formulaire de révocation de jeton.

source: The trusted applications list.
fr: La liste d'applications de confiance.

source: Display a list of trusted clients for which it is implied that users don't need to explicitly give their consent.
fr: Affiche une liste d'applications clientes de confiance dont il est établi que les utilisateurs n'ont pas besoin de fournir un consentement explicite.

source: The list of implicitly consented clients.
fr: La liste des clients avec consentements implicite.

source: Canaille can read and save data in different databases. This page presents the different database backends and their specificities:
fr: Canaille peut lire et écrire dans différentes bases de données. Cette page présente les differents « backends » des bases de données et leurs spécificités :

source: Canaille comes with a lightweight inmemory backend by default. It is used when no other backend has been configured.
fr: Canaille est fourni avec un« backend » léger en mémoire par défaut. Il est utilisé lorsqu'aucun autre backend n'a été configuré.

source: This backend is only for test purpose and should not be used in production environments.
fr: Ce backend est destiné uniquement à des fins de test et ne devrait pas être utilisé dans des environnements de production.

source: Canaille can use any database supported by `SQLAlchemy <https://www.sqlalchemy.org/>`_, such as sqlite, postgresql or mariadb.
fr: Canaille peut utiliser n'importe quelle base de données acceptées par `SQLAlchemy <https://www.sqlalchemy.org/>`_, comme sqlite, postgresql ou mariadb.

source: It is used when the ``CANAILLE_SQL`` configuration parameter is defined. For instance:
fr: Il est utilisé quand le paramètre de configuration ``CANAILLE_SQL`` est défini. Par exemple :

source: You can find more details on the SQL configuration in the :class:`dedicated section <canaille.backends.sql.configuration.SQLSettings>`.
fr: Vous pouvez trouver plus de détails sur la configuration SQL dans la :class:`dedicated section <canaille.backends.sql.configuration.SQLSettings>`.

source: By default, migrations are applied when you run the web application. You can disable this behavior with the :attr:`~canaille.backends.sql.configuration.SQLSettings.AUTO_MIGRATE` setting. Migrations are not automatically applied with the use of the CLI though.
fr: Par défaut, les migrations sont appliquées lorsque l'application web est lancée. Vous pouvez désactiver ce comportement avec le paramètre de configuration :attr:`~canaille.backends.sql.configuration.SQLSettings.AUTO_MIGRATE`. Cependant les migrations ne sont pas appliquées lorsque l'interface en ligne de commande est utilisée.

source: Migrations are done with :doc:`flask-alembic <flask-alembic:use>`, that provides a dedicated CLI to manually tune migrations. You can check the :doc:`flask-alembic documentation <flask-alembic:index>` and the ``canaille db`` command line if you are in trouble.
fr: Les migrations sont effectuées avec :doc:`flask-alembic <flask-alembic:use>`, qui fournit un outil console dédié pour les paramétrer. Vous pouvez consulter la :doc:`documentation de flask-alembic <flask-alembic:index>` et la commande ``canaille db`` si vous rencontrez des soucis.

source: Canaille can use OpenLDAP as its main database. It is used when the ``CANAILLE_LDAP`` configuration parameter is defined. For instance:
fr: Canaille peut utiliser OpenLDAP comme base de données principale. Elle est utilisée quand le paramètre de configuration ``CANAILLE_LDAP`` est défini. Par exemple :

source: If you want to use TOTP/HOTP authentication, you will need to add the ``oathHOTPToken`` class to the user:
fr: Si vous voulez utiliser l'authentification TOTP/HOTP, vous devrez ajouter la classe ``oathHOTPToken`` à l'utilisateur :

source: You can find more details on the LDAP configuration in the :class:`dedicated section <canaille.backends.ldap.configuration.LDAPSettings>`.
fr: Vous pouvez trouver plus de détails sur la configuration LDAP dans la :class:`dedicated section <canaille.backends.ldap.configuration.LDAPSettings>`.

source: Currently, only the ``inetOrgPerson``, ``oathHOTPToken`` and ``groupOfNames`` schemas have been tested. If you want to use different schemas or LDAP servers, adaptations may be needed. Patches are welcome.
fr: Actuellement, seuls les schémas ``inetOrgPerson``, ``oathHOTPToken`` et ``groupOfNames`` ont été testés. Si vous voulez utiliser différents schémas ou serveurs LDAP, des adaptations peuvent être nécessaires. Toute amélioration est bienvenue.

source: OpenLDAP overlays integration
fr: Intégration de surcouches (« overlays ») OpenLDAP

source: Canaille can integrate with several OpenLDAP overlays:
fr: Canaille peut s'intégrer avec plusieurs « overlays » OpenLDAP :

source: `memberof <https://www.openldap.org/doc/admin26/overlays.html#Reverse%20Group%20Membership%20Maintenance>`_ and `refint <https://www.openldap.org/doc/admin26/overlays.html#Referential%20Integrity>`_ overlays are needed for the Canaille group membership to work correctly.
fr: les greffons `memberof <https://www.openldap.org/doc/admin26/overlays.html#Reverse%20Group%20Membership%20Maintenance>`_ et `refint <https://www.openldap.org/doc/admin26/overlays.html#Referential%20Integrity>`_ sont nécessaires pour que l'appartenance d'un utilisateur à un groupe fonctionne correctement dans Canaille.

source: Here is a configuration example compatible with canaille:
fr: Voici un exemple de configuration compatible avec canaille :

source: You can adapt and load those configuration files with:
fr: Vous pouvez adapter et charger ces fichiers de configuration avec :

source: If the `ppolicy <https://www.ietf.org/archive/id/draft-behera-ldap-password-policy-11.html>`_ overlay is configured and the ``pwdEndTime`` attribute is available (since OpenLDAP 2.6), then account locking support will be enabled in canaille. To allow users to manage account expiration, they need to have a *write* permission on the :attr:`~canaille.core.models.User.lock_date` attribute.
fr: Si l'overlay `ppolicy <https://www.ietf.org/archive/id/draft-behera-ldap-password-policy-11.html>`_ est configuré et que l'attribut ``pwdEndTime`` est disponible (depuis OpenLDAP 2.6), alors la gestion du bloquage de compte sera activée dans Canaille. Pour permettre aux utilisateurs de gérer l'expiration de leur compte, ils ont besoin du droit d'*écriture* sur l'attribut :attr:`~canaille.core.models.User.lock_date`.

source: You can adapt and load this configuration file with:
fr: Vous pouvez adapter et charger ce fichier de configuration avec :

source: You will also need to add the ``oathHOTPToken`` class to the user:
fr: Vous aurez aussi besoin d'ajouter la classe ``oathHOTPToken`` à l'utilisateur :

source: Be careful to stop your ldap server before running ``slapadd``
fr: Soyez attentif à arrêter votre serveur LDAP avant d'exécuter ``slapadd``

source: Deployment
fr: Déploiement

source: This page details what to install on your server to make a production-ready environment for Canaille.
fr: Cette page détaille ce qu'il faut installer sur votre serveur pour créer un environnement prêt pour la production de Canaille.

source: Application service
fr: Serveur d’application

source: After having finished Canaille :doc:`installation <install>` you have to run it in a WSGI application server. Several application servers are available, like `Gunicorn`_, `uWSGI`_, `uvicorn`_ or `Hypercorn`_ for example.
fr: Après avoir fini l':doc:`installation <install>` de Canaille, vous devez l'exécuter dans un serveur d'application WSGI. Il existe de nombreux serveurs d'applications que vous pouvez utiliser avec Canaille, comme `Gunicorn`_, `uWSGI`_, `uvicorn`_ ou `Hypercorn`_ par exemple.

source: Canaille comes with a light Hypercorn integration but you can use it with any application server. The WSGI entry-point to configure in your server of choice is ``canaille:create_app``.
fr: Cannaille fournit une intégration légère d'Hypercorn, mais vous pouvez utiliser n'importe quel serveur d'application. Le point d'entrée WSGI à configurer dans votre serveur est ``canaille:create_app``.

source: Hypercorn integration
fr: Intégration Hypercorn

source: To run the integrated Hypercorn application server, you can simply run the :ref:`cli_run` command. The hypercorn integration is embedded in the Canaille binaries. However if you use the Canaille Python package, you will need the ``[server]`` extra (for instance with ``pip install canaille[server]`` for Hypercorn to be available.
fr: Pour exécuter le serveur d'application intégré Hypercorn, vous pouvez simplement exécuter la commande :ref:`cli_run`. Une intégration d'Hypercorn est disponible dans l'exécutable de Canaille. Cependant si vous installez Canaille par les paquets Python, vous devez installer l'extra ``[server]``(par exemple avec ``pip install canaile[server]``) pour qu'Hypercorn soit disponible.

source: Running the Canaille run command
fr: Exécution de la commande ``run``

source: Webserver
fr: Serveur web

source: Now you have to plug your WSGI application server to your webserver so it is accessible on the internet. Here are some webserver configuration examples you can pick:
fr: Maintenant vous devez brancher votre serveur d'application WSGI à votre serveur web pour qu'il soit accessible sur internet. Voici quelques exemples de configuration de serveur web que vous pouvez utiliser :

source: Nginx configuration example for Canaille
fr: Exemple de configuration Nginx pour Canaille

source: Apache configuration example for Canaille
fr: Exemple de configuration Apache pour Canaille

source: Recurrent jobs
fr: Tâches récurrentes

source: You might want to clean up your database to avoid it growing too much. You can regularly delete expired tokens and authorization codes with:
fr: Vous pourriez vouloir nettoyer la base de données pour limiter sa croissance. Vous pouvez supprimer régulièrement les jetons expirés et les code d'autorisation avec :
