Repository: yaal-coop/canaille
Catalog: doc/locales/*/LC_MESSAGES/doc.po
Languages: fr

source: The attributes users can use to identify themselves, generally a combination of :attr:`~canaille.core.models.User.user_name`, :attr:`~canaille.core.models.User.emails` and :attr:`~canaille.core.models.User.phone_numbers`.
fr: Les attributs utilisateurs utilisés pour les identifier, généralement une combinaison de :attr:`~canaille.core.models.User.user_name`, :attr:`~canaille.core.models.User.emails` et :attr:`~canaille.core.models.User.phone_numbers`.

source: When this is a :class:`list`, it expects the attribute names to match.
fr: Lorsque c'est une :class:`list`, il est attendu une correspondance des noms des attributs contenus dans la liste.

source: When this is a :class:`dict`, keys are expected to be the attribute names to match, and values are a :doc:`jinja:index` string with a ``login`` variable available. This can be used to tune the user input, and for example remove a domain name.
fr: Lorsque c'est un :class:`dict`, les clés sont des noms d'attributs d'utilisateurs, et les valeurs sont une chaîne de caractères :doc:`jinja:index` avec une variable ``login``disponible. Cela peut être utilisé pour transformer l'identifiant entré par l'utilisateur, par exemple pour supprimer un nom de domaine.

source: The logo of your organization, this is useful to make your organization recognizable on login screens.
fr: Le logo de votre organisation, cela permet de rendre votre organisation reconnaissable sur l'écran de connexion.

source: User password maximum length.
fr: Longueur minimum des mots de passe utilisateur.

source: There is a technical limit of 4096 characters with the SQL backend. If the value is 0, :data:`None`, or greater than 4096, then 4096 will be retained.
fr: Il y a une limite technique de 4096 caractères pour les bases de données SQL. Si la valeur est 0, :data:`None`ou supérieure à 4096, alors 4096 sera utilisée.

source: User password minimum length.
fr: Longueur maximum des mots de passe utilisateur.

source: If 0 or :data:`None`, password won't have a minimum length.
fr: Si 0 ou :data:`None, les mots de passe n'auront pas de longueur minimum.

source: Your organization name.
fr: Le nom de votre organisation.

source: Used for display purpose.
fr: Utilisé à fins d'affichage.

source: Have i been pwned api url for compromission checks.
fr: URL du service HaveIBeenPwned, utilisé pour les vérifications de compromission des mots de passe.

source: Password validity duration.
fr: Durée de validité du mot de passe.

source: If set, user passwords expire after this delay. Users are forced to change their password when the lifetime of the password is over. The duration value is expressed in `ISO8601 format <https://en.wikipedia.org/wiki/ISO_8601#Durations>`_. For example, delay of 60 days is written "P60D".
fr: Si indiqué, les mots de passe des utilisateurs expirent après ce délai. Les utilisateurs sont forcés de changer leur mot de passe lorsque la durée de vie de leur mot de passe a expiré. La durée est exprimée au format `ISO8601 <https://en.wikipedia.org/wiki/ISO_8601#Durations>`_. Par exemple, un délai de 60 jours s'écrit « P60D ».

source: A `Sentry <https://sentry.io>`_ DSN to collect the exceptions.
fr: Un DSN `Sentry <https://sentry.io>`_ pour collecter les erreurs techniques.

source: This is useful for tracking errors in test and production environments.
fr: Utile pour centraliser les erreurs dans les environnements de test et de production.

source: The settings related to SMPP configuration.
fr: Les paramètres liés à la configuration des serveurs SMPP.

source: The settings related to SMTP and mail configuration.
fr: Les paramètres liés à la configuration des serveur mail et SMTP.

source: If unset, mail-related features like password recovery won't be enabled.
fr: Si non renseigné, les fonctionnalités liées aux mail, telles que la réinitialisation des mots de passe, ne seront pas activées.

source: A path to a theme.
fr: Un chemin vers un thème.

source: See the :doc:`theming documentation </tutorial/theming>` for more details.
fr: Consultez la :doc:`theming documentation </tutorial/theming>` pour plus de détails.

source: The timezone in which datetimes will be displayed to the users (e.g. ``CEST``).
fr: Le fuseau horaire utilisé pour afficher les dates aux utilisateurs (par exemple ``CEST``).

source: If unset, the server timezone will be used.
fr: Si non renseigné, le fuseau horaire du serveur sera utilisé.

source: The SMTP configuration. Belong in the ``CANAILLE.SMTP`` namespace.
fr: La configuration SMTP. Appartient à l'espace de nom ``CANAILLE.SMTP``.

source: If unset, mail related features will be disabled, such as mail verification or password recovery emails.
fr: SI non renseigné, les fonctionnalités liées au mail seront désactivées, telles quel la vérification des adresses email ou bien la réinitialisation des mots de passe.

source: By default, Canaille will try to send mails from localhost without authentication.
fr: Par défaut, Canaille tente d’envoyer des mails depuis `localhost` sans authentification.

source: The sender for Canaille mails.
fr: L’émetteur des emails de Canaille.

source: Some mail provider might require a valid sender address.
fr: Certains services de mail pourraient exiger une adresse émettrice valide.

source: The SMTP host.
fr: Le serveur SMTP.

source: The SMTP login.
fr: L’identifiant SMTP.

source: The SMTP password.
fr: Le mot de passe SMTP.

source: The SMTP port.
fr: Le port SMTP.

source: Whether to use SSL to connect to the SMTP server.
fr: Utiliser ou non SSL pour se connecter au serveur SMTP.

source: Whether to use TLS to connect to the SMTP server.
fr: Utiliser ou non TLS pour se connecter au serveur SMTP.

source: If it succeeds, then use it as default SMTP configuration.
fr: Si cela réussit, alors l'utiliser comme configuration SMTP par défaut.

source: The SMPP configuration. Belong in the ``CANAILLE.SMPP`` namespace.
fr: La configuration SMPP. Appartient à l'espace de nom ``CANAILLE.SMPP``.

source: The SMPP host.
fr: Le serveur SMPP.

source: The SMPP login.
fr: L’identifiant SMPP.

source: The SMPP password.
fr: Le mot de passe SMPP.

source: The SMPP port. Use 8775 for SMPP over TLS (recommended).
fr: Le port SMPP. Utilisez `8775` pour SMPP avec TLS (recommandé).

source: Access Control List settings. Belong in the ``CANAILLE.ACL`` namespace.
fr: Paramètres des listes de contrôle d'accès. Appartient à l'espace de nom ``CANAILLE.ACL``.

source: You can define access controls that define what users can do on canaille. An access control consists in a :attr:`FILTER` to match users, a list of :attr:`PERMISSIONS` matched users will be able to perform, and fields users will be able to :attr:`READ` and :attr:`WRITE`. Users matching several filters will cumulate permissions.
fr: Vous pouvez définir des contrôles d'accès pour paramétrer ce que les utilisateurs sont autorisés à faire sur Canaille. Un contrôle d'accès consiste en un :attr:`FILTER`de sélection des utilisateurs, une liste de :attr:`PERMISSIONS` qui décrit ce que les utilisateurs sélectionnés pourront effectuer, et les champs de leurs profil que les utilisateurs pourront lire et écrire avec :attr:`READ`et :attr:`WRITE`. Les utilisateurs correspondant à plusieurs filtres cumuleront les permissions.

source: :attr:`FILTER` can be:
fr: :attr:`FILTER`peut être :

source: :py:data:`None`, in which case all the users will match this access control
fr: :py:data:`None`, auquel cas tous les utilisateurs correspondront au contrôle d’accès

source: a mapping where keys are user attributes name and the values those user attribute values. All the values must be matched for the user to be part of the access control.
fr: une correspondance où les clefs sont des noms d'attributs utilisateur et les valeurs sont les valeurs d'attribut utilisateur. Toutes les valeurs doivent correspondre à l'utilisateur pour faire partie du contrôle d'accès.

source: a list of those mappings. If a user values match at least one mapping, then the user will be part of the access control
fr: une liste de ces correspondances. Si les valeurs d'un utilisateur correspondent au moins à une de ces correspondances, alors l'utilisateur fera partie du contrôle d'accès

source: Here are some examples:
fr: Voici quelques exemples :

source: A list of :class:`Permission` users in the access control will be able to manage.
fr: Une liste de def :class:`Permission` utilisateur dans le controle d'accès seront capables de gérer.

source: A list of :class:`~canaille.core.models.User` attributes that users in the ACL will be able to read.
fr: Une liste d'attributs de :class:`~canaille.core.models.User` que les utilisateurs dans les ACL seront capables de lire.

source: A list of :class:`~canaille.core.models.User` attributes that users in the ACL will be able to edit.
fr: Une liste d'attributs de :class:`~canaille.core.models.User` que les utilisateurs dans les ACL seront capables de modifier.

source: The permissions that can be assigned to users.
fr: Les droits qui peuvent être assignés aux utilisateurs.

source: The permissions are intended to be used in :attr:`ACLSettings <canaille.core.configuration.ACLSettings.PERMISSIONS>`.
fr: Les droits sont prévus pour être utilisé dans :attr:`ACLSettings <canaille.core.configuration.ACLSettings.PERMISSIONS>`.

source: Allows users to delete their account.
fr: Permettre aux utilisateurs de supprimer leur compte.

source: If used with :attr:`~canaille.core.configuration.Permission.MANAGE_USERS`, users can delete any account.
fr: Si utilisé avec :attr:`~canaille.core.configuration.Permission.MANAGE_USERS`, les utilisateurs peuvent supprimer n'importe quel compte.

source: Allows users to edit their own profile.
fr: Permet aux utilisateurs de modifier leur propre profil.

source: Allows users to take the identity of another user.
fr: Permet aux utilisateurs de prendre l'identité d'un autre utilisateur.

source: Allows OpenID Connect client managements.
fr: Permet les gestion de client OpenID Connect.

source: Allows other users management.
fr: Permet la gestion des autres utilisateurs.

source: Allows OpenID Connect authentication.
fr: Permet l'authentification OpenID Connect.

source: OpenID Connect settings.
fr: Paramètres OpenID Connect.

source: Belong in the ``CANAILLE_OIDC`` namespace.
fr: Appartient à l'espace de nom ``CANAILLE_OIDC``.

source: Whether a token is needed for the RFC7591 dynamical client registration.
fr: Si un jeton est nécessaire pour l’enregistrement dynamique du client selon la RFC7591.

source: Force the nonce exchange during the authentication flows.
fr: Force l'échange de nonce durant le processus d'authentification.

source: This adds security but may not be supported by all clients.
fr: Cela améliore la sécurité mais pourrait ne pas être géré par tous les clients.

source: Mapping between the user model and the JWT fields.
fr: Correspondance entre le modèle utilisateur et les champs JWT.

source: Fields are evaluated with jinja. A ``user`` var is available.
fr: Les champs sont évalués avec jinja. Une variable ``user`` est disponible.

source: SCIM settings.
fr: Paramètres SCIM.

source: Whether the state of :class:`~canaille.core.models.User` and :class:`~canaille.core.models.Group` are broadcasted to clients using the SCIM protocol.
fr: Indique si l'état des :class:`utilisateurs <canaille.core.models.User>` et des :class:`groupes <canaille.core.models.Group>` sont transmis aux applications clientes via le protocole SCIM.

source: When enabled, any creation, edition or deletion of a client or a group will be replicated on clients that implement the SCIM protocol.
fr: Lorsqu'activé, toute création, édition ou suppression d'un utilisateur ou d'un groupe sera répliqué dans les applications clientes qui implémentent le protocole SCIM.

source: Whether the SCIM server API is enabled.
fr: Indique si la fonctionnalité d'API SCIM est activée.

source: When enabled, services plugged to Canaille can update users and groups using the API.
fr: Lorsqu'activée, les services connectés à Canaille peuvent mettre à jours les utilisateurs et les groupes dans Canaille en utilisant l'API.

source: Settings related to the SQL backend.
fr: Paramètres concernant le serveur SQL.

source: Belong in the ``CANAILLE_SQL`` namespace.
fr: Appartient à l'espace de nom ``CANAILLE_SQL``.

source: Whether to automatically apply database migrations.
fr: Appliquer automatiquement ou non les migrations de base de données.

source: If :data:`True`, database migrations will be automatically applied when Canaille web application is launched. If :data:`False`, migrations must be applied manually with ``canaille db upgrade``.
fr: Si :data:`True`, les migrations de base de données sont appliquées automatiquement lorsque l'application web de Canaille est lancée. Si :data:`False`, les migrations doivent être appliquées manuellement avec ``canaille db upgrade``.

source: When running the CLI, migrations will never be applied.
fr: Les migrations ne sont jamais appliquées automatiquement lorsque l'interface en ligne de commandes est utilisée.

source: The SQL server URI. For example:
fr: URI du serveur SQL. Par exemple :

source: Password hashing scheme.
fr: Algorithme de hachage des mots de passe.

source: Defines password hashing scheme in SQL database. examples : "mssql2000", "ldap_salted_sha1", "pbkdf2_sha512"
fr: Définit l'algorithme de hachage de mots de passe dans les bases de données SQL. Par exemple : "mssql2000", "ldap_salted_sha1", "pbkdf2_sha512"

source: Settings related to the LDAP backend.
fr: Paramètres concernant le serveur LDAP.

source: Belong in the ``CANAILLE_LDAP`` namespace.
fr: Appartient à l'espace de nom ``CANAILLE_LDAP``.

source: The LDAP bind DN.
fr: Le DN de connexion LDAP.

source: The LDAP bind password.
fr: Le mot de passe de connexion LDAP.

source: The LDAP node under which groups will be looked for and saved.
fr: Le noeud LDAP dans lequel les groupes seront cherchés et enregistrés.

source: For instance `"ou=groups,dc=example,dc=org"`.
fr: Par exemple `"ou=groups,dc=exemple,dc=org"`.

source: The object class to use for creating new groups.
fr: La classe objet à utiliser pour créer de nouveaux groupes.

source: The attribute to use to identify a group.
fr: L'attribut à utiliser pour identifier un groupe.

source: The attribute to identify an object in the Group DN.
fr: L'attribut pour identifier un objet dans le Groupe DN.

source: The LDAP root DN.
fr: Le DN racine LDAP.

source: The LDAP connection timeout.
fr: Le délai d'expiration de connexion LDAP.

source: The LDAP server URI.
fr: L'URI du serveur LDAP.

source: The LDAP node under which users will be looked for and saved.
fr: Le noeud LDAP dans lequel les utilisateurs seront recherchés et enregistrés.

source: For instance `ou=users,dc=example,dc=org`.
fr: Par exemple `ou=users,dc=example=org`.

source: The object class to use for creating new users.
fr: La classe d'objet pour créer de nouveaux utilisateurs.

source: The attribute to identify an object in the User DN.
fr: L'attribut pour identifier un objet dans le DN Utilisateur.

source: Example file
fr: Fichier d'exemple

source: Here is a configuration file example that can be generated with the :ref:`canaille config dump <cli_config>` command:
fr: Voici un exemple de fichier de configuration qui peut être généré avec la commande :ref:`canaille config dump <cli_config>` :

source: References
fr: Références

source: Data models
fr: Modèles de donnée

source: This reference details the data models used by Canaille. This is mostly useful for developers.
fr: Cette référence détaille les modèles de donnée utilisés par Canaille. Cela est surtout utile pour les développeurs.

source: The backend model abstract class.
fr: La classe abstraite du modèle backend.

source: It details all the methods and attributes that are expected to be implemented for every model and for every backend.
fr: Il détaille tous les méthodes et attributs qui doivent être implémentées pour chaque modèle et chaque backend.

source: The model abstract class.
fr: La classe abstraite de modèle.

source: It details all the common attributes shared by every models.
fr: Il détaille tous les attributs en commun entre tous les modèles.

source: The :class:`~datetime.datetime` that the resource was added to the service provider.
fr: La date ( :class:`~datetime.datetime`) à laquelle la ressource a été ajoutée par le fournisseur de service.

source: A unique identifier for a SCIM resource as defined by the service provider. Id will be :data:`None` until the ``Backend.save`` method is called.
fr: Un identifiant unique pour une ressource SCIM tel que définie par le fournisseur du service. Id sera :data:`None` jusqu'à ce que la méthode ``BackendModel.save`` soit appelée.

source: Each representation of the resource MUST include a non-empty "id" value. This identifier MUST be unique across the SCIM service provider's entire set of resources. It MUST be a stable, non- reassignable identifier that does not change when the same resource is returned in subsequent requests. The value of the "id" attribute is always issued by the service provider and MUST NOT be specified by the client. The string "bulkId" is a reserved keyword and MUST NOT be used within any unique identifier value. The attribute characteristics are "caseExact" as "true", a mutability of "readOnly", and a "returned" characteristic of "always". See Section 9 for additional considerations regarding privacy.
fr: Chaque représentation de la ressource DOIT inclure une valeur non vide "id". Cet identifiant DOIT être unique dans l'ensemble des ressources du fournisseur de service SCIM. L'identifiant DOIT être stable et non réassignable et ne pas change quand la même ressource est retournée dans les requêtes suivantes. La valeur de l'attribut "id" est toujours produite par le fournisseur de service est NE DOIT PAS être fournie par le client. La chaîne "bulkId" est un mot-clef réservé et NE DOIT PAS être utilisée comme une valeur d'identifiant unique. Les caractéristiques d'attribut sont "caseExact" à "true", la modification de "readOnly" et une caractéristique"returned" à "always". Voir la Section 9 pour les considérations supplémentaires concernant la vie privée.

source: Return a unique value that will be used to identify the model instance.
fr: Retourne une valeur unique qui sera utilisée pour identifier l'instance du modèle.

source: This value will be used in URLs in canaille, so it should be unique and short.
fr: Cette valeur sera utilisée dans les URL de Canaille, il devrait donc être unique et court.

source: The most recent :class:`~datetime.datetime` that the details of this resource were updated at the service provider.
fr: La date la plus récente (:class:`~datetime.datetime`) à laquelle les détails de cette ressource a été mise-à-jour par le fournisseur de service.

source: If this resource has never been modified since its initial creation, the value MUST be the same as the value of :attr:`~canaille.backends.models.Model.created`.
fr: Si cette ressource n'a jamais été modifié depuis sa création initiale, la valeur DOIT être la même que :attr:`~canaille.backends.models.Model.created`.

source: Group model.
fr: Modèle de Groupe.

source: Based on the `SCIM Group schema <https://datatracker.ietf.org/doc/html/rfc7643#section-4.2>`_.
fr: Basé sur le `schéma de Groupe SCIM <https://datatracker.ietf.org/doc/html/rfc7643#section-4.2>`_.

source: A human-readable name for the Group.
fr: Un nom lisible par un humain pour le Groupe.

source: REQUIRED.
fr: OBLIGATOIRE.

source: A list of members of the Group.
fr: Une liste des membres du Groupe.

source: While values MAY be added or removed, sub-attributes of members are "immutable". The "value" sub-attribute contains the value of an "id" attribute of a SCIM resource, and the "$ref" sub-attribute must be the URI of a SCIM resource such as a "User", or a "Group". The intention of the "Group" type is to allow the service provider to support nested groups. Service providers MAY require clients to provide a non-empty value by setting the "required" attribute characteristic of a sub-attribute of the "members" attribute in the "Group" resource schema.
fr: Tandis que certaines valeurs PEUVENT être ajoutées ou supprimées, les sous-attributs de `members` sont « immutables ».. Le sous-attribut `value` contient la valeur de l'attribut « id » d'une ressource SCIM, and le sous-attribut « $ref » doit être l'URI d'une ressource SCIM telle que « User » ou « Group ». L'intention du type « Group » est d'autoriser les fournisseurs de service à supporter les groupes imbriqués. Les fournisseurs de service PEUVENT exiger des clients qu'ils fournissent une valeur non nulle en paramétrant la caractéristique d'attribut « required » d'un sous-attribut de l'attribut « members » dans le schéma de la ressource « Group ».

source: User model.
fr: Modèle Utilisateur.

source: Based on the `SCIM User schema <https://datatracker.ietf.org/doc/html/rfc7643#section-4.1>`_, `Entreprise User Schema Extension <https://datatracker.ietf.org/doc/html/rfc7643#section-4.3>`_ and `SCIM Password Management Extension <https://datatracker.ietf.org/doc/html/draft-hunt-scim-password-mgmt-00.html>`_ draft. Attribute description is based on SCIM and put there for information purpose. The description may not fit the current implementation in Canaille.
fr: Basé sur les spécifications`SCIM User schema <https://datatracker.ietf.org/doc/html/rfc7643#section-4.1>`_, `Entreprise User Schema Extension <https://datatracker.ietf.org/doc/html/rfc7643#section-4.3>`_ et le brouillon `SCIM Password Management Extension <https://datatracker.ietf.org/doc/html/draft-hunt-scim-password-mgmt-00.html>`_.

source: Whether or not the user has the :class:`~canaille.core.configuration.Permission` according to the :class:`configuration <canaille.core.configuration.ACLSettings>`.
fr: L’utilisateur a ou non la :class:`~canaille.core.configuration.Permission` en fonction de la :class:`configuration <canaille.core.configuration.ACLSettings>`.

source: Identifies the name of a department.
fr: Identifie le nom d’un service.

source: The name of the user, suitable for display to end-users.
fr: Le nom de l’utilisateur, destiné à être affiché auprès d’autres utilisateurs.

source: Each user returned MAY include a non-empty displayName value. The name SHOULD be the full name of the User being described, if known (e.g., "Babs Jensen" or "Ms. Barbara J Jensen, III") but MAY be a username or handle, if that is all that is available (e.g., "bjensen"). The value provided SHOULD be the primary textual label by which this User is normally displayed by the service provider when presenting it to end-users.
fr: Chaque utilisateur retourné PEUT inclure une valeur « displayName » non nulle. Le nom DOIT être le nom complet de l’utilisateur décrit, is connu (par exemple « Babs Jensen » ou « Mme. Barbara J Jensen, III ») mais PEUT être un nom d’utilisateur, si c'est la seule information disponible (par exemple « bjensen ») La valeur fournie DOIT être le nom d'affichage avec lequel l’utilisateur est normalement affiché par le fournisseur de service quand affiché auprès d'autres utilisateurs.

source: Email addresses for the User.
fr: L'adresse email de l'utilisateur.
