Repository: yaal-coop/canaille
Catalog: canaille/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, gl, ru, ta

source: You did not authorize applications yet.
de: Sie haben noch keine Anwendungen genehmigt.
es: Todavía no has autorizado ninguna aplicación.
fr: Vous n'avez pas encore autorisé d'application à accéder à votre profil.
gl: Aínda non autorizaches ningunha aplicación.
ru: Вы ещё не авторизовали приложения.
ta: நீங்கள் இன்னும் விண்ணப்பங்களை அங்கீகரிக்கவில்லை.

source: Do you want to log out?
de: Möchten Sie sich abmelden?
es: ¿Quieres cerrar sesión?
fr: Voulez vous vous déconnecter ?
gl: Queres pechar sesión?
ru: Вы хотите выйти?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?

source: You are currently logged in as %(username)s.
de: Sie sind derzeit als %(username)s angemeldet.
es: Estás identificado como %(username)s.
fr: Vous êtes identifiés en tant que %(username)s.
gl: Actualmente está rexistrado como %(username)s.
ru: Вы вошли как %(username)s.
ta: நீங்கள் தற்போது %(username)s என உள்நுழைந்துள்ளீர்கள்.

source: The application %(client_name)s wants to disconnect your account.
de: Die Anwendung %(client_name)s möchte die Verbindung zu Ihrem Konto trennen.
es: La aplicación %(client_name)s quiere desconectar tu cuenta.
fr: L'application %(client_name)s demande votre déconnexion.
gl: A aplicación %(client_name)s quere desconectar a túa conta.
ru: Приложение %(client_name)s пытается отсоеденить вашу учётную запись.
ta: பயன்பாடு %(client_name)s உங்கள் கணக்கை துண்டிக்க விரும்புகின்றன.

source: Stay logged
de: Eingeloggt bleiben
es: Permanecer conectado
fr: Rester connecté
gl: Permanecer rexistrado
ru: Оставаться в системе
ta: உள்நுழைந்திருங்கள்

source: Logout
de: Abmelden
es: Cerrar sesión
fr: Déconnexion
gl: Pechar sesión
ru: Выйти
ta: வெளியேற்றம்

source: Token details
de: Details zum Token
es: Detalles del token
fr: Détails du jeton
gl: Detalles do token
ru: Данные токена
ta: கிள்ளாக்கு விவரங்கள்

source: Application
ru: Приложение

source: Subject
de: Betreff
es: Sujeto
fr: Utilisateur
gl: Suxeito
ru: Субъект
ta: பொருள்

source: Audience
de: Zuordnung
es: Audiencia
gl: Audiencia
ru: Аудитория
ta: பார்வையாளர்கள்

source: Issue date
de: Ausgabedatum
es: Fecha de emisión
fr: Date d’émission
gl: Data de emisión
ru: Дата выпуска
ta: வெளியீட்டு தேதி

source: Expiration date
de: Verfallsdatum
es: Fecha de caducidad
fr: Date d'expiration
gl: Data de caducidade
ru: Дата истечения
ta: காலாவதி தேதி

source: This token has expired.
es: Este token ha expirado.
fr: Le jeton a expiré.
ru: Этот токен истёк.
ta: இந்த கிள்ளாக்கு காலாவதியானது.

source: Revokation date
de: Widerrufsdatum
es: Fecha de revocación
fr: Date de révocation
gl: Data de revogación
ru: Дата отзыва
ta: திரும்பப்பெறும் தேதி

source: Revoke token
de: Token widerrufen
es: Token de revocación
fr: Révoquer le jeton
gl: Revogar token
ru: Отозвать токен
ta: ரத்து கிள்ளாக்கு

source: This token has not been revoked
de: Dieses Token wurde nicht widerrufen
es: Este token no ha sido revocado
fr: Le jeton n'a pas été révoqué
gl: Este token non foi revogado
ru: Этот токен не был отозван
ta: இந்த கிள்ளாக்கு ரத்து செய்யப்படவில்லை

source: Token type
de: Token-Typ
es: Tipo de token
fr: Type de jeton
gl: Tipo de token
ru: Тип токена
ta: கிள்ளாக்கு வகை

source: Access token
de: Zugangstoken
es: Token de acceso
fr: Jeton d'accès
gl: Token de acceso
ru: Токен доступа
ta: அணுகல் கிள்ளாக்கு

source: Refresh token
de: Token aktualisieren
es: Token de refresco
fr: Jeton de rafraîchissement
gl: Refrescar token
ru: Обновить токен
ta: கிள்ளாக்கைப் புதுப்பி

source: No refresh token
es: Sin token de actualización
fr: Pas de jeton de rafraîchissement
ru: Токен обновления отсутствует
ta: புதுப்பிப்பு கிள்ளாக்கு இல்லை

source: Those applications automatically have authorizations to access you data.
de: Diese Anwendungen haben automatisch die Berechtigung, auf Ihre Daten zuzugreifen.
es: Esas aplicaciones tienen automáticamente autorizaciones para acceder a sus datos.
fr: Ces applications bénéficient automatiquement d'un accès à vos données.
gl: Esas aplicacións teñen automaticamente autorización para acceder ós teus datos.
ru: Эти приложения автоматически имеют разрешения на доступ к вашим данным.
ta: அந்த பயன்பாடுகள் உங்கள் தரவை அணுக தானாகவே அங்கீகாரங்களைக் கொண்டுள்ளன.

source: Client deletion
de: Client löschen
es: Eliminar cliente
fr: Suppression d'un client
gl: Eliminar cliente
ru: Удаление клиента
ta: வாங்கி நீக்குதல்

source: Are you sure you want to delete the client %(client_name)s? This action is unrevokable and all the data about this client will be removed.
de: Sind Sie sicher, dass Sie den Client %(client_name)s löschen wollen? Diese Aktion ist nicht widerrufbar und alle Daten zu diesem Client werden gelöscht.
es: ¿Estás seguro de que deseas eliminar el cliente %(client_name)s? Esta acción es irrevocable y se eliminarán todos los datos sobre este cliente.
fr: Êtes-vous sûrs de vouloir supprimer l'application %(client_name)s ? Cette action est irrévocable et toutes les données à propos de cette application seront supprimées.
ru: Вы уверены, что хотите удалить клиента %(client_name)s? Это действие неотменяемо, и все данные об этом клиенте будут удалены.
ta: கிளையன்ட் %(client_name)s நீக்க விரும்புகிறீர்களா? இந்த நடவடிக்கை மறுபரிசீலனை செய்ய முடியாதது மற்றும் இந்த கிளையண்டைப் பற்றிய அனைத்து தரவுகளும் அகற்றப்படும்.

source: Token revokation
de: Token-Widerruf
es: Revocar los tokens
fr: Révocation d'un jeton
ru: Отзыв токена
ta: கிள்ளாக்கு ரத்து

source: Are you sure you want to revoke this token? This action is unrevokable.
de: Sind Sie sicher, dass Sie diesen Token widerrufen wollen? Diese Aktion ist nicht widerrufbar.
es: ¿Estás seguro de que deseas revocar este token? Esta acción es irrevocable.
fr: Êtes-vous sûrs de vouloir révoquer ce jeton ? Cette action est irrévocable.
gl: Estás seguro de que queres revogar este token? Esta acción non pode ser desfeita.
ru: Вы уверены, что хотите отозвать этот токен? Это действие безвозвратно.
ta: இந்த கிள்ளாக்கை ரத்து செய்ய விரும்புகிறீர்களா? இந்த நடவடிக்கை மாற்ற முடியாதது.

source: Revoke
de: Widerrufen
es: Revocar
fr: Révoquer
ru: Отозвать
ta: ரத்து செய்யுங்கள்

source: Created
de: Erstellt
es: Creado
fr: Créé
gl: Creado
ru: Создано
ta: உருவாக்கப்பட்டது

source: Application logo
fr: Logo de l'application
ru: Логотип приложения

source: Token
fr: Jeton
ru: Токен
ta: கிள்ளாக்கு

source: One-time password authentication on {website_name}
es: Contraseña de un solo uso en {website_name}
fr: Mot de passe à usage unique sur {website_name}

source: One-time password authentication has been reset
es: Se ha restablecido la autenticación de contraseña de un solo uso
fr: L'authentification par mots de passe à usage unique a été ré-initialisée

source: Email
es: Correo electrónico
fr: Courriel
gl: Correo electrónico
ta: மின்னஞ்சல்

source: jane.doe@example.com
fr: camille.dupont@exemple.fr

source: 132, Foobar Street, Gotham City 12401, XX
de: Musterstrasse 1, 12345 Musterstadt
es: Calle Foobar, 132, Gotham City 12401, XX
fr: 132, rue du Lorem Ipsum - 99000 Gotham City - XX
ta: 132, ஃபூபார் தெரு, கோதம் சிட்டி 12401, xx

source: 132, Foobar Street
de: Beispielstraße 132
es: Calle Foobar, 132
fr: 132, rue du Lorem Ipsum
ta: 132, ஃபூபார் தெரு

source: North Pole
de: Nordpol
es: Polo Norte
fr: Pôle nord
ta: வட முனை

source: Cogip LTD.
de: Musterfirma
fr: Cogip SARL.
ta: கோகிப் லிமிடெட்.

source: https://mywebsite.example
fr: https://mon-site-internet.fr

source: One-time password
es: Contraseña de un solo uso
fr: Mot de passe à usage unique

source: Token Endpoint Auth Method
de: Token Endpunkt Auth Methode
es: Método de autenticación para el endpoint del token
fr: Méthode d'authentification du point d'accès des jetons
gl: Método de autenticación para o endpoint do token
ta: கிள்ளாக்கு எண்ட்பாயிண்ட் அங்கீகார முறை

source: JKWS URI
fr: URI du JWKS

source: Reset one-time password authentication
es: Restablecer la autenticación de contraseña de un solo uso
fr: Réinitialiser l'authentification par mot de passe à usage unique

source: One-time password authentication.
es: Autenticación de contraseña de un solo uso.
fr: Authentification par mot de passe à usage unique.

source: Email one-time password
es: Contraseña de un solo uso por correo electrónico
fr: Mot de passe à usage unique par email

source: One-time password authentication
es: Autenticación de contraseña de un solo uso
fr: Authentification par mot de passe à usage unique

source: Someone, probably you, asked for a one-time password at %(site_name)s. If you did not ask for this email, please ignore it. If you did, please enter the one-time password below at %(site_name)s to complete your authentication.
es: Alguien, probablemente tu, pidió una contraseña de un solo uso en %(site_name)s. Si no has pedido este correo electrónico, por favor, ignóralo. Si lo hiciste, por favor ingresa la contraseña de uso único a continuación en %(site_name)s para completar tu autenticación.
fr: Quelqu'un, probablement vous, a demandé un mot de passe à usage unique pour le site %(site_name)s. Si vous n'êtes pas à l'origine de ce message, veuillez l'ignorer. Si vous l'êtes, saisissez le mot de passe à usage unique ci-dessous sur %(site_name)s pour terminer votre authentification.

source: Your one-time password
es: Tu contraseña de un solo uso
fr: Votre mot de passe à usage unique

source: Please enter the one-time password below at %(site_name)s to complete your authentication.
es: Por favor, introduzca la contraseña de un solo uso que se indica a continuación en %(site_name)s para completar tu autenticación.
fr: Veuillez saisir le mot de passe à usage unique ci-dessous à %(site_name)s pour terminer votre authentification.

source: One-time password authentication reset
es: Restablecer la autenticación de contraseña de un solo uso
fr: Réinitialisation de l'authentification par mot de passe à usage unique

source: Are you sure you want to reset one-time password (OTP) authentication for %(user_name)s ? The user will have to perform OTP setup again at next login.
es: ¿Estás seguro de que deseas restablecer la autenticación de contraseña única (OTP) para %(user_name)s? El usuario tendrá que realizar la configuración de OTP nuevamente en el próximo inicio de sesión.
fr: Êtes-vous sûrs de vouloir réinitialiser l'authentification par mot de passe à usage unique (OTP) pour %(user_name)s ? L'utilisateur devra mettre en place son authentification à sa prochaine connexion.

source: Are you sure you want to reset one-time password (OTP) authentication? You will have to perform OTP setup again at next login.
es: ¿Estás seguro de que deseas restablecer la autenticación de contraseña única (OTP)? Tendrás que realizar la configuración de OTP nuevamente en el próximo inicio de sesión.
fr: Êtes-vous sûr de vouloir réinitialiser votre authentification par mot de passe à usage unique (OTP) ? Vous devrez procéder à la mise en place de l'authentification par mot de passe à usage unique à votre prochaine connexion.

source: Here is the one-time password you requested for %(website_name)s: %(otp)s
es: Aquí está la contraseña de un solo uso que solicitó para %(website_name)s: %(otp)s
fr: Voici le mot de passe à usage unique que vous avez demandé pour %(website_name)s : %(otp)s

source: User account creation succeed.
es: Cuenta creada correctamente.
gl: Conta creada correctamente.

source: Could not send the password reset link.
es: No se pudo enviar el correo electrónico para restablecer de contraseña.
gl: Non foi posible enviar o email para restablecer o contrasinal.

source: A password reset link has been sent at your email address. You should receive it within a few minutes.
es: Se ha enviado un enlace para restablecer la contraseña a tu correo electrónico. Deberías recibirlo en unos minutos.
gl: Enviouse unha ligazón para restablecer o contrasinal ó teu correo electrónico. Deberías recibilo nun prazo de 10 minutos.

source: The password reset link that brought you here was invalid.
es: El enlace para restablecer la contraseña que le ha traído aquí no es válido.
gl: A ligazón para restablecer o contrasinal co que accediches non é válido.

source: Gotham City
de: Musterstadt
es: Ciudad de Gotham
ta: கோதம் சிட்டி

source: JKW URI
es: URI de JKW
gl: URI de JKW

source: Pre-consent
es: Preconsentimiento
gl: Preconsentemento

source: Homepage
es: Página de inicio
gl: Sitio web

source: After this form is sent, if the email address or the login you provided exists, you will receive an email containing a link that will allow you to reset your password.
es: Una vez que se envíe este formulario, si la dirección de correo electrónico o nombre de usuario que has proporcionado existe, recibirás un correo electrónico con un enlace que te permitirá restablecer la contraseña.
gl: Despois de enviar este formulario, se o correo electrónico ou nome de usuario proporcionado existe, recibirás un email cun enlace que te permitirá restablecer o contrasinal.

source: Clients
es: Clientes
gl: Clientes

source: Add a client
es: Añadir un cliente
gl: Engadir un cliente

source: Edit a client
es: Editar un cliente
gl: Editar un cliente

source: Client
es: Cliente
gl: Cliente

source: URI
ta: யூரி

source: ID
ta: ஐடி

source: URL
ta: முகவரி

source: The user %(user)s has been sucessfuly deleted
gl: O usuario %(user)s eliminouse correctamente

source: The test invitation mail has been sent correctly
gl: O email de invitación de proba enviouse correctamente

source: The test invitation mail has not been sent correctly
gl: Non se puido enviar o email de invitación de proba

source: https://mywebsite.tld
gl: https://example.com

source: The group %(group)s has been sucessfully created
gl: O grupo %(group)s creouse correctamente

source: The group %(group)s has been sucessfully edited.
gl: O grupo %(group)s actualizouse correctamente.

source: The group %(group)s has been sucessfully deleted
gl: O grupo %(group)s eliminouse correctamente

source: Password reinitialisation
gl: Reinicialización de contrasinal

source: Someone, probably you, asked for a password reinitialization link at %(site_name)s. If you did not asked for this email, please ignore it. If you need to reset your password, please click on the link below and follow the instructions.
gl: Alguén, probablemente ti, pediu unha ligazón de reinicialización do contrasinal en %(site_name)s. Se non pediches este correo electrónico, ignórao. Se precisas restablecer o teu contrasinal, fai clic na seguinte ligazón e sigue as instrucións.
