Repository: yaal-coop/canaille
Catalog: canaille/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, gl, ru, ta

source: Your password has expired, please choose a new password.
fr: Votre mot de passe a expiré, veuillez en choisir un nouveau.
ru: Ваш пароль просрочен, пожалуйста, выберите новый пароль.

source: No SMTP server has been configured
de: Es wurde kein SMTP-Server konfiguriert
es: No se ha configurado un servidor SMTP
fr: Aucun serveur SMTP n'a été configuré
gl: Non se configurou un servidor SMTP
ru: Сервер SMTP не настроен
ta: SMTP சேவையகம் எதுவும் கட்டமைக்கப்படவில்லை

source: This is not a valid URL
de: Dies ist keine gültige URL
es: No es una dirección URL válida
fr: Cette URL n’est pas valide
ru: Неправильный URL
ta: இது சரியான முகவரி அல்ல

source: This value is a duplicate
de: Dieser Wert ist ein Duplikat
es: Este valor está duplicado
fr: Cette valeur est un doublon
ru: Это значение является дубликатом
ta: இந்த மதிப்பு ஒரு நகல்

source: Not a valid phone number
de: Keine gültige Telefonnummer
es: Número de teléfono no válido
fr: N’est pas un numéro de téléphone valide
ru: Неправильный номер телефона
ta: செல்லுபடியாகும் தொலைபேசி எண் அல்ல

source: Field must be at least {minimum_password_length} characters long.
es: El campo debe tener al menos {minimum_password_length} caracteres.
fr: Ce champ doit contenir au minimum {minimum_password_length} caractères.
ru: Поле должно быть длиной как минимум {minimum_password_length}.
ta: புலம் குறைந்தபட்சம் {minimum_password_length} எழுத்துக்கள் நீளமாக இருக்க வேண்டும்.

source: Field cannot be longer than {maximum_password_length} characters.
es: El campo no puede tener más de {maximum_password_length} caracteres.
fr: Ce champ doit contenir au maximum {maximum_password_length} caractères.
ru: Длина поля не может превышать {maximum_password_length} символов.
ta: புலம் {maximum_password_length} எழுத்துக்களை விட நீளமாக இருக்க முடியாது.

source: This password appears on public compromission databases and is not secure.
es: Esta contraseña aparece en bases de datos de compromisos públicos y no es segura.
fr: Ce mot de passe apparaît dans les bases de données publiques compromises et n'est pas sécurisé.
ru: Этот пароль засветился в известных базах слитых паролей и не является безопасным.
ta: இந்த கடவுச்சொல் பொது சமரச தரவுத்தளங்களில் தோன்றும் மற்றும் பாதுகாப்பாக இல்லை.

source: The page number is not valid
de: Die Seitenzahl ist nicht gültig
es: El número de página no es válido
fr: Le numéro de page est invalide
ru: Номер страницы неверный
ta: பக்க எண் செல்லுபடியாகாது

source: Not a valid datetime value.
de: Kein gültiger Datum-Zeit-Wert.
es: No es un valor de fecha y hora válido.
fr: N'est pas une date valide.
ru: Недопустимое значение даты и времени.
ta: சரியான தேதிநேர மதிப்பு அல்ல.

source: Password compromise investigation failed. Please contact the administrators.
es: Ha fallado la investigación de compromisos de la contraseña. Por favor contacta con los administradores.
fr: La recherche sur la compromission du mot de passe a échoué. Veuillez contacter les administrateurs.
ru: Расследование компрометации пароля не удалось. Обратитесь к администраторам.
ta: கடவுச்சொல் சமரச வினவல் தோல்வியடைந்தது. நிர்வாகிகளை தொடர்பு கொள்ளவும்.

source: We have informed your administrator about the failure of the password compromise investigation.
es: Has informado a tu administrador sobre el error de la investigación de compromisos de la contraseña.
fr: Nous avons informé votre administrateur de l'échec de la recherche sur la compromission du mot de passe.
ru: Мы проинформировали вашего администратора о сбое при проверке компрометации пароля.
ta: கடவுச்சொல் சமரச விசாரணையின் தோல்வி குறித்து உங்கள் நிர்வாகிக்கு நாங்கள் தெரிவித்துள்ளோம்.

source: An error occurred while communicating the incident to the administrators. Please update your password as soon as possible. If this still happens, please contact the administrators.
es: Se produjo un error al comunicar el incidente a los administradores. Por favor, actualiza tu contraseña lo antes posible. Si esto sigue ocurriendo, por favor contacta con los administradores.
fr: Une erreur s'est produite lors de la communication de l'incident aux administrateurs. Veuillez mettre à jour votre mot de passe dès que possible. Si cela se produit encore, veuillez contacter les administrateurs.
ru: Произошла ошибка при сообщении об инциденте администраторам. Пожалуйста, обновите пароль как можно скорее. Если проблема повторится, обратитесь к администраторам.
ta: சம்பவத்தை நிர்வாகிகளிடம் தொடர்பு கொள்ளும்போது பிழை ஏற்பட்டது. உங்கள் கடவுச்சொல்லை விரைவில் புதுப்பிக்கவும். இது இன்னும் நடந்தால், தயவுசெய்து நிர்வாகிகளை தொடர்பு கொள்ளவும்.

source: Could not connect to the LDAP server '{uri}'
de: Verbindung zu LDAP Server '{uri}' fehlgeschlagen
es: No se pudo conectar al servidor LDAP '{uri}'
fr: Impossible de se connecter au serveur LDAP '{uri}'
gl: Non foi posible conectar co servidor LDAP '{uri}'
ru: Невозможно подключиться к LDAP-серверу '{uri} "
ta: LDAP சேவையகத்துடன் '{uri}' உடன் இணைக்க முடியவில்லை

source: LDAP authentication failed with user '{user}'
de: LDAP Authentifizierung für Benutzer '{user}' fehlgeschlagen
es: Falló la autenticación LDAP con el usuario '{user}'
fr: L'authentification au serveur LDAP a échoué pour l'utilisateur '{user}'
gl: Fallou a autenticación LDAP co usuario '{user}'
ru: Ошибка аутентификации LDAP для пользователя '{user}'
ta: LDAP ஏற்பு பயனருடன் '{user}' உடன் தோல்வியடைந்தது

source: Your account has been locked.
de: Ihr Konto wurde gesperrt.
es: Tu cuenta ha sido bloqueada.
fr: Votre compte a été verrouillé.
ru: Ваш аккаунт заблокирован.
ta: உங்கள் கணக்கு பூட்டப்பட்டுள்ளது.

source: You should change your password.
de: Sie sollten Ihr Passwort ändern.
es: Deberías cambiar tu contraseña.
fr: Vous devriez changer votre mot de passe.
ru: Вы должны изменить свой пароль.
ta: உங்கள் கடவுச்சொல்லை மாற்ற வேண்டும்.

source: John Doe
de: Max Mustermann
fr: Camille Dupont
ru: Иван Иванов
ta: சான் டோ

source: jdoe
de: mmustermann
fr: cdupont
ru: ivanov

source: john.doe@example.com
fr: camille.dupont@exemple.fr
ru: ivan.ivanov@example.com

source: or
de: oder
es: o
fr: ou
gl: ou
ru: или
ta: அல்லது

source: Test email from {website_name}
de: Test-E-Mail von {website_name}
es: Email de prueba de {website_name}
fr: Courriel de test de {website_name}
gl: Email de proba de {website_name}
ru: Проверить почту из {website_name}
ta: {website_name}

source: Password reset on {website_name}
de: Passwort zurücksetzen auf {website_name}
es: Restablecer contraseña en {website_name}
fr: Réinitialisation du mot de passe sur {website_name}
gl: Restablecer contrasinal en {website_name}
ru: Сброс пароля на {website_name}
ta: கடவுச்சொல் மீட்டமைப்பு {website_name}

source: Password initialization on {website_name}
de: Passwortinitialisierung auf {website_name}
es: Inicialización de la contraseña en {website_name}
fr: Initialisation de votre mot de passe sur {website_name}
gl: Inicialización do contrasinal en {website_name}
ru: Инициализация пароля на {website_name}
ta: கடவுச்சொல் துவக்கம் {website_name}

source: You have been invited to create an account on {website_name}
de: Sie wurden eingeladen, ein Konto auf {website_name} zu erstellen
es: Has sido invitado a crear una cuenta en {website_name}
fr: Vous êtes invités à vous créer un compte sur {website_name}
gl: Fuches invitado a crear unha conta en (website_name)
ru: Вас пригласили завести учётную запись на {website_name}
ta: {website_name} இல் ஒரு கணக்கை உருவாக்க நீங்கள் அழைக்கப்பட்டுள்ளீர்கள்

source: Confirm your address email on {website_name}
de: Bestätigen Sie Ihre Email-Adresse unter {website_name}
es: Confirma tu dirección de correo electrónico en {website_name}
fr: Confirmez votre adresse email sur {website_name}
ru: Подтвердить ваш адрес электронной почты на {website_name}
ta: உங்கள் முகவரி மின்னஞ்சலை {website_name} இல் உறுதிப்படுத்தவும்

source: Continue your registration on {website_name}
de: Registrierung fortsetzen unter {website_name}
es: Continúa con tu registro en {website_name}
fr: Poursuivez votre inscription sur {website_name}
ru: Продолжите регистрацию на {website_name}
ta: {website_name} இல் உங்கள் பதிவைத் தொடரவும்

source: Compromised password check failure on {website_name}
es: Fallo de comprobación de contraseña comprometida en {website_name}
fr: Échec de la vérification de la compromission du mot de passe sur {website_name}
ru: Ошибка проверки пароля на компрометацию на {website_name}
ta: வேறுபாடின்மை செய்யப்பட்ட கடவுச்சொல் சோதனை தோல்வி {website_name}

source: One-time passcode authentication on {website_name}
ru: Аутентификация одноразовым кодом на {website_name}

source: The user name '{user_name}' already exists
de: Der Benutzername '{user_name}' existiert bereits
es: El nombre de usuario '{user_name}' ya existe
fr: Le nom d’utilisateur '{user_name}' existe déjà
ru: Пользователь с таким именем '{user_name}' уже существует
ta: '{user_name}' பயனர்பெயர் ஏற்கனவே உள்ளது

source: The email '{email}' is already used
de: Die E-Mail '{email}' wird bereits verwendet
es: El correo electrónico '{email}' ya está en uso
fr: L’adresse '{email}' est déjà utilisée
ru: Электронная почта '{email} уже используется
ta: '{email}' என்ற மின்னஞ்சல் ஏற்கனவே பயன்படுத்தப்பட்டுள்ளது

source: The group '{group}' already exists
de: Die Gruppe '{group}' existiert bereits
es: El grupo '{group}' ya existe
fr: Le group '{group}' existe déjà
gl: O grupo '{group}' xa existe
ru: Группа «{group}» уже существует
ta: '{group}' குழு ஏற்கனவே உள்ளது

source: The login '{login}' does not exist
de: Der Anmeldename '{login}' existiert nicht
es: El usuario '{login}' no existe
fr: L'identifiant '{login}' n'existe pas
gl: O usuario '{login}' non existe
ru: Пользователя с '{login} не существует
ta: உள்நுழைவு '{login}' இல்லை

source: The user you are trying to remove does not exist.
de: Der Benutzer, den Sie versuchen zu entfernen, existiert nicht.
es: El usuario que intenta eliminar no existe.
fr: L’utilisateur que vous essayez de retirer n’existe pas.
ru: Пользователь, который вы пытаетесь удалить, не существует.
ta: நீங்கள் அகற்ற முயற்சிக்கும் பயனர் இல்லை.

source: The user '{user}' has already been removed from the group '{group}'
de: Der Benutzer '{user}' wurde bereits aus der Gruppe '{group}' entfernt
es: El usuario '{user}' ya ha sido eliminado del grupo '{group}'
fr: L’utilisateur « {user} » a déjà été retiré du groupe « {group} »
ru: Пользователь '{user}' уже удалён из группы '{group}'
ta: பயனர் '{user}' ஏற்கனவே '{group}' குழுவிலிருந்து அகற்றப்பட்டுள்ளது

source: The group '{group}' cannot be removed, because it must have at least one user left.
de: Die Gruppe '{group}' kann nicht entfernt werden, weil noch mindestens ein Benutzer enthalten ist.
es: El grupo '{group}' no puede ser eliminado, porque debe tener al menos un usuario.
fr: Le groupe « {group} » doit garder au minimum un utilisateur, et ne peut être retiré.
ru: Группа «{group}» не может быть удалена, поскольку остался по крайней мере один пользователь.
ta: '{group}' குழுவை அகற்ற முடியாது, ஏனென்றால் அதற்கு குறைந்தது ஒரு பயனராவது இருக்க வேண்டும்.

source: You will receive soon an email to continue the registration process.
de: In Kürze erhalten Sie eine E-Mail um die Registrierung fortzusetzen.
es: En breve recibirás un correo electrónico para seguir con el registro.
fr: Vous recevrez sous peu un courriel qui vous permettra de poursuivre votre inscription.
ru: Вскоре вы получите электронное письмо чтобы продолжить процесс регистрации.
ta: பதிவு செயல்முறையைத் தொடர விரைவில் ஒரு மின்னஞ்சலைப் பெறுவீர்கள்.

source: An error happened while sending your registration mail. Please try again in a few minutes. If this still happens, please contact the administrators.
de: Beim Versenden der Registrierungs-E-Mail ist ein Fehler aufgetreten. Bitte versuchen Sie es in einigen Minuten erneut. Falls der Fehler weiterhin besteht, kontaktieren Sie bitte den Administrator.
es: Se produjo un error al enviar el correo de registro. Vuelve a intentarlo en unos minutos. Si sigue ocurriendo, ponte en contacto con los administradores.
fr: Une erreur est survenue lors de l’envoi de votre courriel d'inscription. Veuillez retenter dans quelques minutes. Si le problème subsite, veuillez contacter les administrateurs.
ru: Произошла ошибка при отправке регистрационного письма. Повторите попытку через несколько минут. Если проблема повторится, обратитесь к администраторам.
ta: உங்கள் பதிவு அஞ்சலை அனுப்பும்போது பிழை ஏற்பட்டது. சில நிமிடங்களில் மீண்டும் முயற்சிக்கவும். இது இன்னும் நடந்தால், தயவுசெய்து நிர்வாகிகளை தொடர்பு கொள்ளவும்.

source: The registration link that brought you here was invalid.
de: Der Registrierungslink, der Sie hier hergeführt hat, war ungültig.
es: El enlace de registro que te trajo aquí no es válido.
fr: Le lien qui vous a amené ici est invalide.
ru: Ссылка на регистрацию по которой вы пришли была уже недействительной.
ta: உங்களை இங்கு கொண்டு வந்த பதிவு இணைப்பு தவறானது.

source: The registration link that brought you here has expired.
de: Der Registrierungslink, der Sie hier hergeführt hat, ist abgelaufen.
es: El enlace de registro que te trajo aquí ha caducado.
fr: Le lien qui vous a amené ici a expiré.
ru: Срок действия ссылки на регистрацию, по которой вы попали сюда, истёк.
ta: உங்களை இங்கு கொண்டு வந்த பதிவு இணைப்பு காலாவதியானது.

source: Your account has already been created.
de: Ihr Konto wurde bereits erstellt.
es: Tu cuenta ya ha sido creada.
fr: Votre compte a déjà été créé.
gl: A túa conta xa existe.
ru: Ваш аккаунт уже создан.
ta: உங்கள் கணக்கு ஏற்கனவே உருவாக்கப்பட்டுள்ளது.

source: You are already logged in, you cannot create an account.
de: Sie sind bereits angemeldet, Sie können kein Konto erstellen.
es: Ya has iniciado sesión, no puedes crear una cuenta.
fr: Vous êtes déjà connectés, vous ne pouvez pas créer de compte.
gl: Xa iniciaches sesión, non podes crear unha conta.
ru: Вы уже вошли в систему, вы не можете создать учётную запись.
ta: நீங்கள் ஏற்கனவே உள்நுழைந்துள்ளீர்கள், நீங்கள் ஒரு கணக்கை உருவாக்க முடியாது.

source: Groups
de: Gruppen
es: Grupos
fr: Groupes
gl: Grupos
ru: Группы
ta: குழுக்கள்

source: Password and confirmation do not match.
de: Passwort und Bestätigung stimmen nicht überein.
es: La contraseña y la confirmación no coinciden.
fr: Le mot de passe et sa confirmation ne correspondent pas.
gl: Os dous contrasinais non coinciden.
ru: Пароль и подтверждение не совпадают.
ta: கடவுச்சொல் மற்றும் உறுதிப்படுத்தல் பொருந்தவில்லை.

source: User account creation failed.
de: Erstellung des Benutzerkontos fehlgeschlagen.
es: Error en la creación de la cuenta de usuario.
fr: La création du compte utilisateur a échoué.
gl: Fallou a creación da conta de usuario.
ru: Создание учётной записи пользователя провалилось.
ta: பயனர் கணக்கு உருவாக்கம் தோல்வியடைந்தது.

source: Your account has been created successfully.
de: Ihr Konto wurde erfolgreich erstellt.
es: Tu cuenta se ha creado correctamente.
fr: Votre compte utilisateur a été créé avec succès.
ru: Ваша учётная запись успешно создана.
ta: உங்கள் கணக்கு வெற்றிகரமாக உருவாக்கப்பட்டுள்ளது.

source: The email confirmation link that brought you here is invalid.
de: Der E-Mail-Bestätigungslink, der Sie hierhergeführt hat, ist ungültig.
es: El enlace de confirmación del correo electrónico que te ha traído hasta aquí no es válido.
fr: Le lien de confirmation qui vous a amené ici est invalide.
ru: Срок действия ссылки на подтверждение электронной почты, по которой вы попали сюда, истёк.
ta: உங்களை இங்கு கொண்டு வந்த மின்னஞ்சல் உறுதிப்படுத்தல் இணைப்பு தவறானது.

source: The email confirmation link that brought you here has expired.
de: Der E-Mail-Bestätigungslink, der Sie hier hergeführt hat, ist abgelaufen.
es: El enlace de confirmación del correo electrónico que te trajo hasta aquí ha caducado.
fr: Le lien de confirmation qui vous a amené ici a expiré.
ru: Срок действия ссылки на приглашение, по которой вы попали сюда, истёк.
ta: உங்களை இங்கு கொண்டு வந்த மின்னஞ்சல் உறுதிப்படுத்தல் இணைப்பு காலாவதியானது.

source: The invitation link that brought you here was invalid.
de: Der Einladungslink, der Sie hierhergeführt hat, war ungültig.
es: El enlace de invitación con el que has accedido no es válido.
fr: Le lien d'invitation qui vous a amené ici est invalide.
gl: A ligazón de invitación coa que accediches non é válida.
ru: Ссылка на приглашение, по которой вы попали сюда, неправильная.
ta: உங்களை இங்கு கொண்டு வந்த அழைப்பிதழ் இணைப்பு தவறானது.

source: This address email have already been confirmed.
de: Diese E-Mail-Adresse wurde bereits bestätigt.
es: Esta dirección de correo electrónico ya ha sido confirmada.
fr: Cette adresse email a déjà été confirmée.
ru: Этот адрес электронной почты уже подтверждён.
ta: இந்த முகவரி மின்னஞ்சல் ஏற்கனவே உறுதிப்படுத்தப்பட்டுள்ளது.

source: This address email is already associated with another account.
de: Diese E-Mail-Adresse ist bereits mit einem anderen Account verknüpft.
es: Esta dirección de correo electrónico ya está asociada a otra cuenta.
fr: Cette adresse email est déjà associée à un autre compte.
ru: Этот адрес электронной почты уже связан с другой учётной записью.
ta: இந்த முகவரி மின்னஞ்சல் ஏற்கனவே மற்றொரு கணக்குடன் தொடர்புடையது.

source: Your email address have been confirmed.
de: Ihre E-Mail-Adresse wurde bestätigt.
es: Tu dirección de correo electrónico ha sido confirmada.
fr: Votre adresse email a été confirmée.
ru: Ваш адрес электронной почты был подтвержден.
ta: உங்கள் மின்னஞ்சல் முகவரி உறுதிப்படுத்தப்பட்டுள்ளது.

source: User account creation succeeded.
fr: La création du compte utilisateur a réussi.
ru: Создание учетной записи пользователя удалось.

source: Profile edition failed.
de: Profiländerung fehlgeschlagen.
es: Ha fallado la edición del perfil.
fr: L'édition du profil a échoué.
gl: Fallou a actualización do perfil.
ru: Сбой при изменении профиля.
ta: சுயவிவர பதிப்பு தோல்வியடைந்தது.

source: Profile updated successfully.
de: Profil erfolgreich aktualisiert.
es: Perfil actualizado correctamente.
fr: Le profil a été mis à jour avec succès.
ru: Профиль успешно обновлён.
ta: சுயவிவரம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது.

source: Email addition failed.
de: E-Mail hinzufügen fehlgeschlagen.
es: Error al añadir el correo electrónico.
fr: L’ajout de l’adresse email a échoué.
ru: Не удалось добавить адрес электронной почты.
ta: மின்னஞ்சல் கூடுதலாக தோல்வியடைந்தது.

source: An email has been sent to the email address. Please check your inbox and click on the verification link it contains
de: Eine E-Mail wurde an die Adresse gesendet. Bitte prüfen Sie Ihren Posteingang und klicken Sie auf den Verifizierungslink in der E-Mail
es: Se ha enviado un correo electrónico a la dirección de correo electrónico. Por favor, comprueba tu bandeja de entrada y haz clic en el enlace de verificación que contiene
fr: Un courriel a été envoyé à l’adresse email. Veuillez consulter votre boîte de réception et cliquer sur le lien de confirmation qu’il contient
ru: На ваш адрес электронной почты отправлено письмо. Пожалуйста, проверьте свой почтовый ящик и нажмите на ссылку проверки из письма
ta: மின்னஞ்சல் முகவரிக்கு மின்னஞ்சல் அனுப்பப்பட்டுள்ளது. தயவுசெய்து உங்கள் இன்பாக்சை சரிபார்த்து, அதில் உள்ள சரிபார்ப்பு இணைப்பைக் சொடுக்கு செய்க

source: Could not send the verification email
de: Die E-Mail zur Verifikation konnte nicht gesendet werden
es: No se pudo enviar el correo electrónico de verificación
fr: Impossible d’envoyer le courriel de confirmation
ru: Не удалось отправить проверочное письмо
ta: சரிபார்ப்பு மின்னஞ்சலை அனுப்ப முடியவில்லை

source: Email deletion failed.
de: E-Mail löschen fehlgeschlagen.
es: Error al eliminar el correo electrónico.
fr: La suppression de l’adresse email a échoué.
ru: Не удалось удалить адрес электронной почты.
ta: மின்னஞ்சல் நீக்குதல் தோல்வியடைந்தது.

source: The email have been successfully deleted.
de: Die E-Mail wurde erfolgreich entfernt.
es: El correo electrónico se ha eliminado correctamente.
fr: L’adresse email a correctement été supprimée.
ru: Электронное письмо было успешно удалено.
ta: மின்னஞ்சல் வெற்றிகரமாக நீக்கப்பட்டுள்ளது.

source: A password initialization link has been sent at the user email address. It should be received within a few minutes.
de: Ein Link zur Initialisierung des Passworts wurde an die E-Mail-Adresse des Benutzers gesendet. Sie sollten ihn innerhalb weniger Minuten erhalten.
es: Se ha enviado un enlace de inicialización de la contraseña a la dirección de correo electrónico del usuario. Deberías recibirlo en unos minutos.
fr: Un lien d'initialisation de mot de passe a été envoyé à l'utilisateur par courriel. Il devrait arriver d'ici une quelques minutes.
ru: Ссылка для инициализации пароля была отправлена по адресу электронной почты пользователя. Оно должно будет получено в течение нескольких минут.
ta: கடவுச்சொல் துவக்க இணைப்பு பயனர் மின்னஞ்சல் முகவரியில் அனுப்பப்பட்டுள்ளது. இது சில நிமிடங்களுக்குள் பெறப்பட வேண்டும்.

source: Could not send the password initialization email
de: Die E-Mail zur Kennwortinitialisierung konnte nicht gesendet werden
es: No se pudo enviar el email de inicialización de contraseña
fr: Impossible d'envoyer le courriel d'initialisation de mot de passe
gl: Non foi posible enviar o email de inicialización do contrasinal
ru: Невозможно отправить письмо с инициализацией пароля
ta: கடவுச்சொல் துவக்க மின்னஞ்சலை அனுப்ப முடியவில்லை

source: A password reset link has been sent at the user email address. It should be received within a few minutes.
de: Ein Link zum Zurücksetzen des Passworts wurde an die E-Mail-Adresse des Benutzers gesendet. Sie sollten ihn innerhalb weniger Minuten erhalten.
es: Se ha enviado un enlace de restablecimiento de la contraseña a la dirección del correo electrónico del usuario. Deberías recibirlo en unos minutos.
fr: Un lien de réinitialisation de mot de passe a été envoyé à l'utilisateur par courriel. Il devrait arriver d'ici quelques de minutes.
ru: Письмо со ссылкой для сброса пароля была отправлена по адресу электронной почты пользователя. Оно должно будет получено в течение нескольких минут.
ta: கடவுச்சொல் மீட்டமைப்பு இணைப்பு பயனர் மின்னஞ்சல் முகவரியில் அனுப்பப்பட்டுள்ளது. இது சில நிமிடங்களுக்குள் பெறப்பட வேண்டும்.

source: Could not send the password reset email
de: Die E-Mail zum Zurücksetzen des Passworts konnte nicht gesendet werden
es: No se pudo enviar el correo electrónico para restablecer la contraseña
fr: Impossible d'envoyer le lien de réinitialisation
gl: Non foi posible enviar o email para restablecer o contrasinal
ru: Не удалось отправить по электронной почте сброс пароля
ta: கடவுச்சொல் மீட்டமைப்பு மின்னஞ்சலை அனுப்ப முடியவில்லை

source: The account has been locked
de: Das Konto wurde gesperrt
es: La cuenta ha sido bloqueada
fr: Le compte a été verrouillé
ru: Эта учётная запись была заблокирована
ta: கணக்கு பூட்டப்பட்டுள்ளது

source: The account has been unlocked
de: Das Konto wurde entsperrt
es: La cuenta ha sido desbloqueada
fr: Le compte a été déverrouillé
ru: Эта учётная запись была разблокирована
ta: கணக்கு திறக்கப்பட்டுள்ளது

source: Authenticator application passcode authentication has been reset
ru: Аутентификация одноразовым кодом была сброшена

source: The user %(user)s has been successfully deleted
es: El usuario %(user)s ha sido eliminado correctamente
fr: L'utilisateur %(user)s a bien été supprimé
ru: Пользователь %(user)s был успешно удалён
ta: பயனர் %(user)s வெற்றிகரமாக நீக்கப்பட்டன

source: Locked users cannot be impersonated.
de: Gesperrte Benutzer können nicht imitiert werden.
es: Los usuarios bloqueados no pueden ser suplantados.
fr: Impossible de prendre l’identité d’utilisateurs dont le compte est verrouillé.
ru: Невозможно войти как заблокированный пользователь.
ta: பூட்டப்பட்ட பயனர்களை ஆள்மாறாட்டம் செய்ய முடியாது.
