Repository: yaal-coop/canaille
Catalog: canaille/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, gl, ru, ta

source: In order to finalize your account configuration at %(site_name)s, we need to setup your password. Please click on the link below and follow the instructions.
de: Um die Konfiguration Ihres Kontos bei %(site_name)s abzuschließen, müssen wir Ihr Passwort einrichten. Bitte klicken Sie auf den unten stehenden Link und folgen Sie den Anweisungen.
es: Para finalizar la configuración de tu cuenta en %(site_name)s, necesitas establecer una contraseña. Por favor haz clic en el siguiente enlace y sigue las instrucciones.
fr: Afin de finaliser la configuration de votre compte sur %(site_name)s, nous devons mettre en place un mot de passe. Veuillez cliquer sur le lien ci-dessous, et suivre les instructions qui vous seront présentées.
gl: Para finalizar a configuración da túa conta en %(site_name)s, necesitamos configurar o teu contrasinal. Fai clic na seguinte ligazón e sigue as instrucións.
ru: Для завершения настройки вашей учётной записи на %(site_name)s нам необходимо установить ваш пароль. Нажмите ссылку ниже и следуйте инструкциям.
ta: உங்கள் கணக்கு உள்ளமைவை %(site_name)s இல் இறுதி செய்ய, நாங்கள் உங்கள் கடவுச்சொல்லை அமைக்க வேண்டும். கீழேயுள்ள இணைப்பைக் சொடுக்கு செய்து வழிமுறைகளைப் பின்பற்றவும்.

source: Account creation
de: Erstellung eines Kontos
es: Crear cuenta
fr: Création de compte
gl: Creación de conta
ru: Создание учётной записи
ta: கணக்கு உருவாக்கம்

source: You have been invited to create an account at %(site_name)s. To proceed you can click on the "Create my account" button below and follow the instructions.
de: Sie wurden eingeladen, ein Konto bei %(site_name)s zu erstellen. Um fortzufahren, können Sie auf die Schaltfläche "Mein Konto erstellen" klicken und den Anweisungen folgen.
es: Has sido invitado a crear una cuenta en %(site_name)s. Para continuar, haz clic en el botón "Crear mi cuenta" que aparece a continuación y sigue las instrucciones.
fr: Vous avez été invités à créer un compte sur %(site_name)s. Pour continuer, vous pouvez cliquer sur bouton « Créer mon compte » et suivre les instructions.
gl: Fuches convidado a crear unha conta en %(site_name)s. Para continuar, podes facer clic no botón "Crear a miña conta" a continuación e seguir as instrucións.
ru: Вам предложено создать учётную запись на %(site_name)s. Чтобы продолжить, нажмите кнопку «Создать учётную запись» ниже и следуйте инструкциям.
ta: %(site_name)s இல் ஒரு கணக்கை உருவாக்க நீங்கள் அழைக்கப்பட்டுள்ளீர்கள். தொடர நீங்கள் கீழே உள்ள "எனது கணக்கை உருவாக்கு" பொத்தானைக் சொடுக்கு செய்து வழிமுறைகளைப் பின்பற்றலாம்.

source: Create my account
de: Mein Konto erstellen
es: Crear mi cuenta
fr: Création de mon compte
gl: Crear a miña conta
ru: Создать мою учётную запись
ta: எனது கணக்கை உருவாக்கவும்

source: You have been invited to create an account at %(site_name)s. To proceed you can click on the link below and follow the instructions.
de: Sie wurden eingeladen, ein Konto bei %(site_name)s zu erstellen. Um fortzufahren, klicken Sie bitte auf den unten stehenden Link und folgen Sie den Anweisungen.
es: Has sido invitado a crear una cuenta en %(site_name)s. Para continuar, haz clic en el enlace a continuación y sigue las instrucciones.
fr: Vous avez été invités à créer un compte sur %(site_name)s. Pour continuer, vous pouvez cliquer sur le lien ci-dessous et suivre les instructions.
gl: Fuches convidado a crear unha conta en %(site_name)s. Para continuar, podes facer clic na seguinte ligazón e seguir as instrucións.
ru: Вам предложено создать учётную запись на %(site_name)s. Чтобы продолжить, нажмите ссылку ниже и следуйте инструкциям.
ta: %(site_name)s இல் ஒரு கணக்கை உருவாக்க நீங்கள் அழைக்கப்பட்டுள்ளீர்கள். தொடர நீங்கள் கீழேயுள்ள இணைப்பைக் சொடுக்கு செய்து வழிமுறைகளைப் பின்பற்றலாம்.

source: You've started the registration process at %(site_name)s. To proceed you can click on the "Continue account creation" button below and follow the instructions.
de: Sie haben den Registrierungsprozess bei %(site_name)s begonnen. Um fortzufahren, können Sie auf die Schaltfläche "Kontoerstellung fortsetzen" klicken und den Anweisungen folgen.
es: Has iniciado el proceso de registro en %(site_name)s. Para continuar, puedes hacer clic en el botón "Continuar creando una cuenta" que aparece a continuación y seguir los pasos.
fr: Vous avez commencé votre inscription sur %(site_name)s. Pour continuer, vous pouvez cliquer sur le bouton ci-dessous et suivre les instructions.
ru: Вы начали процесс регистрации на %(site_name)s. Чтобы продолжить, нажмите кнопку «Продолжить создание учётной записи» ниже и следуйте инструкциям.
ta: நீங்கள் பதிவு செயல்முறையை %(site_name)s இல் தொடங்கினீர்கள். தொடர நீங்கள் கீழே உள்ள "கணக்கு உருவாக்கத்தைத் தொடரவும்" பொத்தானைக் சொடுக்கு செய்து வழிமுறைகளைப் பின்பற்றலாம்.

source: Continue account creation
de: Kontoerstellung fortsetzen
es: Continuar creando una cuenta
fr: Poursuivre l’inscription
ru: Продолжить создание учётной записи
ta: கணக்கு உருவாக்கத்தைத் தொடரவும்

source: You've started the registration process at %(site_name)s. To proceed you can click on the link below and follow the instructions.
de: Sie haben den Registrierungsprozess bei %(site_name)s gestartet. Um fortzufahren, klicken Sie bitte auf den unten stehenden Link und folgen Sie den Anweisungen.
es: Has iniciado el proceso de registro en %(site_name)s. Para continuar, puedes hacer clic en el siguiente enlace y seguir las instrucciones.
fr: Vous avez commencé à vous inscrire sur %(site_name)s. Pour continuer, vous pouvez cliquer sur le lien ci-dessous et suivre les instructions.
ru: Вы начали процесс регистрации на %(site_name)s. Чтобы продолжить, нажмите ссылку ниже и следуйте инструкциям.
ta: நீங்கள் பதிவு செயல்முறையை %(site_name)s இல் தொடங்கினீர்கள். தொடர நீங்கள் கீழேயுள்ள இணைப்பைக் சொடுக்கு செய்து வழிமுறைகளைப் பின்பற்றலாம்.

source: Someone, probably you, asked for a password reinitialization at %(site_name)s. If you did not ask for this email, please ignore it. If you need to reset your password, please enter the code below at %(site_name)s.
fr: Quelqu'un, probablement vous, a demandé un code de réinitialisation de votre mot de passe pour le site %(site_name)s. Si vous n'êtes pas à l'origine de ce message, veuillez l'ignorer. Si vous voulez réinitialiser votre mot de passe, veuillez entrer le code ci-dessous sur %(site_name)s.
ru: Кто-то, вероятно, вы, запросил повторную инициализацию пароля на %(site_name)s. Если вы не запрашивали это письмо, проигнорируйте его. Если вам нужно сбросить пароль, введите код ниже на %(site_name)s.

source: Your code
fr: Votre code
ru: Ваш код

source: Someone, probably you, asked for a password reinitialization link at %(site_name)s. If you did not ask for this email, please ignore it. If you need to reset your password, please click on the "Reset password" button below and follow the instructions.
de: Jemand, wahrscheinlich Sie, hat um einen Link zur Neuinitialisierung des Passworts bei %(site_name)s gebeten. Wenn Sie diese E-Mail nicht angefordert haben, ignorieren Sie sie bitte. Wenn Sie Ihr Passwort zurücksetzen müssen, klicken Sie bitte auf die Schaltfläche "Passwort zurücksetzen" unten und folgen Sie den Anweisungen.
es: Alguien, probablemente tú, solicitó un enlace para restablecer la contraseña en %(site_name)s. Si no has solicitado este email, por favor ignóralo. Si necesitas restablecer tu contraseña, haz clic en el botón "Restablecer contraseña" que aparece a continuación y sigue las instrucciones.
fr: Quelqu'un, probablement vous, a demandé un lien de réinitialisation de votre mot de passe pour le site %(site_name)s. Si vous n'êtes pas à l'origine de ce message, veuillez l'ignorer. Si vous voulez réinitialiser votre mot de passe, veuillez cliquer sur le lien ci-dessous, et suivre les instructions qui vous seront soumises.
gl: Alguén, probablemente ti, pediu unha ligazón de reinicialización do contrasinal en %(site_name)s. Se non pediches este correo electrónico, ignórao. Se precisas restablecer o teu contrasinal, fai clic no botón "Restablecer contrasinal" a continuación e sigue as instrucións.
ru: Кто-то, возможно вы, попросил ссылку на сброс пароля на %(site_name)s. Если это не вы запросили то пожалуйста просто проигнорируйте это письмо. Если вам нужно сбросить пароль, нажмите на кнопку «Сброс пароля» ниже и следуйте инструкциям.
ta: யாரோ, அநேகமாக நீங்கள், கடவுச்சொல் மறுசீரமைப்பு இணைப்பை %(site_name)s இல் கேட்டீர்கள். இந்த மின்னஞ்சலை நீங்கள் கேட்கவில்லை என்றால், தயவுசெய்து அதை புறக்கணிக்கவும். உங்கள் கடவுச்சொல்லை மீட்டமைக்க வேண்டும் என்றால், கீழே உள்ள "கடவுச்சொல்லை மீட்டமை" பொத்தானைக் சொடுக்கு செய்து வழிமுறைகளைப் பின்பற்றவும்.

source: Reset password
de: Passwort zurücksetzen
es: Restablecer contraseña
fr: Réinitialiser votre mot de passe
gl: Restablecer contrasinal
ru: Сброс пароля
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

source: This email is a test to check that you receive communications from %(site_name)s.
de: Diese E-Mail ist ein Test, um zu prüfen, ob Sie Mitteilungen von %(site_name)s erhalten.
es: Este correo electrónico es una prueba para comprobar que recibes comunicaciones de %(site_name)s.
fr: Ce courriel est une vérification que vous recevez les communications du site %(site_name)s.
gl: Este correo electrónico é unha proba para comprobar que recibes comunicacións desde %(site_name)s.
ru: Это письмо — проверка получения сообщений от %(site_name)s.
ta: இந்த மின்னஞ்சல் %(site_name)s இலிருந்து தகவல்தொடர்புகளைப் பெறுகிறீர்களா என்பதைச் சரிபார்க்க ஒரு சோதனை.

source: Account deletion
de: Löschung des Kontos
es: Eliminar cuenta
fr: Suppression d'un compte
gl: Eliminar conta
ru: Удаление учётной записи
ta: கணக்கு நீக்குதல்

source: Are you sure you want to delete the account of %(user_name)s? This action is unrevokable and all the data about this user will be removed.
de: Sind Sie sicher, dass Sie das Konto von %(user_name)s löschen wollen? Diese Aktion ist nicht widerrufbar und alle Daten dieses Benutzers werden gelöscht.
es: ¿Estás seguro de que deseas eliminar la cuenta de %(user_name)s? Esta acción es irrevocable y se eliminarán todos los datos sobre este usuario.
fr: Êtes-vous sûrs de vouloir supprimer le compte de %(user_name)s ? Cette action est irrévocable, et toutes les données de cet utilisateur seront supprimées.
ru: Вы уверены, что хотите удалить учётную запись %(user_name)s? Это действие неотменяемо, и все данные об этом пользователе будут удалены.
ta: %(user_name)s இன் கணக்கை நீக்க விரும்புகிறீர்களா? இந்த செயல் மறுபரிசீலனை செய்ய முடியாதது மற்றும் இந்த பயனரைப் பற்றிய அனைத்து தரவுகளும் அகற்றப்படும்.

source: Are you sure you want to delete your account? This action is unrevokable and all your data will be removed forever.
de: Sind Sie sicher, dass Sie Ihr Konto löschen möchten? Diese Aktion ist nicht widerrufbar und alle Ihre Daten werden für immer gelöscht.
es: ¿Seguro que deseas eliminar tu cuenta? Esta acción es irrevocable y se eliminarán todos tus datos para siempre.
fr: Êtes-vous sûrs de vouloir supprimer votre compte ? Cette action est irrévocable et toutes vos données seront supprimées pour toujours.
gl: Seguro que queres eliminar este usuario? Esta acción non se pode desfacer e todos os datos deste usuario serán eliminados.
ru: Вы уверены, что хотите удалить свою учётную запись? Это действие неотменяемо, и все ваши данные будут удалены навсегда.
ta: உங்கள் கணக்கை நீக்க விரும்புகிறீர்களா? இந்த நடவடிக்கை மாற்ற முடியாதது மற்றும் உங்கள் எல்லா தரவுகளும் எப்போதும் அகற்றப்படும்.

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
gl: Cancelar
ru: Отмена
ta: ரத்துசெய்

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
gl: Eliminar
ru: Удалить
ta: நீக்கு

source: Group deletion
de: Löschung der Gruppe
es: Eliminar grupo
fr: Suppression d'un groupe
gl: Eliminar grupo
ru: Удаление группы
ta: குழு நீக்குதல்

source: Are you sure you want to delete the group "%(group_name)s"? This action is unrevokable and all the data about this group will be removed.
de: Sind Sie sicher, dass Sie die Gruppe "%(group_name)s" löschen wollen? Diese Aktion kann nicht rückgängig gemacht werden, und alle Daten zu dieser Gruppe werden gelöscht.
es: ¿Estás seguro de que deseas eliminar el grupo "%(group_name)s"? Esta acción es irrevocable y se eliminarán todos los datos sobre este grupo.
fr: Êtes-vous sûrs de vouloir supprimer le groupe « %(group_name)s » ? Cette action est irrévocable, et toutes les données de cet utilisateur seront supprimées.
ru: Вы уверены, что хотите удалить группу "%(group_name)s"? Это действие неотменяемо, и все данные об этой группе будут удалены.
ta: "%(group_name)s" குழுவை நீக்க விரும்புகிறீர்களா? இந்த நடவடிக்கை மறுபரிசீலனை செய்ய முடியாதது மற்றும் இந்த குழுவைப் பற்றிய அனைத்து தரவுகளும் அகற்றப்படும்.

source: Account locking
de: Konto sperren
es: Bloqueo de la cuenta
fr: Verrouillage du compte
ru: Блокировка учётной записи
ta: கணக்கு பூட்டுதல்

source: Are you sure you want to lock the account of %(user_name)s ? The user won't be able to login until their account is unlocked.
de: Sind Sie sicher, dass Sie das Konto von %(user_name)s sperren wollen? Der Benutzer kann sich erst anmelden, wenn sein Konto entsperrt ist.
es: ¿Estás seguro de que deseas bloquear la cuenta de %(user_name)s? El usuario no podrá iniciar sesión hasta que se desbloquee su cuenta.
fr: Êtes-vous sûrs de vouloir verrouiller le compte de %(user_name)s ? L’utilisateur ne pourra pas s’authentifier jusqu’à ce que son compte soit déverrouillé.
ru: Вы уверены, что хотите заблокировать учётную запись %(user_name)s? Пользователь не сможет войти в систему, пока его учётная запись не будет разблокирована.
ta: %(user_name)s கணக்கை பூட்ட விரும்புகிறீர்களா? பயனர் தங்கள் கணக்கு திறக்கப்படும் வரை உள்நுழைய முடியாது.

source: Are you sure you want to lock your account? You won't be able to login until your account is unlocked.
de: Sind Sie sicher, dass Sie Ihr Konto sperren möchten? Sie können sich erst wieder anmelden, wenn Ihr Konto entsperrt ist.
es: ¿Estás seguro de que deseas bloquear tu cuenta? No podrás iniciar sesión hasta que tu cuenta sea desbloqueada.
fr: Êtes-vous sûrs de vouloir verrouiller votre compte ? Vous ne pourrez plus vous authentifier jusqu’à ce que votre compte soit déverrouillé.
ru: Вы уверены, что хотите заблокировать свою учётную запись? Вы не сможете войти в систему, пока ваша учётная запись не будет разблокирована.
ta: உங்கள் கணக்கை பூட்ட விரும்புகிறீர்களா? உங்கள் கணக்கு திறக்கப்படும் வரை நீங்கள் உள்நுழைய முடியாது.

source: Lock
de: Sperren
es: Bloquear
fr: Verrouiller
ru: Заблокировать
ta: பூட்டு

source: Group member deletion
de: Löschen von Gruppenmitgliedern
es: Eliminación de miembros del grupo
fr: Retrait d’un membre du groupe
ru: Удаление участника группы
ta: குழு உறுப்பினர் நீக்குதல்

source: Are you sure you want to remove %(user_name)s from the group "%(group_name)s"?
de: Sind Sie sicher, dass Sie %(user_name)s aus der Gruppe "%(group_name)s" entfernen wollen?
es: ¿Estás seguro de que deseas eliminar %(user_name)s del grupo "%(group_name)s"?
fr: Confirmez-vous vouloir retirer %(user_name)s du groupe "%(group_name)s" ?
ru: Вы уверены, что хотите удалить %(user_name)s из группы "%(group_name)s"?
ta: " %(user_name)s குழுவிலிருந்து %(group_name)s அகற்ற விரும்புகிறீர்களா?

source: Remove
de: Entfernen
es: Quitar
fr: Retirer
ru: Удалить
ta: அகற்று

source: One-time passcode authentication reset
ru: Сброс аутентификации по одноразовому паролю

source: Are you sure you want to reset one-time passcode (OTP) authentication for %(user_name)s ? The user will have to perform OTP setup again at next login.
ru: Вы уверены, что хотите сбросить аутентификацию с одноразовым паролем (OTP) для %(user_name)s? Пользователю потребуется заново настроить OTP при следующем входе в систему.

source: Are you sure you want to reset one-time passcode (OTP) authentication? You will have to perform OTP setup again at next login.
ru: Вы уверены, что хотите сбросить аутентификацию с одноразовым паролем (OTP)? Вам потребуется заново настроить OTP при следующем входе в систему.

source: Reset one-time passcode authentication
ru: Сброс аутентификации одноразовым кодом

source: Send a verification email to validate this address.
de: Bestätigungs-E-Mail senden, um diese Adresse zu bestätigen.
es: Enviar un correo electrónico de verificación para validar esta dirección.
fr: Envoyer un courriel de confirmation à cette adresse.
ru: Отправьте письмо с подтверждением для подтверждения этого адреса.
ta: இந்த முகவரியை சரிபார்க்க சரிபார்ப்பு மின்னஞ்சலை அனுப்பவும்.

source: Actions
de: Aktionen
es: Acciones
ru: Действия
ta: செயல்கள்

source: This account is locked
de: Dieses Konto ist gesperrt
es: Esta cuenta está bloqueada
fr: Ce compte est verrouillé
ru: Эта учётная запись заблокирована
ta: இந்த கணக்கு பூட்டப்பட்டுள்ளது

source: Groups must have at least one member
de: Gruppen müssen mindestens ein Mitglied haben
es: Los grupos deben tener al menos un miembro
fr: Les groupes doivent avoir au moins un membre
ru: В группах должен быть хотя бы один участник
ta: குழுக்களுக்கு குறைந்தது ஒரு உறுப்பினராவது இருக்க வேண்டும்

source: No item matches your request
de: Kein Eintrag entspricht Ihrer Anfrage
es: Ningún elemento coincide con tu solicitud
fr: Aucun élément ne correspond à votre requête
ru: Ни один элемент не соответствует вашему запросу
ta: உங்கள் கோரிக்கையுடன் எந்த பொருளும் பொருந்தவில்லை

source: Maybe try with different criteria?
es: ¿Quizás intentarlo con criterios diferentes?
fr: Essayez peut-être avec des critères différents ?
ru: Возможно, попробуйте другие критерии?
ta: வெவ்வேறு அளவுகோல்களுடன் முயற்சி செய்யலாம்?

source: There is nothing here
de: Es gibt hier nichts
es: No hay nada aquí
fr: Il n'y a rien ici
ru: Здесь ничего нет
ta: இங்கே எதுவும் இல்லை

source: Number of members
de: Anzahl der Mitglieder
es: Número de miembros
fr: Nombre de membres
gl: Número de membros
ru: Количество участников
ta: உறுப்பினர்களின் எண்ணிக்கை

source: Here is the one-time passcode you requested for %(website_name)s: %(otp)s
ru: Вот одноразовый код доступа, который вы запросили для %(website_name)s: %(otp)s

source: This field is not editable
de: Dieses Feld ist nicht editierbar
es: Este campo no es editable
fr: Ce champ n'est pas modifiable
gl: Este campo non é editable
ru: Это поле недоступно для редактирования
ta: இந்த புலம் திருத்தக்கூடியது அல்ல

source: This field is required
de: Dieses Feld ist erforderlich
es: Este campo es obligatorio
fr: Ce champ est requis
gl: Este campo é obrigatorio
ru: Это поле обязательно для заполнения
ta: இந்த புலம் தேவை

source: Remove this field
de: Dieses Feld entfernen
es: Eliminar este campo
fr: Supprimer ce champ
ru: Удалить это поле
ta: இந்த புலத்தை அகற்று

source: Add another field
de: Weiteres Feld hinzufügen
es: Agregar otro campo
fr: Ajouter un autre champ
ru: Добавить ещё одно поле
ta: மற்றொரு புலத்தைச் சேர்க்கவும்

source: Password strength
es: Seguridad de la contraseña
fr: Robustesse du mot de passe
ru: Сила пароля
ta: கடவுச்சொல் வலிமை

source: Search…
de: Suche…
es: Buscar…
fr: Recherche…
ru: Поиск…
ta: தேடுங்கள்…

source: Search
de: Suche
es: Buscar
fr: Rechercher
ru: Поиск
ta: தேடல்

source: Page
de: Seite
es: Página
ru: Страница
ta: பக்கம்

source: %(nb_items_formatted)s item
de: %(nb_items_formatted)s Eintrag
es: %(nb_items_formatted)s elemento
fr: %(nb_items_formatted)s élément
ru: %(nb_items_formatted)s элемент
ta: %(nb_items_formatted)s உருப்படி

source: View an authorization
de: Ansicht einer Genehmigung
es: Ver una autorización
fr: Voir une autorisation
gl: Ver unha autorización
ru: Просмотр авторизации
ta: அங்கீகாரத்தைக் காண்க

source: The application %(name)s is requesting access to:
de: Die Anwendung %(name)s bittet um Zugang zu:
es: La aplicación %(name)s está solicitando acceso a:
fr: L'application %(name)s demande un accès à :
gl: A aplicación %(name)s está solicitando acceso a:
ru: Приложение %(name)s запрашивает доступ к:
ta: பயன்பாடு %(name)s அணுகலைக் கோருகின்றன:

source: The application %(application_name)s does not allow user authentication.
fr: L'application %(application_name)s ne permet pas l'authentification des utilisateurs.
ru: Приложение %(application_name)s не позволяет аутентификацию пользователя.

source: You are logged in as %(name)s
de: Sie sind eingeloggt als %(name)s
es: Ha iniciado sesión como %(name)s
fr: Vous êtes identifiés en tant que %(name)s
gl: Iniciaches sesión como %(name)s
ru: Вы вошли в систему как %(name)s
ta: நீங்கள் %(name)s என உள்நுழைந்துள்ளீர்கள்

source: Read %(application_name)s's Privacy Policy :
fr: Lire la politique de confidentialité de %(application_name)s :
ru: Ознакомьтесь с Соглашением о конфиденциальности %(application_name)s :

source: Policy
de: Regel
es: Política
fr: Politique de confidentialité
gl: Política
ru: Соглашение
ta: கொள்கை

source: Read %(application_name)s's Terms of Service :
fr: Lire les conditions d'utilisation de %(application_name)s :
ru: Ознакомьтесь с Условиями обслуживания %(application_name)s :

source: Terms of service
de: Nutzungsbedingungen
es: Condiciones del servicio
fr: Conditions d'utilisation
gl: Condicións do servizo
ru: Условия обслуживания
ta: பணி விதிமுறைகள்

source: Deny
de: Verweigern
es: Denegar
fr: Refuser
gl: Denegar
ru: Запретить
ta: மறுக்கவும்

source: Switch user
de: Benutzer wechseln
es: Cambiar usuario
fr: Changer d'utilisateur
gl: Cambiar de usuario
ru: Сменить пользователя
ta: பயனரை மாற்றவும்

source: Accept
de: Akzeptieren
es: Aceptar
fr: Accepter
gl: Aceptar
ru: Принять
ta: ஏற்றுக்கொள்

source: Add an application
fr: Ajouter une application
ru: Добавить приложение

source: Create
de: Anlegen
es: Crear
fr: Créer
ru: Создать
ta: உருவாக்கு

source: Edit an application
fr: Éditer une application
ru: Изменить приложение

source: Secret
de: Geheimnis
es: Clave
gl: Clave
ru: Секрет
ta: மறைபொருள்

source: Issued at
de: Ausgestellt am
es: Emitido en
fr: Créé le
gl: Emitido en
ru: Дата выпуска
ta: வழங்கப்பட்டது

source: New token
es: Nuevo token
fr: Nouveau jeton
ru: Новый токен
ta: புதிய கிள்ளாக்கு

source: Delete the client
de: Client entfernen
es: Eliminar el cliente
fr: Supprimer le client
gl: Eliminar o cliente
ru: Удалить клиент
ta: கிளையண்டை நீக்கு

source: My consents
de: Meine Zustimmungen
es: Mis consentimientos
fr: Mes autorisations
gl: Os meus consentimentos
ru: Мои согласия
ta: எனது ஒப்புதல்கள்

source: Pre-authorized applications
de: Vorautorisierte Applikationen
es: Solicitudes previamente autorizadas
fr: Applications pré-autorisées
gl: Aplicacións preautorizadas
ru: Преавторизованные приложения
ta: முன் அங்கீகரிக்கப்பட்ட பயன்பாடுகள்

source: Consult and revoke the authorization you gave to websites.
de: Prüfen und widerrufen Sie die Genehmigung, die Sie den Webseiten erteilt haben.
es: Consultar y revocar autorizaciones dadas a sitios web.
fr: Consultez et révoquez les autorisation que vous avez données.
gl: Consulta e revoga as autorizacións que deches a sitios web.
ru: Проверить и отозвать предоставленные вами разрешений веб-сайтам.
ta: வலைத்தளங்களுக்கு நீங்கள் கொடுத்த அங்கீகாரத்தை அணுகவும் ரத்து செய்யவும்.

source: From:
de: Von:
es: De:
fr: À partir de :
gl: De:
ru: От:
ta: இருந்து:

source: Revoked:
de: Widerrufen:
es: Revocado:
fr: Révoqué le :
gl: Revogado:
ru: Отозвано:
ta: ரத்து செய்யப்பட்டது:

source: Had access to:
de: Hatte Zugang zu:
es: Tenía acceso a:
fr: Avait accès à :
gl: Tiña acceso a:
ru: Имел доступ к:
ta: இதற்கு அணுகல் இருந்தது:

source: Has access to:
de: Hat Zugang zu:
es: Tiene acceso a:
fr: A accès à :
gl: Ten acceso a:
ru: Имеет доступ к:
ta: இதற்கு அணுகல் உள்ளது:

source: Restore access
de: Zugang wiederherstellen
es: Restaurar el acceso
fr: Restaurer l'accès
gl: Restaurar acceso
ru: Восстановить доступ
ta: அணுகலை மீட்டெடுங்கள்

source: Revoke access
de: Zugang widerrufen
es: Revocar el acceso
fr: Révoquer l'accès
gl: Revogar acceso
ru: Отозвать доступ
ta: அணுகலைத் திரும்பப் பெறுங்கள்
