Repository: yaal-coop/canaille
Catalog: canaille/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, gl, ru, ta

source: Created on %(creation_datetime)s
de: Erstellt am %(creation_datetime)s
es: Creado el %(creation_datetime)s
fr: Créé le %(creation_datetime)s
ru: Создано %(creation_datetime)s
ta: %(creation_datetime)s

source: You can change your password here by typing it once it each fields below. The more a password is long, the more it is strong. A good password is a long password that you will remember, not a complicated password that your use for all your accounts.
de: Sie können Ihr Passwort hier ändern, indem Sie es einmal in jedes der unten stehenden Felder eingeben. Je länger ein Passwort ist, desto sicherer ist es. Ein gutes Passwort ist ein langes Passwort, das Sie sich merken können, und kein kompliziertes Passwort, das Sie für alle Ihre Konten verwenden.
es: Puedes cambiar tu contraseña aquí escribiéndola una vez en cada uno de los campos a continuación. Cuanto más larga es una contraseña, más fuerte es. Una buena contraseña es una contraseña larga que puedas recordar, no una contraseña complicada que utilices para todas tus cuentas.
fr: Vous pouvez choisir un nouveau mot de passe en l'écrivant dans chacun des champs ci-dessous. Les mots de passe les plus longs sont les plus forts. Un bon mot de passe est un mot de passe long dont vous vous souviendrez, pas un mot de passe compliqué que vous utilisez pour tous vos comptes.
ru: Вы можете изменить свой пароль здесь, введя его один раз в каждое поле ниже. Чем длиннее пароль, тем он надёжнее. Хороший пароль — это длинный пароль, который вы легко запомните, а не сложный пароль, который вы используете для всех своих учётных записей.
ta: உங்கள் கடவுச்சொல்லை கீழே உள்ள ஒவ்வொரு புலங்களுக்கும் தட்டச்சு செய்வதன் மூலம் இங்கே மாற்றலாம். கடவுச்சொல் அதிகமாக இருப்பதால், அது வலுவாக இருக்கும். ஒரு நல்ல கடவுச்சொல் என்பது நீங்கள் நினைவில் வைத்திருக்கும் நீண்ட கடவுச்சொல், உங்கள் எல்லா கணக்குகளுக்கும் உங்கள் பயன்பாடு சிக்கலான கடவுச்சொல் அல்ல.

source: Send mail
de: E-Mail senden
es: Enviar correo electrónico
fr: Envoyer le courriel
gl: Enviar email
ru: Отправить письмо
ta: அஞ்சல் அனுப்பவும்

source: This user does not have a password yet
de: Dieser Benutzer hat noch kein Passwort
es: El usuario todavía no tiene una contraseña
fr: L'utilisateur n'a pas encore de mot de passe
gl: Este usuario aínda non ten contrasinal
ru: У этого пользователя ещё нет пароля
ta: இந்த பயனருக்கு இன்னும் கடவுச்சொல் இல்லை

source: You can solve this by:
de: Sie können dieses Problem lösen, indem Sie:
es: Puedes solucionar esto:
fr: Vous pouvez régler ceci en :
gl: Para solucionalo:
ru: Вы можете решить это путём:
ta: இதை நீங்கள் தீர்க்கலாம்:

source: setting a password using this form;
de: ein Passwort mit diesem Formular setzen;
es: establece una contraseña usando este formulario;
fr: renseignant un mot de passe via ce formulaire ;
gl: establece un contrasinal usando este formulario;
ru: установление пароля с использованием этой формы;
ta: இந்த படிவத்தைப் பயன்படுத்தி கடவுச்சொல்லை அமைத்தல்;

source: sending the user a password initialization mail, by clicking this button;
de: dem Benutzer eine E-Mail zur Initialisierung des Passworts senden, indem Sie auf diese Schaltfläche klicken;
es: enviar un correo electrónico de inicialización de contraseña al usuario haciendo clic en este botón;
fr: envoyant un lien d'initialisation de mot de passe, par courriel à l'utilisateur, en cliquant sur ce bouton ;
gl: envía un email de inicialización de contrasinal ó usuario premendo neste botón;
ru: Отправить пользователю письмо с инициализацией пароля, нажав эту кнопку;
ta: இந்த பொத்தானைக் சொடுக்கு செய்வதன் மூலம் பயனருக்கு கடவுச்சொல் துவக்க அஞ்சலை அனுப்புகிறது;

source: or simply waiting for the user to sign-in a first time, and then receive a password initialization mail.
de: oder einfach darauf warten, dass sich der Benutzer zum ersten Mal anmeldet und dann eine E-Mail zur Kennwortinitialisierung erhält.
es: o simplemente esperar a que el usuario inicie sesión por primera vez y entonces recibirá un correo electrónico de inicialización de contraseña.
fr: ou simplement en attendant la première connexion de l'utilisateur, afin qu'il reçoive un lien d'initialisation de mot de passe par courriel.
gl: ou simplemente esperando a que o usuario inicie sesión por primeira vez e entón recibirá un correo de inicialización do contrasinal.
ru: или просто дождаться первого входа пользователя в систему и получить письмо с инициализацией пароля.
ta: அல்லது பயனர் முதல் முறையாக உள்நுழைய காத்திருக்கிறார், பின்னர் கடவுச்சொல் துவக்க அஞ்சலைப் பெறுங்கள்.

source: The user will not be able to authenticate unless the password is set
de: Der Benutzer kann sich nur dann authentifizieren, wenn das Kennwort festgelegt wurde
es: El usuario no podrá iniciar sesión a menos que se establezca una contraseña
fr: L'utilisateur ne pourra pas se connecter tant que son mot de passe n'est pas défini
gl: O usuario non poderá iniciar sesión a menos que se estableza o contrasinal
ru: Пользователь не сможет пройти аутентификацию, пока не установлен пароль
ta: கடவுச்சொல் அமைக்கப்படாவிட்டால் பயனரால் அங்கீகரிக்க முடியாது

source: Password reset
de: Passwort zurücksetzen
es: Restablecer contraseña
fr: Réinitialisation du mot de passe
gl: Restablecer contrasinal
ru: Сброс пароля
ta: கடவுச்சொல் மீட்டமைப்பு

source: If the user has forgotten his password, you can send him a password reset email by clicking this button.
de: Wenn der Benutzer sein Passwort vergessen hat, können Sie ihm eine E-Mail zum Zurücksetzen des Passworts senden, indem Sie auf diese Schaltfläche klicken.
es: Si el usuario ha olvidado su contraseña, puedes enviarle un correo electrónico para restablecerla haciendo clic en este botón.
fr: Si l'utilisateur a oublié son mot de passe, vous pouvez lui envoyer un courriel contenant un lien de réinitialisation en cliquant sur ce bouton.
gl: Se o usuario esqueceu o seu contrasinal, podes enviarlle un correo electrónico para restablecer o contrasinal premendo neste botón.
ru: Если пользователь забыл пароль, вы можете отправить ему письмо с информацией о сбросе пароля, нажав эту кнопку.
ta: பயனர் தனது கடவுச்சொல்லை மறந்துவிட்டால், இந்த பொத்தானைக் சொடுக்கு செய்வதன் மூலம் கடவுச்சொல் மீட்டமைப்பு மின்னஞ்சலை அவருக்கு அனுப்பலாம்.

source: Unlock
de: Entsperren
es: Desbloquear
fr: Déverrouiller
ru: Разблокировать
ta: திறக்க

source: This user account is locked
de: Dieses Benutzerkonto ist gesperrt
es: Esta cuenta de usuario está bloqueada
fr: Ce compte utilisateur est verrouillé
ru: Эта учётная запись пользователя заблокирована
ta: இந்த பயனர் கணக்கு பூட்டப்பட்டுள்ளது

source: The user won't be able to connect until their account is unlocked.
de: Der Nutzer kann erst dann eine Verbindung herstellen, wenn sein Konto freigeschaltet ist.
es: El usuario no podrá conectarse hasta que la cuenta esté desbloqueada.
fr: L'utilisateur ne pourra pas se connecter tant que son compte n’est pas déverrouillé.
ru: Пользователь не сможет подключиться, пока его учётная запись не будет разблокирована.
ta: பயனர் தங்கள் கணக்கு திறக்கப்படும் வரை இணைக்க முடியாது.

source: Reset authenticator application configuration
ru: Сброс конфигурации приложения аутентификатора

source: Lock the account
de: Konto sperren
es: Bloquear la cuenta
fr: Verrouiller le compte
ru: Заблокировать учётную запись
ta: கணக்கைப் பூட்டவும்

source: Delete the user
de: Benutzer löschen
es: Eliminar usuario
fr: Supprimer l'utilisateur
gl: Eliminar usuario
ru: Удалить пользователя
ta: பயனரை நீக்கு

source: Delete my account
de: Mein Konto löschen
es: Eliminar mi cuenta
fr: Supprimer mon compte
gl: Eliminar a miña conta
ru: Удалить мою учётную запись
ta: எனது கணக்கை நீக்கு

source: Impersonate
de: Imitieren
es: Suplantar
fr: Prendre l'identité
gl: Suplantar
ru: Войти как
ta: ஆள்மாறாட்டம்

source: Set up multi-factor authentication.
es: Configurar autenticación multifactor.
fr: Mettre en place l'authentification multi-facteurs.
ru: Настроить многоэтапную аутентификацию.

source: Authenticator application configuration
ru: Конфигурация приложения аутентификатора

source: You need to install an authenticator application to generate one-time passcodes for %(website_name)s.
ru: Вам необходимо установить приложение-аутентификатор для генерации одноразовых кодов доступа для %(website_name)s.

source: Then, configure the authenticator application with one of the following methods:
ru: Затем настройте приложение аутентификации одним из следующих способов:

source: 1 - Automatic configuration
ru: 1 - Автоматическая настройка

source: If the authenticator application is installed on the device that you are currently using, you can configure it by clicking on this button:
ru: Если приложение аутентификации установлено на устройстве, которое вы используете в данный момент, вы можете настроить его, нажав эту кнопку:

source: Open authenticator application
ru: Откройте приложения аутентификатора

source: 2 - QR Code scanning
ru: 2 - Сканирование QR-кода

source: If the previous button did not work or if your authenticator application is installed on another device, please open it and use it to scan the following qrcode:
ru: Если предыдущая кнопка не сработала или ваше приложение аутентификации установлено на другом устройстве, откройте его и отсканируйте следующий QR-код:

source: Secret token
ru: Секретный токен

source: 3 - Secret token
ru: 3 - Секретный токен

source: If your device cannot scan images, you can configure your authenticator application by manually copying this secret token:
ru: Если ваше устройство не может сканировать изображения, вы можете настроить приложение аутентификации, вручную скопировав этот секретный токен:

source: Copy secret
ru: Копировать секрет

source: Passcode confirmation
ru: Подтвердите одноразовым кодом доступа

source: Once your authenticator application is correctly configured, you need to generate a one-time passcode and fill it in the following page.
ru: После того, как приложение аутентификации будет правильно настроено, вам необходимо сгенерировать одноразовый код доступа и ввести его на следующей странице.

source: When you are ready, please click on the following button:
ru: Когда будете готовы, нажмите следующую кнопку:

source: Next step
ru: Следующий шаг

source: One-time passcode authentication.
ru: Аутентификация одноразовым кодом.

source: Verify
de: Überprüfen
es: Comprobar
fr: Confirmer
ru: Проверить
ta: சரிபார்க்கவும்

source: Didn't receive the code? Click here to send another one.
ru: Не получили код? Нажмите здесь, чтобы отправить ещё один.

source: Emails
es: Correos electrónicos
fr: Courriels
ru: Список Email
ta: மின்னஞ்சல்கள்

source: Applications
ru: Приложения

source: Tokens
de: Token
fr: Jetons
ru: Токены
ta: டோக்கன்கள்

source: Codes
es: Códigos
gl: Códigos
ru: Коды
ta: குறியீடுகள்

source: Mail sending test
de: Test des Mailversands
es: Prueba de envío de correo electrónico
fr: Test d'envoi de courriel
gl: Proba de envío de correo
ru: Тест на отправку почты
ta: அஞ்சல் அனுப்பும் சோதனை

source: This form will send a dummy email to the address you want. This should be used for testing mail configuration.
de: Dieses Formular sendet eine Dummy-E-Mail an die von Ihnen gewünschte Adresse. Dies sollte zum Testen der E-Mail-Konfiguration verwendet werden.
es: Este formulario enviará un correo electrónico ficticio a la dirección que desee. Debería utilizarse para probar la configuración del correo.
fr: Ce formulaire enverra un courriel factice à l'adresse que vous indiquerez. À utiliser pour tester les configurations de courriel.
ru: Эта форма отправит фиктивное электронное письмо на указанный вами адрес. Его следует использовать для проверки конфигурации почты.
ta: இந்த படிவம் நீங்கள் விரும்பும் முகவரிக்கு போலி மின்னஞ்சலை அனுப்பும். அஞ்சல் உள்ளமைவை சோதிக்க இது பயன்படுத்தப்பட வேண்டும்.

source: No mail server has been configured. The mail sending test is disabled.
es: No se ha configurado ningún servidor de correo. La prueba de envío de correo electrónico está desactivada.
fr: Aucun serveur de messagerie n'a été configuré. L'envoi du courriel test est désactivé.
ru: Ни один почтовый сервер не был настроен. Тест на отправку почты невозможен.
ta: எந்த அஞ்சல் சேவையகமும் கட்டமைக்கப்படவில்லை. அஞ்சல் அனுப்பும் சோதனை முடக்கப்பட்டுள்ளது.

source: Email preview
de: E-Mail-Vorschau
es: Previsualización del correo electrónico
fr: Prévisualisation des courriels
gl: Previsualización do email
ru: Предпросмотр письма
ta: மின்னஞ்சல் முன்னோட்டம்

source: Connectivity test
de: Verbindungstest
es: Prueba de conectividad
fr: Test de connectivité
gl: Proba de conectividade
ru: Тест подключения
ta: இணைப்பு சோதனை

source: Password initialization
de: Passwort-Initialisierung
es: Inicialización de contraseña
fr: Initialisation du mot de passe
gl: Inicialización do contrasinal
ru: Инициализация пароля
ta: கடவுச்சொல் துவக்கம்

source: Email verification
de: E-Mail-Bestätigung
es: Verificación del correo electrónico
fr: Vérification de nouvelle adresse email
ru: Проверка электронной почты
ta: மின்னஞ்சல் சரிபார்ப்பு

source: Invitation
de: Einladung
es: Invitación
gl: Invitación
ru: Приглашение
ta: அழைப்பு

source: Registration
de: Registrierung
es: Registro
fr: Inscription
ru: Регистрация
ta: பதிவு

source: Compromised password check failure
es: Fallo de comprobación de contraseña comprometida
fr: Échec de la vérification de la compromission du mot de passe
ru: Ошибка проверки пароля на компрометацию
ta: வேறுபாடின்மை செய்யப்பட்ட கடவுச்சொல் சோதனை தோல்வி

source: Email one-time passcode
ru: Отправить одноразовый код на Email

source: Our services were unable to verify if the %(user_name)s's password is compromised.
es: Nuestros servicios no fueron capaces de verificar si la contraseña de %(user_name)s está comprometida.
fr: Nos services n'ont pas pu vérifier si le mot de passe de %(user_name)s est compromis.
ru: Наши службы не смогли проверить, скомпрометирован ли пароль %(user_name)s.
ta: %(user_name)s இன் கடவுச்சொல் வேறுபாடின்மை செய்யப்பட்டதா என்பதை எங்கள் சேவைகளால் சரிபார்க்க முடியவில்லை.

source: You have to check manually if the new password of the user %(user_name)s is compromised.
es: Tienes que comprobar manualmente si la nueva contraseña del usuario %(user_name)s está comprometida.
fr: Vous devez vérifier manuellement si le nouveau mot de passe de l'utilisateur %(user_name)s est compromis.
ru: Вам необходимо вручную проверить, скомпрометирован ли новый пароль пользователя %(user_name)s.
ta: பயனரின் புதிய கடவுச்சொல் (பயனர்_பெயர்) கள் வேறுபாடின்மை செய்யப்பட்டால் நீங்கள் கைமுறையாக சரிபார்க்க வேண்டும்.

source: Follow this steps :
es: Sigue estos pasos:
fr: Suivez ces étapes :
ru: Следуйте этим шагам:
ta: இந்த படிகளைப் பின்பற்றவும்:

source: 1. click on the link above "Check if password is compromised".
es: 1. Haz clic en el enlace anterior "Comprobar si la contraseña está comprometida".
fr: 1. Cliquez sur le lien ci-dessus « Vérifier si le mot de passe est compromis ».
ru: 1. Нажмите на ссылку выше «Проверить, скомпрометирован ли пароль».
ta: 1. மேலே உள்ள இணைப்பைக் சொடுக்கு செய்க "கடவுச்சொல் வேறுபாடின்மை செய்யப்பட்டதா என்பதை சரிபார்க்கவும்".

source: Check if password is compromised
es: Comprobar si la contraseña está comprometida
fr: Vérifier si le mot de passe est compromis
ru: Проверьте, скомпрометирован ли пароль
ta: கடவுச்சொல் வேறுபாடின்மை செய்யப்பட்டதா என்று சரிபார்க்கவும்

source: 2. in the page that will open, search the following hashed password in the page : %(hashed_password)s
es: 2. En la página que se abrirá, busca la siguiente contraseña cifrada en la página: %(hashed_password)s
fr: 2. Dans la page qui s'ouvre, recherchez le mot de passe haché suivant dans la page : %(hashed_password)s
ru: 2. На открывшейся странице найдите следующий хешированный пароль: %(hashed_password)s
ta: 2. திறக்கும் பக்கத்தில், பக்கத்தில் பின்வரும் ஆசெட் கடவுச்சொல்லைத் தேடுங்கள்: %(hashed_password)s

source: 3. if the password is in the list :
es: 3. Si la contraseña se encuentra en la lista:
fr: 3. si le mot de passe est dans la liste :
ru: 3. если пароль находится в списке:
ta: 3. கடவுச்சொல் பட்டியலில் இருந்தால்:

source: 3.1. open this link and reset user's password.
es: 3.1. abrir este enlace y restablecer la contraseña del usuario.
fr: 3.1. ouvrez ce lien et réinitialisez le mot de passe de l'utilisateur.
ru: 3.1. откройте эту ссылку и сбросьте пароль пользователя.
ta: 3.1. இந்த இணைப்பைத் திறந்து பயனரின் கடவுச்சொல்லை மீட்டமைக்கவும்.

source: Reset %(user_name)s's password
es: Restablecer la contraseña de %(user_name)s
fr: Réinitialiser le mot de passe de %(user_name)s
ru: Сброс пароля для %(user_name)s
ta: மீட்டமை %(user_name)s இன் கடவுச்சொல்

source: 3.2. send an email to the user to explain the situation : %(user_email)s
es: 3.2. Enviar un correo electrónico al usuario para explicarle la situación: %(user_email)s
fr: 3.2. envoyer un email à l'utilisateur pour lui expliquer la situation : %(user_email)s
ru: 3.2. Отправьте пользователю электронное письмо с объяснением ситуации: %(user_email)s
ta: 3.2. நிலைமையை விளக்க பயனருக்கு மின்னஞ்சல் அனுப்புங்கள்: %(user_email)s

source: Our services were unable to verify if the %(site_url)s/profile/%(user_name)s/settings's password is compromised.
es: Nuestros servicios no fueron capaces de verificar si la contraseña de %(site_url)s/profile/%(user_name)s/settings está comprometida.
fr: Nos services n'ont pas pu vérifier si le mot de passe de %(site_url)s/profile/%(user_name)s/settings est compromis.
ru: Наши службы не смогли проверить, скомпрометирован ли пароль %(site_url)s/profile/%(user_name)s/settings.
ta: %(site_url)s/சுயவிவரம்/ %(user_name)s/அமைப்புகளின் கடவுச்சொல் வேறுபாடின்மை செய்யப்பட்டதா என்பதை எங்கள் சேவைகளால் சரிபார்க்க முடியவில்லை.

source: 3.1. open this link %(site_url)s/profile/%(user_name)s/settings and reset user's password.
es: 3.1. Abrir el enlace %(site_url)s/profile/%(user_name)s/settings y restablecer la contraseña del usuario.
fr: 3.1. ouvrez ce lien %(site_url)s/profile/%(user_name)s/settings et réinitialisez le mot de passe de l'utilisateur.
ru: 3.1. Откройте ссылку %(site_url)s/profile/%(user_name)s/settings и сбросьте пароль пользователя.
ta: 3.1. இந்த இணைப்பை %(site_url)s/சுயவிவரம்/ %(user_name)s/அமைப்புகளைத் திறந்து பயனரின் கடவுச்சொல்லை மீட்டமைக்கவும்.

source: 3.2. send an email to the user to explain the situation : %(user_email)s.
es: 3.2. Enviar un correo electrónico al usuario para explicarle la situación: %(user_email)s.
fr: 3.2. envoyer un email à l'utilisateur pour expliquer la situation : %(user_email)s.
ru: 3.2. Отправьте пользователю электронное письмо с объяснением ситуации: %(user_email)s.
ta: 3.2. நிலைமையை விளக்க பயனருக்கு மின்னஞ்சல் அனுப்புங்கள்: %(user_email)s.

source: Email address confirmation
de: Bestätigung der E-Mail Adresse
es: Confirmación de la dirección de correo electrónico
fr: Confirmation d’adresse email
ru: Подтверждение адреса электронной почты
ta: மின்னஞ்சல் முகவரி உறுதிப்படுத்தல்

source: You added an email address to your account on %(site_name)s. Please click on the "Validate email address" button below to confirm your email address.
de: Sie haben eine E-Mail-Adresse zu Ihrem Konto auf %(site_name)s hinzugefügt. Bitte klicken Sie unten auf die Schaltfläche "E-Mail-Adresse bestätigen", um Ihre E-Mail-Adresse zu bestätigen.
es: Has añadido una dirección de correo electrónico a tu cuenta en %(site_name)s. Haz clic en el botón "Validar dirección de correo electrónico" a continuación para confirmar tu dirección de correo electrónico.
fr: Vous avez ajouté une adresse email à votre compte sur %(site_name)s. Veuillez cliquer sur le bouton « Valider mon adresse email » ci-dessous pour la confirmer.
ru: Вы добавили адрес электронной почты в свою учётную запись на %(site_name)s. Нажмите кнопку «Подтвердить адрес электронной почты» ниже, чтобы подтвердить свой адрес электронной почты.
ta: உங்கள் கணக்கில் ஒரு மின்னஞ்சல் முகவரியை %(site_name)s இல் சேர்த்துள்ளீர்கள். உங்கள் மின்னஞ்சல் முகவரியை உறுதிப்படுத்த கீழே உள்ள "மின்னஞ்சல் முகவரியை சரிபார்க்கவும்" பொத்தானைக் சொடுக்கு செய்க.

source: Validate email address
de: E-Mail-Adresse bestätigen
es: Validar dirección de correo electrónico
fr: Valider mon adresse email
ru: Проверка адреса электронной почты
ta: மின்னஞ்சல் முகவரியை சரிபார்க்கவும்

source: You added an email address to your account on %(site_name)s. Please click on the link below to confirm your email address.
de: Sie haben eine E-Mail-Adresse zu Ihrem Konto auf %(site_name)s hinzugefügt. Bitte klicken Sie auf den unten stehenden Link, um Ihre E-Mail-Adresse zu bestätigen.
es: Has añadido una dirección de correo electrónico a tu cuenta en %(site_name)s. Haz clic en el siguiente enlace para confirmar tu dirección de correo electrónico.
fr: Vous avez ajouté une adresse email à votre compte sur %(site_name)s. Veuillez cliquer sur le lien ci-dessous pour la confirmer.
ru: Вы добавили адрес электронной почты в свою учётную запись на %(site_name)s. Нажмите ссылку ниже, чтобы подтвердить свой адрес электронной почты.
ta: உங்கள் கணக்கில் ஒரு மின்னஞ்சல் முகவரியை %(site_name)s இல் சேர்த்துள்ளீர்கள். உங்கள் மின்னஞ்சல் முகவரியை உறுதிப்படுத்த கீழே உள்ள இணைப்பைக் சொடுக்கு செய்க.

source: Verification link
de: Bestätigungslink
es: Enlace de verificación
fr: Lien de vérification
ru: Ссылка для проверки
ta: சரிபார்ப்பு இணைப்பு

source: One-time passcode authentication
ru: Аутентификация одноразовым кодом

source: Someone, probably you, asked for a one-time passcode at %(site_name)s. If you did not ask for this email, please ignore it. If you did, please enter the one-time passcode below at %(site_name)s to complete your authentication.
ru: Кто-то, возможно вы, попросил одноразовый код на %(site_name)s. Если это не вы запросили то пожалуйста просто проигнорируйте это письмо. Если это вы, пожалуйста введите этот одноразовый код ниже на %(site_name)s чтобы закончить вашу аутентификацию.

source: Your one-time passcode
ru: Ваш одноразовый код доступа

source: Please enter the one-time passcode below at %(site_name)s to complete your authentication.
ru: Пожалуйста, введите одноразовый код доступа ниже на %(site_name)s чтобы завершить вашу аутентификацию.

source: One-time passcode
ru: Одноразовый код доступа

source: In order to finalize your account configuration at %(site_name)s, we need to setup your password. Please click on the "Initialize password" button below and follow the instructions.
de: Um die Konfiguration Ihres Kontos bei %(site_name)s abzuschließen, müssen wir Ihr Passwort einrichten. Bitte klicken Sie unten auf die Schaltfläche "Passwort initialisieren" und folgen Sie den Anweisungen.
es: Para finalizar la configuración de tu cuenta en %(site_name)s, necesitas establecer una contraseña. Por favor haz clic en el botón de "Inicializar contraseña" que aparece a continuación y sigue las instrucciones.
fr: Afin de finaliser la configuration de votre compte sur %(site_name)s, nous devons mettre en place un mot de passe. Veuillez cliquer sur le bouton « Initialiser mon mot de passe », et suivre les instructions qui vous seront présentées.
gl: Para finalizar a configuración da túa conta en %(site_name)s, necesitamos configurar o teu contrasinal. Fai clic no botón "Inicializar contrasinal" a continuación e sigue as instrucións.
ru: Для завершения настройки вашей учётной записи на %(site_name)s нам необходимо установить ваш пароль. Нажмите кнопку «Инициализировать пароль» ниже и следуйте инструкциям.
ta: உங்கள் கணக்கு உள்ளமைவை %(site_name)s இல் இறுதி செய்ய, நாங்கள் உங்கள் கடவுச்சொல்லை அமைக்க வேண்டும். கீழே உள்ள "கடவுச்சொல்லைத் துவக்கவும்" பொத்தானைக் சொடுக்கு செய்து வழிமுறைகளைப் பின்பற்றவும்.

source: Initialize password
de: Passwort initialisieren
es: Inicializar contraseña
fr: Initialiser mon mot de passe
gl: Inicializar contrasinal
ru: Инициализировать пароль
ta: கடவுச்சொல்லைத் தொடங்கவும்
