Repository: yaal-coop/canaille
Catalog: canaille/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, gl, ru, ta

source: Your Canaille instance is not fully configured and not ready for production.<br> Have a look at your server logs and at the <a href="%(documentation_url)s">documentation</a> for more details.
fr: Vous instance de Canaille n'est pas pleinement configurée, et n'est pas prête pour la production.<br> Veuillez consulter les journaux serveur ainsi que la <a href="%(documentation_url)s">documentation</a> pour plus de détails.
ru: Ваш сервер Canaille не полностью настроен и не готов к работе.<br> Для получения дополнительной информации просмотрите журналы сервера и <a href="%(documentation_url)s">документацию</a>.

source: Skip main menu
fr: Sauter le menu principal
ru: Пропустить главное меню

source: Profile
de: Profil
es: Perfil
fr: Profil
ru: Профиль
ta: சுயவிவரம்

source: Consents
de: Zustimmungen
es: Consentimientos
fr: Autorisations
ru: Согласия
ta: ஒப்புதல்

source: Users
de: Benutzer
es: Usuarios
fr: Utilisateurs
gl: Usuarios
ru: Пользователи
ta: பயனர்கள்

source: Admin
es: Administrador
fr: Administration
ru: Админ
ta: நிர்வாகி

source: Log out
de: Abmelden
es: Cerrar sesión
fr: Déconnexion
gl: Pechar sesión
ru: Выйти
ta: விடுபதிகை

source: Sign in
de: Anmelden
es: Iniciar sesión
fr: Se connecter
gl: Iniciar sesión
ru: Войти
ta: விடுபதிகை

source: About Canaille
de: Über Canaille
es: Acerca de Canaille
fr: À propos de canaille
gl: Acerca de canaille
ru: Про Canaille
ta: கனேல் பற்றி

source: Bad request
de: Ungültige Anforderung
es: Petición incorrecta
fr: Mauvaise requête
gl: Petición incorrecta
ru: Плохой запрос
ta: மோசமான கோரிக்கை

source: Unauthorized
de: Nicht autorisiert
es: No autorizado
fr: Accès interdit
gl: Non autorizado
ru: Не авторизованно
ta: அங்கீகரிக்கப்படாதது

source: Page not found
de: Seite nicht gefunden
es: Página no encontrada
fr: Page non trouvée
gl: Páxina non atopada
ru: Страница не найдена
ta: பக்கம் கிடைக்கவில்லை

source: Technical problem
de: Technisches Problem
es: Problema técnico
fr: Problème technique
gl: Problema técnico
ru: Техническая проблема
ta: தொழில்நுட்ப சிக்கல்

source: The request you made is invalid
de: Ihre Anfrage ist ungültig
es: La petición que has hecho no es válida
fr: La requête que vous avez effectué est invalide
gl: A petición que fixeches é incorrecta
ru: Ваш запрос недействителен
ta: நீங்கள் செய்த கோரிக்கை தவறானது

source: You do not have the authorizations to access this page
de: Sie haben keine Berechtigung für den Zugriff auf diese Seite
es: No tienes autorización para acceder a esta página
fr: Vous n'avez pas l'autorisation d'accéder à cette page
gl: Non tes autorización para acceder a esta páxina
ru: У вас нет прав доступа к этой странице
ta: இந்த பக்கத்தை அணுக உங்களுக்கு அங்கீகாரங்கள் இல்லை

source: The page you are looking for does not exist
de: Die von Ihnen gesuchte Seite existiert nicht
es: La página que estás buscando no existe
fr: La page à laquelle vous tentez d'accéder n'existe pas
gl: A páxina que estás intentando acceder non existe
ru: Страница, которую вы ищете, не существует
ta: நீங்கள் தேடும் பக்கம் இல்லை

source: Please contact your administrator
de: Bitte kontaktieren Sie Ihren Administrator
es: Por favor contacta con tu administrador
fr: Veuillez contacter un administrateur
gl: Por favor contacta co teu administrador
ru: Обратитесь к администратору
ta: உங்கள் நிர்வாகியை தொடர்பு கொள்ளவும்

source: Free and open-source identity provider.
de: Freier und quelloffener Identity-Provider.
es: Proveedor de identidad gratuito y de código abierto.
fr: Fournisseur d'identité numérique libre.
gl: Provedor de identidade libre e de código aberto.
ru: Бесплатный поставщик удостоверений с открытым исходным кодом.
ta: இலவச மற்றும் திறந்த மூல அடையாள வழங்குநர்.

source: Version %(version)s
es: Versión %(version)s
gl: Versión %(version)s
ru: Версия %(version)s
ta: பதிப்பு %(version)s

source: Documentation
de: Dokumentation
es: Documentación
gl: Documentación
ru: Документация
ta: ஆவணப்படுத்துதல்

source: Source code
de: Quellcode
es: Código fuente
fr: Code source
gl: Código fonte
ru: Исходный код
ta: மூலக் குறியீடு

source: First login
de: Erster Login
es: Primer acceso
fr: Première connexion
gl: Primeiro acceso
ru: Первый вход
ta: முதல் உள்நுழைவு

source: It seems this is the first time you are logging here. In order to finalize your account configuration, you need to set a password to your account. We will send you an email containing a link that will allow you to set a password. Please click on the "Send the initialization email" button below to send the email.
de: Sie scheinen sich zum ersten Mal hier anzumelden. Um die Konfiguration Ihres Kontos abzuschließen, müssen Sie ein Passwort für Ihr Konto festlegen. Wir werden Ihnen eine E-Mail mit einem Link schicken, über den Sie ein Passwort festlegen können. Bitte klicken Sie unten auf die Schaltfläche "Initialisierungs-E-Mail senden", um die E-Mail zu senden.
es: Parece que es la primera vez que inicias sesión aquí. Para finalizar la configuración de tu cuenta, necesitas establecer una contraseña para tu cuenta. Te enviaremos un correo electrónico con un enlace que te permitirá establecer una contraseña. Haz clic en el botón "Enviar el correo electrónico de inicialización" que aparece a continuación para enviar el correo electrónico.
fr: Il semblerait que vous vous connectez ici pour la première fois. Afin de finaliser la configuration de votre compte, vous devez mettre en place un mot de passe. Nous allons vous envoyer un courriel contenant un lien qui vous permettra de choisir un mot de passe. Pour continuer et envoyer le courriel, cliquez sur le bouton « Envoyer le courriel d'initialisation » ci-dessous.
gl: Parece que este é o teu primeiro acceso. Para finalizar a configuración da túa conta, é preciso que establezas un contrasinal. Para recibir un email cun enlace que te permitirá establecela, fai clic no botón «Enviar email de inicialización».
ru: Похоже, вы входите сюда впервые. Чтобы завершить настройку учётной записи, вам необходимо установить пароль. Мы отправим вам электронное письмо со ссылкой для установки пароля. Нажмите кнопку «Отправить электронное письмо для инициализации» ниже, чтобы отправить письмо.
ta: நீங்கள் இங்கே உள்நுழைவது இதுவே முதல் முறை என்று தெரிகிறது. உங்கள் கணக்கு உள்ளமைவை இறுதி செய்ய, உங்கள் கணக்கில் கடவுச்சொல்லை அமைக்க வேண்டும். கடவுச்சொல்லை அமைக்க அனுமதிக்கும் இணைப்பைக் கொண்ட மின்னஞ்சலை நாங்கள் உங்களுக்கு அனுப்புவோம். மின்னஞ்சலை அனுப்ப கீழே உள்ள "துவக்க மின்னஞ்சலை அனுப்பு" பொத்தானைக் சொடுக்கு செய்க.

source: Login page
de: Login-Seite
es: Página de acceso
fr: Page de connexion
gl: Páxina de acceso
ru: Страница входа
ta: உள்நுழைவு பக்கம்

source: Send the initialization email
de: Initialisierungs-E-Mail senden
es: Enviar email de inicialización
fr: Envoyer le courriel d'initialisation
gl: Enviar email de inicialización
ru: Отправить письмо с инициализацией
ta: துவக்க மின்னஞ்சலை அனுப்பவும்

source: Forgotten password
de: Passwort vergessen
es: He olvidado mi contraseña
fr: Mot de passe oublié
gl: Esquecín o meu contrasinal
ru: Забыли пароль
ta: மறந்துவிட்ட கடவுச்சொல்

source: Please enter the reset password code you received via email.
fr: Veuillez entrer le code de réinitialisation que vous avez reçu par courriel.
ru: Введите код сброса пароля, полученный вами по электронной почте.

source: Create an account
de: Benutzerkonto anlegen
es: Crear una cuenta
fr: S’inscrire
ru: Создать учётную запись
ta: ஒரு கணக்கை உருவாக்கவும்

source: Submit
de: Absenden
es: Enviar
fr: Valider
gl: Enviar
ru: Отправить
ta: சமர்ப்பிக்கவும்

source: After this form is sent, if the email address or the login you provided exists, you will receive an email containing a link or code that will allow you to reset your password.
fr: Après envoi de ce formulaire, si l'identifiant ou l'adresse courriel que vous indiquez existe, vous recevrez un courriel contenant un lien ou un code qui vous permettra de ré-initialiser votre mot de passe.
ru: После отправки этой формы, если адрес электронной почты или имя пользователя (логин), который вы предоставили существует, то вы получите электронное письмо, содержащее ссылку или код, который позволит вам сбросить пароль.

source: Send again
de: Erneut senden
es: Enviar otra vez
fr: Envoyer à nouveau
gl: Enviar outra vez
ru: Отправить снова
ta: மீண்டும் அனுப்பவும்

source: Send
de: Senden
es: Enviar
fr: Envoyer
gl: Enviar
ru: Отправить
ta: அனுப்பு

source: Group creation
de: Gruppe anlegen
es: Crear grupo
fr: Nouveau groupe
gl: Crear grupo
ru: Создание групп
ta: குழு உருவாக்கம்

source: Group edition
de: Gruppe bearbeiten
es: Editar grupo
fr: Édition d'un groupe
gl: Editar grupo
ru: Редактирование группы
ta: குழு பதிப்பு

source: View
de: Ansicht
es: Ver
fr: Consulter
ru: Просмотр
ta: பார்வை

source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter
ru: Добавить
ta: கூட்டு

source: Create a new group
de: Neue Gruppe erstellen
es: Crear un nuevo grupo
fr: Création d'un nouveau groupe
gl: Crear novo grupo
ru: Создать новую группу
ta: ஒரு புதிய குழுவை உருவாக்கவும்

source: Edit information about a group
de: Gruppeninformation bearbeiten
es: Editar información sobre un grupo
fr: Éditez les informations d'un groupe
gl: Editar información sobre un grupo
ru: Изменение информации о группе
ta: ஒரு குழு பற்றிய தகவல்களைத் திருத்தவும்

source: Because group cannot be empty, you will be added to the group. You can remove you later by editing your profile when you will have added other members to the group.
de: Da die Gruppe nicht leer sein kann, werden Sie der Gruppe hinzugefügt. Sie können sich später wieder entfernen, indem Sie Ihr Profil bearbeiten, sobald Sie der Gruppe andere Mitglieder hinzugefügt haben.
es: Ya que el grupo no puede estar vacío, serás añadido al grupo. Puedes eliminarte del grupo después editando tu perfil una vez que hayas añadido más miembros al grupo.
fr: Vous serez ajouté au groupe car le groupe ne peut pas être vide. Vous pourrez vous retirer du groupe depuis l'édition de votre profil dès que vous aurez ajouter d'autres membres dans le groupe.
gl: Xa que o grupo non pode quedar baleiro, vas ser engadido ó grupo. Podes eliminarte do grupo despois editando o teu perfil unha vez que engadas máis membros ó grupo.
ru: Поскольку группа не может быть пустой, вы будете добавлены в группу. Вы сможете удалить себя позже, отредактировав свой профиль, когда добавите в группу других участников.
ta: குழு காலியாக இருக்க முடியாது என்பதால், நீங்கள் குழுவில் சேர்க்கப்படுவீர்கள். குழுவில் மற்ற உறுப்பினர்களைச் சேர்த்தபோது உங்கள் சுயவிவரத்தைத் திருத்துவதன் மூலம் பின்னர் உங்களை அகற்றலாம்.

source: Delete group
de: Gruppe löschen
es: Eliminar grupo
fr: Supprimer le groupe
gl: Eliminar grupo
ru: Удалить группу
ta: குழுவை நீக்கு

source: Create group
de: Gruppe anlegen
es: Crear grupo
fr: Créer le groupe
gl: Crear grupo
ru: Создать группу
ta: குழுவை உருவாக்கவும்

source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
gl: Editar
ru: Изменить
ta: தொகு

source: Group members
de: Gruppenmitglieder
es: Miembros del grupo
fr: Membres du groupe
gl: Membros do grupo
ru: Члены группы
ta: குழு உறுப்பினர்கள்

source: Invite a user
de: Benutzer einladen
es: Invitar a un usuario
fr: Inviter un utilisateur
gl: Invitar un usuario
ru: Пригласить пользователя
ta: ஒரு பயனரை அழைக்கவும்

source: Invite
de: Einladen
es: Invitar
fr: Inviter
ru: Пригласить
ta: அழைக்கவும்

source: Invitation link
de: Einladungslink
es: Enlace de invitación
fr: Lien d'invitation
gl: Ligazón de invitación
ru: Ссылка приглашения
ta: அழைப்பிதழ் இணைப்பு

source: Invitation sent
de: Einladung gesendet
es: Invitación enviada
fr: Invitation envoyée
gl: Invitación enviada
ru: Приглашение отправлено
ta: அழைப்பு அனுப்பப்பட்டது

source: Invitation not sent
de: Einladung nicht versendet
es: Invitación no enviada
fr: Invitation non envoyée
gl: Invitación non enviada
ru: Приглашение не отправлено
ta: அழைப்பு அனுப்பப்படவில்லை

source: Here is the invitation link you can provide to the user you want to invite:
de: Hier ist der Einladungslink, den Sie dem einzuladenden Benutzer zur Verfügung stellen können:
es: Este es el enlace de invitación que puedes proporcionar al usuario que quieres invitar:
fr: Voici le lien que vous pouvez transmettre à l'utilisateur que vous souhaitez inviter :
gl: Esta é a ligazón de invitación que podes compartir co usuario que queres invitar:
ru: Вот ссылка-приглашение, которую вы можете отправить пользователю, которого хотите пригласить:
ta: நீங்கள் அழைக்க விரும்பும் பயனருக்கு நீங்கள் வழங்கக்கூடிய அழைப்பிதழ் இணைப்பு இங்கே:

source: This invitation link has been sent to %(email)s
de: Dieser Einladungslink wurde an %(email)s gesendet
es: El enlace de invitación ha sido enviado a %(email)s
fr: Ce lien d'invitation a été envoyé à %(email)s
gl: A ligazón de invitación foi enviada a %(email)s
ru: Эта ссылка приглашения была отправлена на %(email)s
ta: இந்த அழைப்பிதழ் இணைப்பு %(email)sுக்கு அனுப்பப்பட்டுள்ளது

source: If you need to provide this link by other ways than email, you can copy it there:
de: Wenn Sie den Link auf andere Weise als per E-Mail übermitteln wollen, können Sie ihn hier kopieren:
es: Si necesitas proporcionar este enlace por un medio distinto al correo electrónico, puedes copiarlo aquí:
fr: Si vous avez besoin de communiquer ce lien par d'autres moyen que le courriel, vous pouvez le copier ici :
gl: Se precisas proporcionar esta ligazón doutro xeito que non sexa por correo electrónico, podes copiala aquí:
ru: Если вам нужно отправить эту ссылку не по электронной почте, вы можете скопировать её здесь:
ta: மின்னஞ்சலைத் தவிர வேறு வழிகளில் இந்த இணைப்பை நீங்கள் வழங்க வேண்டும் என்றால், அதை அங்கு நகலெடுக்கலாம்:

source: This invitation link could not be sent to %(email)s due to technical issues.
de: Dieser Einladungslink konnte aufgrund technischer Schwierigkeiten nicht an %(email)s gesendet werden.
es: Este enlace de invitación no se pudo enviar a %(email)s debido a un problema técnico.
fr: Ce lien d'invitation n'a pas pu être envoyé à %(email)s à cause de problèmes techniques.
gl: Esta ligazón de invitación non se puido enviar a %(email)s debido a problemas técnicos.
ru: Эта ссылка-приглашение не может быть отправлена на адрес %(email)s из-за технических проблем.
ta: தொழில்நுட்ப சிக்கல்கள் காரணமாக இந்த அழைப்பிதழ் இணைப்பை %(email)sு அனுப்ப முடியவில்லை.

source: However you can copy the link there to provide it by other ways than email:
de: Sie können den Link jedoch kopieren, um ihn auf andere Weise als per E-Mail zu übermitteln:
es: Sin embargo, puedes copiar el enlace para compartirlo por un medio distinto a email:
fr: Cependant, vous pouvez copier ce lien pour le transmettre par d'autres moyens que le courriel :
gl: Sen embargo, pode copiar a ligazón aquí para proporcionalo doutro xeito que non sexa por correo electrónico:
ru: Однако вы можете скопировать ссылку здесь, чтобы отправить её не по электронной почте:
ta: எவ்வாறாயினும், மின்னஞ்சலைத் தவிர வேறு வழிகளில் வழங்க நீங்கள் அங்கு இணைப்பை நகலெடுக்கலாம்:

source: Copy
de: Kopieren
es: Copiar
fr: Copier
gl: Copiar
ru: Копировать
ta: நகலெடு

source: Create a user
de: Benutzer anlegen
es: Crear un usuario
fr: Créer un utilisateur
gl: Crear un usuario
ru: Создать пользователя
ta: ஒரு பயனரை உருவாக்கவும்

source: Invite another user
de: Weiteren Benutzer einladen
es: Invitar a otro usuario
fr: Inviter quelqu'un d'autre
gl: Invitar outro usuario
ru: Пригласить другого пользователя
ta: மற்றொரு பயனரை அழைக்கவும்

source: After this form is sent, the recipient your indicated will receive an email containing an account creation link.
de: Nach dem Absenden des Formulars erhält der von Ihnen angegebene Empfänger eine E-Mail mit einem Link zur Einrichtung eines Kontos.
es: Una vez que se envíe este formulario, el destinatario que has indicado recibirá un correo electrónico con un enlace para crear una cuenta.
fr: Après que ce formulaire sera envoyé, le destinataire que vous avez indiqué recevra un courriel contenant un lien lui permettant de créer un compte utilisateur.
gl: Despois de enviar este formulario, o destinatario que indicaches recibirá un email cunha ligazón para crear a conta.
ru: После отправки этой формы указанному вами получателю будет отправлено электронное письмо со ссылкой для создания учётной записи.
ta: இந்த படிவம் அனுப்பப்பட்ட பிறகு, உங்கள் சுட்டிக்காட்டப்பட்ட பெறுநர் கணக்கு உருவாக்கும் இணைப்பைக் கொண்ட மின்னஞ்சலைப் பெறுவார்.

source: Generate a link
de: Link erzeugen
es: Generar enlace
fr: Générer un lien
gl: Xerar ligazón
ru: Сгенерировать ссылку
ta: ஒரு இணைப்பை உருவாக்குங்கள்

source: Send the invitation
de: Einladung senden
es: Enviar invitación
fr: Envoyer l'invitation
gl: Enviar invitación
ru: Отправить приглашение
ta: அழைப்பை அனுப்புங்கள்

source: User creation
de: Benutzer anlegen
es: Crear usuario
fr: Nouvel utilisateur
gl: Crear usuario
ru: Создание пользователя
ta: பயனர் உருவாக்கம்

source: Create a new user account
de: Neues Benutzerkonto anlegen
es: Crear una nueva cuenta
fr: Création d'un nouveau compte utilisateur
gl: Crear nova conta de usuario
ru: Создание новой учетной записи пользователя
ta: புதிய பயனர் கணக்கை உருவாக்கவும்

source: Before you can create an account, please enter a valid email address. Then you will receive an email containing a link that will allow you to finish your registration.
de: Bevor Sie ein Konto erstellen können, geben Sie bitte eine gültige E-Mail-Adresse ein. Sie erhalten dann eine E-Mail mit einem Link, mit dem Sie Ihre Registrierung abschließen können.
es: Antes de crear una cuenta, introduce una dirección de correo electrónico válida. A continuación, recibirás un correo electrónico con un enlace que te permitirá completar tu registro.
fr: Avant de pouvoir créer un compte, veuillez entrer une adresse email valide. Vous recevrez ensuite un courriel contenant un lien qui vous permettra de poursuivre votre inscription.
ru: Прежде чем создать учётную запись, введите ваш адрес электронной почты. Затем вы получите электронное письмо, содержащее ссылку которая позволит вам завершить регистрацию.
ta: நீங்கள் ஒரு கணக்கை உருவாக்குவதற்கு முன், சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும். உங்கள் பதிவை முடிக்க அனுமதிக்கும் இணைப்பைக் கொண்ட மின்னஞ்சலைப் பெறுவீர்கள்.

source: Sign in at %(website)s
de: Anmeldung bei %(website)s
es: Iniciar sesión en %(website)s
fr: Connexion à %(website)s
gl: Iniciar sesión en %(website)s
ru: Войти как %(website)s
ta: %(website)s இல் உள்நுழைக

source: Manage your information and your authorizations
de: Verwalten Sie Ihre Informationen und Ihre Berechtigungen
es: Gestionar tu información y tus autorizaciones
fr: Gérez vos informations et vos autorisations
gl: Xestiona a túa información e as túas autorizacións
ru: Управление вашей информацией и авторизациями
ta: உங்கள் தகவல்களையும் உங்கள் அங்கீகாரங்களையும் நிர்வகிக்கவும்

source: Continue
de: Weiter
es: Continuar
fr: Continuer
gl: Continuar
ru: Продолжить
ta: தொடரவும்

source: Sign in as %(username)s
de: Anmelden als %(username)s
es: Iniciar sesión como %(username)s
fr: Connexion en tant que %(username)s
gl: Iniciar sesión como %(username)s
ru: Войти как %(username)s
ta: %(username)s என உள்நுழைக

source: Please enter your password for this account.
de: Bitte geben Sie Ihr Passwort für dieses Konto ein.
es: Introduce la contraseña para esta cuenta.
fr: Veuillez saisir votre mot de passe pour ce compte.
gl: Introduce o teu contrasinal para esta conta.
ru: Пожалуйста, введите свой пароль для этой учётной записи.
ta: இந்த கணக்கிற்கான உங்கள் கடவுச்சொல்லை உள்ளிடவும்.

source: I am not %(username)s
de: Ich bin nicht %(username)s
es: No soy %(username)s
fr: Je ne suis pas %(username)s
gl: Non son %(username)s
ru: Я не %(username)s
ta: நான் %(username)s அல்ல

source: Personal information
de: Persönliche Informationen
es: Información personal
fr: Informations personnelles
gl: Información persoal
ru: Личная информация
ta: தனிப்பட்ட செய்தி

source: Click to upload a photo
de: Klicken Sie zum Hochladen eines Fotos
es: Haz clic para subir una foto
fr: Cliquez pour mettre en ligne une photo
gl: Clic para subir foto
ru: Нажмите, чтобы загрузить фото
ta: புகைப்படத்தை பதிவேற்ற சொடுக்கு செய்க

source: Account settings
de: Kontoeinstellungen
es: Ajustes de la cuenta
fr: Paramètres du compte
ru: Настройки учётной записи
ta: கணக்கு அமைப்புகள்

source: User password is not mandatory
de: Das Benutzerpasswort ist nicht obligatorisch
es: La contraseña no es obligatoria
fr: Le mot de passe utilisateur n'est pas requis à la création
gl: O contrasinal non é obrigatorio
ru: Пароль пользователя не является обязательным
ta: பயனர் கடவுச்சொல் கட்டாயமில்லை

source: The user will not be able to authenticate unless the password is set, but they will be able to ask for a password initialization mail.
de: Der Benutzer kann sich nicht authentifizieren, wenn das Kennwort nicht festgelegt ist, aber er kann eine E-Mail zur Kennwortinitialisierung anfordern.
es: El usuario no podrá iniciar sesión hasta que establezca su contraseña, pero podrá solicitar que se le envíe un correo electrónico de inicialización de contraseña.
fr: Le nouvel utilisateur ne pourra pas se connecter tant que son mot de passe n'est pas défini, mais sera en mesure de demander l'envoi d'un courriel d'initialisation de mot de passe.
ru: Пользователь не сможет аутентифицироваться пока пароль не установлен, но сможет запросить письмо с инициализацией пароля.
ta: கடவுச்சொல் அமைக்கப்படாவிட்டால் பயனரால் அங்கீகரிக்க முடியாது, ஆனால் அவர்கள் கடவுச்சொல் துவக்க அஞ்சலைக் கேட்க முடியும்.

source: The user will not be able to authenticate unless the password is set.
de: Der Benutzer kann sich erst dann authentifizieren, wenn das Passwort festgelegt ist.
es: El usuario no podrá iniciar sesión a menos que se establezca una contraseña.
fr: L'utilisateur ne pourra pas se connecter tant que son mot de passe n'est pas défini.
ru: Пользователь не сможет аутентифицироваться пока пароль не установлен.
ta: கடவுச்சொல் அமைக்கப்படாவிட்டால் பயனரால் அங்கீகரிக்க முடியாது.

source: My profile
de: Mein Profil
es: Mi perfil
fr: Mon profil
gl: O meu perfil
ru: Мой профиль
ta: எனது சுயவிவரம்

source: User profile edition
de: Bearbeitung des Benutzerprofils
es: Editar perfil de usuario
fr: Édition d'un profil utilisateur
gl: Editar perfil de usuario
ru: Редактирование профиля пользователя
ta: பயனர் சுயவிவர பதிப்பு

source: Edit your personal information
de: Bearbeiten Sie Ihre persönlichen Informationen
es: Editar tu información personal
fr: Éditez vos informations personnelles
gl: Editar a túa información persoal
ru: Изменение вашей личной информации
ta: உங்கள் தனிப்பட்ட தகவல்களைத் திருத்தவும்

source: Edit information about a user
de: Informationen über einen Benutzer bearbeiten
es: Editar la información de un usuario
fr: Éditez les informations d'un utilisateur
gl: Editar información dun usuario
ru: Изменение информации о пользователе
ta: ஒரு பயனரைப் பற்றிய தகவல்களைத் திருத்தவும்

source: My email addresses
de: Meine E-Mail-Adressen
es: Mis direcciones de correo electrónico
fr: Mes adresses email
ru: Мои адреса электронной почты
ta: எனது மின்னஞ்சல் முகவரிகள்

source: Remove this email address
de: Diese E-Mail-Adresse entfernen
es: Eliminar esta dirección de correo electrónico
fr: Supprimer cette adresse email
ru: Удалить адрес электронной почты
ta: இந்த மின்னஞ்சல் முகவரியை அகற்று

source: This user cannot edit this field
de: Dieser Benutzer kann dieses Feld nicht bearbeiten
es: Este usuario no puede editar este campo
fr: Cet utilisateur ne peut pas éditer ce champ
gl: O usuario non pode editar este campo
ru: Этот пользователь не может редактировать это поле
ta: இந்த பயனரை இந்த புலத்தைத் திருத்த முடியாது

source: This user cannot see this field
de: Dieser Benutzer kann dieses Feld nicht sehen
es: Este usuario no puede ver este campo
fr: Cet utilisateur ne peut pas voir ce champ
gl: O usuario non pode ver este campo
ru: Этот пользователь не может видеть это поле
ta: இந்த பயனர் இந்த புலத்தைப் பார்க்க முடியாது
