Repository: yaal-coop/canaille
Catalog: canaille/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, gl, ru, ta

source: Connection successful. Welcome %(user)s
de: Verbindung erfolgreich. Willkommen %(user)s
es: Acceso correcto. Bienvenido/a %(user)s
fr: Connexion réussie. Bienvenue %(user)s
gl: Acceso correcto. Benvido/a %(user)s
ru: Подключение успешно. Добро пожаловать %(user)s
ta: இணைப்பு வெற்றிகரமாக. வரவேற்பு %(user)s

source: Your password has been updated successfully
de: Ihr Passwort wurde erfolgreich aktualisiert
es: Tu contraseña se ha actualizado correctamente
fr: Votre mot de passe a correctement été mis à jour
ru: Ваш пароль был обновлён
ta: உங்கள் கடவுச்சொல் வெற்றிகரமாக புதுப்பிக்கப்பட்டுள்ளது

source: The test mail has been sent correctly
de: Die Test-E-Mail wurde korrekt versendet
es: El correo electrónico de prueba se envió correctamente
fr: Le courriel de test a été envoyé correctement
ru: Тестовое письмо отправлено корректно
ta: சோதனை அஞ்சல் சரியாக அனுப்பப்பட்டுள்ளது

source: The test mail has not been sent correctly
de: Die Test-E-Mail wurde nicht korrekt gesendet
es: El correo electrónico de prueba no se envió correctamente
fr: Le courriel de test n’a pas été envoyé correctement
ru: Тестовое письмо отправлено некорректно
ta: சோதனை அஞ்சல் சரியாக அனுப்பப்படவில்லை

source: Invitation on {website_name}
de: Einladung für {website_name}
es: Invitación a {website_name}
fr: Invitation sur {website_name}
gl: Invitación a {website_name}
ru: Приглашение на {website_name}
ta: {website_name} இல் அழைப்பு

source: Email confirmation on {website_name}
de: E-Mail-Bestätigung auf {website_name}
es: Confirmación por correo electrónico en {website_name}
fr: Confirmation de votre adresse email sur {website_name}
ru: Подтверждение электронной почты на {website_name}
ta: {website_name}

source: Passcode authentication on {website_name}
ru: Аутентификация одноразовым кодом на {website_name}

source: Login failed, please check your information
de: Anmeldung fehlgeschlagen, bitte überprüfen Sie Ihre Angaben
es: Falló el inicio de sesión, comprueba tus credenciales
fr: La connexion a échoué, veuillez vérifier vos informations
gl: Fallou o inicio de sesión, comproba as túas credenciais
ru: Ошибка входа, проверьте данные
ta: உள்நுழைவு தோல்வியுற்றது, தயவுசெய்து உங்கள் தகவல்களைச் சரிபார்க்கவும்

source: Cannot remember the login you attempted to sign in with
de: Sie können sich nicht an das Login erinnern, mit dem Sie versucht haben, sich anzumelden
es: No se puede recordar el nombre de usuario con el que intentó iniciar sesión
fr: Impossible de retrouver l’identifiant avec lequel vous avez tenté de vous connecter
ru: Не могу вспомнить логин, который вы использовали для входа
ta: நீங்கள் உள்நுழைய முயற்சித்த உள்நுழைவை நினைவில் கொள்ள முடியாது

source: You have been disconnected. See you next time %(user)s
de: Ihre Verbindung wurde unterbrochen. Bis zum nächsten Mal %(user)s
es: La sesión se ha cerrado. Hasta la próxima, %(user)s
fr: Vous avez été déconnecté·e. À bientôt %(user)s
gl: A sesión foi desconectada. Deica logo, %(user)s
ru: Вы были отключены. Увидимся в следующий раз, %(user)s
ta: நீங்கள் துண்டிக்கப்பட்டுள்ளீர்கள். அடுத்த முறை %(user)s சந்திப்போம்

source: A password initialization link has been sent at your email address. You should receive it within a few minutes.
de: Ein Link zur Initialisierung des Passworts wurde an Ihre E-Mail-Adresse gesendet. Sie sollten ihn innerhalb weniger Minuten erhalten.
es: Se ha enviado un enlace de inicialización de la contraseña a tu correo electrónico. Deberías recibirlo en unos minutos.
fr: Un lien d'initialisation de votre mot de passe vous a été envoyé par courriel. Vous devriez le recevoir d'ici une quelques minutes.
gl: Enviouse unha ligazón de inicialización do contrasinal ó teu correo electrónico. Deberías recibila nun prazo de 10 minutos.
ru: На ваш адрес электронной почты была отправлена ссылка для инициализации пароля. Вы должны получить её в течение нескольких минут.
ta: உங்கள் மின்னஞ்சல் முகவரியில் கடவுச்சொல் துவக்க இணைப்பு அனுப்பப்பட்டுள்ளது. நீங்கள் அதை சில நிமிடங்களுக்குள் பெற வேண்டும்.

source: You should receive it within a few minutes.
fr: Vous devriez le recevoir dans quelques minutes.
ru: Вы должны получить его в течение нескольких минут.

source: The user '%(user)s' does not have permissions to update their password. We cannot send a password reset email.
de: Der Benutzer „%(user)s“ hat nicht die Berechtigung, sein Passwort zu aktualisieren. Wir können keine E-Mail zum Zurücksetzen des Passworts senden.
es: El usuario '%(user)s' no tiene permiso para actualizar su contraseña. No es posible enviarle un correo electrónico para que restablezca su contraseña.
fr: L'utilisateur '%(user)s' n'a pas la permission d'éditer son mot de passe. Nous ne pouvons pas lui envoyer un courriel de réinitialisation.
gl: O usuario '%(user)s' non ten permiso para actualizar o seu contrasinal. Non é posible enviarlle un email para que restableza o seu contrasinal.
ru: У пользователя '%(user)s' нет прав на обновление пароля. Мы не можем отправить электронное письмо для сброса пароля.
ta: பயனர் '%(user)s' தங்கள் கடவுச்சொல்லைப் புதுப்பிக்க இசைவு இல்லை. கடவுச்சொல் மீட்டமைப்பு மின்னஞ்சலை நாங்கள் அனுப்ப முடியாது.

source: We encountered an issue while we sent the password recovery email.
de: Beim Versand der E-Mail zur Wiederherstellung des Passworts ist ein Problem aufgetreten.
es: Se produjo un problema al enviar el correo electrónico para recuperar la contraseña.
fr: Nous avons rencontré un problème lors de l'envoi du courriel de réinitialisation de mot de passe.
gl: Produciuse un problema enviando o email para recuperar o contrasinal.
ru: При отправке электронного письма для восстановления пароля возникла проблема.
ta: கடவுச்சொல் மீட்பு மின்னஞ்சலை அனுப்பும்போது ஒரு சிக்கலை சந்தித்தோம்.

source: The user '%(user)s' does not have permissions to update their password.
fr: L'utilisateur '%(user)s' n'a pas la permission d'éditer son mot de passe.
ru: Пользователь «%(user)s» не имеет разрешения на изменение своего пароля.

source: Invalid code.
fr: Code invalide.
ru: Неверный код.

source: The passcode you entered is invalid. Please try again
ru: Введённый вами код доступа недействителен. Повторите попытку

source: Error while sending the passcode by email. Please try again.
ru: Ошибка при отправке кода доступа по электронной почте. Повторите попытку.

source: Passcode successfully sent!
ru: Код доступа успешно отправлен!

source: Error while sending the passcode by SMS. Please try again.
ru: Ошибка при отправке кода доступа по SMS. Повторите попытку.

source: In order to continue logging in, you need to configure an authenticator application.
ru: Чтобы продолжить вход в систему, необходимо настроить приложение-аутентификатор.

source: Please enter the passcode from your authenticator application.
ru: Пожалуйста, введите одноразовый код из вашего приложения аутентификатора.

source: Error while sending passcode by email. Please try again.
ru: Ошибка при отправке кода доступа по электронной почте. Повторите попытку.

source: Login
de: Anmeldung
es: Usuario
fr: Identifiant
gl: Usuario
ru: Войти
ta: புகுபதிவு

source: Password
de: Passwort
es: Contraseña
fr: Mot de passe
gl: Contrasinal
ru: Пароль
ta: கடவுச்சொல்

source: Code
es: Código
gl: Código
ru: Код
ta: குறியீடு

source: Password confirmation
de: Passwortbestätigung
es: Confirmación de contraseña
fr: Confirmation du mot de passe
gl: Repetir contrasinal
ru: Подтвердите пароль
ta: கடவுச்சொல் உறுதிப்படுத்தல்

source: Automatic
de: Automatisch
es: Automático
fr: Automatique
gl: Automático
ru: Автоматически
ta: தானியங்கி

source: Username
de: Anmeldename
es: Nombre de usuario
fr: Nom d'utilisateur
gl: Nome de usuario
ru: Имя пользователя
ta: பயனர்பெயர்

source: Name
es: Nombre
fr: Nom
gl: Nome
ru: Имя
ta: பெயர்

source: Title
de: Titel
es: Título
fr: Titre
ru: Должность
ta: தலைப்பு

source: Vice president
de: Vizepräsident
es: Vicepresidente
fr: Vice-président
ru: Вице президент
ta: துணைத் தலைவர்

source: Given name
de: Vorname
es: Nombre de pila
fr: Prénom
gl: Nome de pila
ru: Имя
ta: கொடுக்கப்பட்ட பெயர்

source: John
de: Maria
fr: Martin
ru: Иван
ta: சான்

source: Family Name
de: Familienname
es: Apellidos
fr: Nom de famille
gl: Apelidos
ru: Фамилия
ta: குடும்ப பெயர்

source: Doe
de: Mustermann
fr: Dupont
ru: Иванов
ta: டியோ

source: Display Name
de: Anzeigename
es: Nombre a mostrar
fr: Nom d'affichage
gl: Nome a amosar
ru: Отображаемое имя
ta: காட்சி பெயர்

source: Johnny
de: Maria
fr: Martin.D
ru: Иваныч
ta: சானி

source: Email addresses
de: E-Mail-Adressen
es: Direcciones de correo electrónico
fr: Adresse email
ru: Адреса электронной почты
ta: மின்னஞ்சல் முகவரிகள்

source: This email will be used as a recovery address to reset the password if needed
de: Diese E-Mail wird als Wiederherstellungsadresse verwendet, um das Passwort bei Bedarf zurückzusetzen
es: Se utilizará este correo electrónico como dirección de recuperación para restablecer la contraseña si fuera necesario
fr: Cette adresse servira d'adresse électronique de récupération pour recevoir un courriel de réinitialisation de mot de passe en cas de besoin
gl: O correo electrónico usarase como dirección para recuperar o contrasinal se é necesario
ru: Этот адрес электронной почты будет использован в качестве адреса для восстановления пароля при необходимости
ta: தேவைப்பட்டால் கடவுச்சொல்லை மீட்டமைக்க இந்த மின்னஞ்சல் மீட்பு முகவரியாக பயன்படுத்தப்படும்

source: Phone numbers
de: Telefonnummern
es: Números de teléfono
fr: Numéros de téléphone
ru: Телефонные номера
ta: தொலைபேசி எண்கள்

source: Address
de: Adresse
es: Dirección
fr: Adresse
gl: Dirección
ru: Адрес
ta: முகவரி

source: Street
de: Straße
es: Calle
fr: Rue
ru: Улица
ta: தெரு

source: Postal Code
de: Postleitzahl
es: Código Postal
fr: Code postal
ru: Почтовый код
ta: அஞ்சல் குறியீடு

source: Locality
de: Lokalität
es: Localidad
fr: Ville
ru: Район
ta: இடம்

source: Region
es: Región
fr: Région
ru: Область
ta: பகுதி

source: Photo
de: Foto
es: Foto
gl: Foto
ru: Фото
ta: புகைப்படம்

source: Delete the photo
de: Foto löschen
es: Eliminar foto
fr: Supprimer la photo
gl: Eliminar foto
ru: Удалить фото
ta: புகைப்படத்தை நீக்கு

source: User number
de: Benutzernummer
es: Número de usuario
fr: Numéro d’utilisateur
ru: Номер пользователя
ta: பயனர் எண்

source: Department
de: Abteilung
es: Departamento
fr: Service
ru: Отдел
ta: துறை

source: Organization
de: Organisation
es: Organización
fr: Organisation
ru: Организация
ta: அமைப்பு

source: Website
es: Sitio web
fr: Site web
gl: Sitio web
ru: Сайт
ta: வலைத்தளம்

source: Preferred language
de: Bevorzugte Sprache
es: Idioma preferido
fr: Langue préférée
gl: Idioma preferido
ru: Предпочтительный язык
ta: விருப்பமான மொழி

source: users, admins …
de: Benutzer*innen, Administrator*innen …
es: usuarios, administradores…
fr: utilisateurs, administrateurs …
gl: usuarios, administradores…
ru: пользователи, администраторы …
ta: பயனர்கள், நிர்வாகிகள்…

source: Account expiration
de: Ablauf des Benutzerkontos
es: Caducidad de la cuenta
fr: Expiration du compte
ru: Срок действия учётной записи
ta: கணக்கு காலாவதி

source: group
de: Gruppe
es: grupo
fr: groupe
gl: grupo
ru: группа
ta: குழு

source: Description
de: Beschreibung
es: Descripción
gl: Descripción
ru: Описание
ta: விவரம்

source: Email address
de: E-Mail-Adresse
es: Dirección de correo electrónico
fr: Courriel
gl: Correo electrónico
ru: Адрес электронной почты
ta: மின்னஞ்சல் முகவரி

source: User name
de: Name des Benutzers
es: Nombre de usuario
fr: Nom d'utilisateur
ru: Имя пользователя
ta: பயனர் பெயர்

source: Username editable by the invitee
de: Vom Eingeladenen bearbeitbarer Benutzername
es: Nombre de usuario editable por el invitado
fr: L'identifiant sera éditable par la personne invitée
gl: Nome de usuario editable polo invitado
ru: Имя пользователя может изменяться приглашённым пользователем
ta: அழைப்பாளரால் திருத்தக்கூடிய பயனர்பெயர்

source: New email address
de: Neue E-Mail-Adresse
es: Nueva dirección de correo electrónico
fr: Nouvelle adresse email
ru: Новый адрес электронной почты
ta: புதிய மின்னஞ்சல் முகவரி

source: Passcode
ru: Код доступа

source: Group creation failed.
de: Gruppenerstellung fehlgeschlagen.
es: Error en la creación del grupo.
fr: La création du groupe a échoué.
gl: Fallou a creación do grupo.
ru: Создание группы не удалось.
ta: குழு உருவாக்கம் தோல்வியடைந்தது.

source: The group %(group)s has been successfully created
es: El grupo %(group)s se ha creado correctamente
fr: Le groupe %(group)s a bien été créé
ru: Группа %(group)s была успешно создана
ta: குழு %(group)s வெற்றிகரமாக உருவாக்கப்பட்டுள்ளன

source: The group %(group)s has been successfully edited.
es: El grupo %(group)s ha sido modificado correctamente.
fr: Le groupe %(group)s a bien été édité.
ru: Группа %(group)s успешно отредактирована.
ta: குழு %(group)s வெற்றிகரமாக திருத்தப்பட்டுள்ளன.

source: Group edition failed.
de: Gruppenbearbeitung fehlgeschlagen.
es: Ha fallado la edición del grupo.
fr: L'édition du groupe a échoué.
gl: Fallou a actualización do grupo.
ru: Сбой при изменении группы.
ta: குழு பதிப்பு தோல்வியடைந்தது.

source: %(user_name)s has been removed from the group %(group_name)s
de: %(user_name)s wurde aus Gruppe %(group_name)s entfernt
es: %(user_name)s ha sido eliminado del grupo %(group_name)s
fr: L’utilisateur %(user_name)s a été retiré du groupe %(group_name)s
ru: %(user_name)s был удалён из группы %(group_name)s
ta: %(user_name)s குழுவிலிருந்து %(group_name)s அகற்றப்பட்டுள்ளன

source: The group %(group)s has been successfully deleted
es: El grupo %(group)s ha sido eliminado correctamente
fr: Le groupe %(group)s a bien été supprimé
ru: Группа %(group)s успешно удалена
ta: குழு %(group)s வெற்றிகரமாக நீக்கப்பட்டன

source: Info about yourself, such as your name.
de: Informationen zu Ihrer Person, z. B. Ihren Namen.
es: Información sobre ti, como tu nombre.
fr: Des informations personnelles vous concernant, comme votre nom.
gl: Información sobre ti, coma o teu nome.
ru: Информация о себе, такая как ваше имя.
ta: உங்கள் பெயர் போன்ற உங்களைப் பற்றிய செய்தி.

source: Your e-mail address.
de: Ihre E-Mail-Adresse.
es: Tu dirección de correo electrónico.
fr: Votre adresse courriel.
gl: Dirección de correo electrónico.
ru: Ваш e-mail адрес.
ta: உங்கள் மின்னஞ்சல் முகவரி.

source: Your postal address.
de: Ihre Postanschrift.
es: Tu dirección postal.
fr: Votre adresse postale.
gl: Dirección postal.
ru: Ваш почтовый адрес.
ta: உங்கள் அஞ்சல் முகவரி.

source: Your phone number.
de: Ihre Telefonnummer.
es: Número de teléfono.
fr: Votre numéro de téléphone.
gl: Número de teléfono.
ru: Ваш номер телефона.
ta: உங்கள் தொலைபேசி எண்.

source: Groups you belong to.
de: Gruppen, denen Sie angehören.
es: Grupos a los que perteneces.
fr: Les groupes auxquels vous appartenez.
gl: Grupos ós que pertences.
ru: Группы к которым вы принадлежите.
ta: நீங்கள் சேர்ந்த குழுக்கள்.

source: The client has not been added. Please check your information.
de: Der Kunde wurde nicht hinzugefügt. Bitte überprüfen Sie Ihre Angaben.
es: El cliente no ha sido añadido. Comprueba tu información.
fr: Le client n'a pas été ajouté. Veuillez vérifier vos informations.
gl: O cliente non foi engadido. Comproba a información.
ru: Клиент не был добавлен. Пожалуйста, проверьте вашу информацию.
ta: கிளையன்ட் சேர்க்கப்படவில்லை. உங்கள் தகவலை சரிபார்க்கவும்.

source: The client has been created.
de: Der Client wurde erstellt.
es: El cliente ha sido creado.
fr: Le client a été créé.
gl: O cliente foi creado.
ru: Клиент был создан.
ta: கிளையன்ட் உருவாக்கப்பட்டது.

source: The client has not been edited. Please check your information.
de: Der Client wurde nicht bearbeitet. Bitte überprüfen Sie Ihre Angaben.
es: El cliente no ha sido editado. Comprueba tu información.
fr: Le client n'a pas été édité. Veuillez vérifier vos informations.
gl: O cliente non foi actualizado. Comproba a información.
ru: Клиент не был отредактирован. Пожалуйста, проверьте вашу информацию.
ta: கிளையன்ட் திருத்தப்படவில்லை. உங்கள் தகவலை சரிபார்க்கவும்.

source: The client has been edited.
de: Der Kunde wurde bearbeitet.
es: El cliente ha sido editado.
fr: Le client a été édité.
gl: O cliente foi actualizado.
ru: Клиент был отредактирован.
ta: வாடிக்கையாளர் திருத்தப்பட்டார்.

source: The client has been deleted.
de: Der Client wurde gelöscht.
es: El cliente ha sido eliminado.
fr: Le client a été supprimé.
gl: O cliente foi eliminado.
ru: Клиент был удален.
ta: வாடிக்கையாளர் நீக்கப்பட்டார்.

source: Could not revoke this access
de: Dieser Zugang konnte nicht widerrufen werden
es: No se pudo revocar este acceso
fr: Impossible de révoquer cet accès
gl: Non foi posible revogar este acceso
ru: Не удалось отменить этот доступ
ta: இந்த அணுகலை ரத்து செய்ய முடியவில்லை

source: The access is already revoked
de: Der Zugang ist bereits widerrufen
es: El acceso ya está revocado
fr: L'accès a déjà été révoqué
gl: Acceso xa revogado
ru: Доступ уже был отозван
ta: அணுகல் ஏற்கனவே ரத்து செய்யப்பட்டுள்ளது

source: The access has been revoked
de: Der Zugang wurde widerrufen
es: El acceso ha sido revocado
fr: L'accès a été révoqué
gl: O acceso foi revogado
ru: Доступ был отозван
ta: அணுகல் ரத்து செய்யப்பட்டுள்ளது

source: Could not restore this access
de: Der Zugang konnte nicht wiederhergestellt werden
es: No se ha podido restablecer este acceso
fr: Impossible de restaurer cet accès
gl: Non foi posible restaurar este acceso
ru: Не удалось восстановить этот доступ
ta: இந்த அணுகலை மீட்டெடுக்க முடியவில்லை

source: The access is not revoked
de: Der Zugang wird nicht widerrufen
es: El acceso no está revocado
fr: L'accès n’est pas révoqué
gl: O acceso non está revogado
ru: Доступ не отозван
ta: அணுகல் ரத்து செய்யப்படவில்லை

source: The access has been restored
de: Der Zugang wurde wiederhergestellt
es: Se ha restablecido el acceso
fr: L'accès a été restauré
gl: O acceso foi restaurado
ru: Доступ восстановлен
ta: அணுகல் மீட்டமைக்கப்பட்டுள்ளது

source: This value is not a valid JSON string.
fr: Cette valeur n'est pas une chaîne JSON.
ru: Это значение не является правильной строкой JSON.

source: This value is not a valid JWK.
fr: Cette valeur n'est pas un JWK valide.
ru: Это значение не является допустимым JWK.

source: This is the name that will be displayed on the web interface, and notably on the consent page.
ru: Это имя будет отображаться в веб-интерфейсе, в частности, на странице согласия.

source: Contacts
de: Kontakte
es: Contactos
ru: Контакты
ta: தொடர்புகள்

source: Those are the email addresses of people responsible for the client.
ru: Это адреса электронной почты лиц, ответственных за клиента.

source: URL string of a web page providing information about the client.
ru: URL-адрес веб-страницы с информацией о клиенте.

source: Redirect URIs
de: Umleitungs-URIs
es: URIs de redirección
fr: URIs de redirection
gl: URIs de redirección
ru: URI перенаправления
ta: URIS ஐ திருப்பி விடுங்கள்

source: URIs for use in redirect-based flows such as the authorization code and implicit flows.
ru: URI для использования в потоках перенаправления, таких как код авторизации и неявные потоки.

source: Post logout redirect URIs
de: Umleitungs-URIs nach der Abmeldung
es: URIs de redirección tras cerrar sesión
fr: URIs de redirection post-déconnexion
gl: URIs de redirección tras pechar sesión
ru: URI перенаправления после выхода из системы
ta: இடுகையிடப்பட்ட யுஆர்ஐக்களைத் திருப்பி விடுங்கள்

source: URIs that the client may redirect users to after logging them out.
ru: URI, на которые клиент может перенаправлять пользователей после выхода из системы.

source: Grant types
de: Bewilligungsarten
es: Tipos de acceso
fr: Types de consentements
gl: Tipos de acceso
ru: Типы привилегий
ta: வகைகளை வழங்கவும்

source: Grant types that the client can use at the token endpoint.
ru: Типы разрешений, которые клиент может использовать на конечной точке токена.

source: Scope
de: Umfang
es: Ámbito
fr: Portée
gl: Ámbito
ru: Сфера охвата
ta: நோக்கம்

source: Kind of information that the client can request about users.
ru: Вид информации, которую клиент может запрашивать о пользователях.

source: Response types
de: Antworttypen
es: Tipos de respuesta
fr: Types de réponse
gl: Tipos de respostas
ru: Типы ответов
ta: மறுமொழி வகைகள்

source: Response types that the client can use at the authorization endpoint.
ru: Типы ответов, которые клиент может использовать на конечной точке авторизации.

source: Token endpoint authentication method
ru: Метод аутентификации конечной точки токена

source: Authentication method that the client will use at the token endpoint.
ru: Метод аутентификации, который клиент будет использовать на конечной точке токена.

source: Token audiences
de: Token-Zielgruppen
es: Audiencias del token
fr: Audiences des jetons
gl: Audiencias do token
ru: Аудитория токена
ta: கிள்ளாக்கு பார்வையாளர்கள்

source: The other clients that are intended to use the tokens emitted by this client.
ru: Другие клиенты, которым предназначены токены, выпущенные этим клиентом.

source: Logo URI
es: URI del logo
fr: URI du logo
gl: URI do logo
ru: URI логотипа
ta: லோகோ யூரி

source: An URL for the logo of this client.
ru: URL логотипа этого клиента.

source: Terms of service URI
de: Nutzungsbedingungen URI
es: URI de los términos de servicio
fr: URI des conditions d'utilisation
gl: URI dos termos do servizo
ru: URI условий обслуживания
ta: பணி விதிமுறைகள் யூரி

source: URL to the terms of service of the client.
ru: URL условий обслуживания клиента.

source: Policy URI
de: Richtlinien URI
es: URI de la política
fr: URI de la politique de confidentialité
gl: URI da política
ru: URI политики
ta: கொள்கை யூரி

source: URL to the privacy policy of the client.
ru: URL к политике конфиденциальности клиента.

source: Software ID
es: ID del software
fr: ID du logiciel
gl: ID do software
ru: ID программного обеспечения
ta: மென்பொருள் ஐடி

source: Unique identifier for this client, that should be stable in time and common for all identity providers.
ru: Уникальный идентификатор для этого клиента, который должен быть стабильным во времени и общим для всех провайдеров идентификации.

source: Software Version
es: Versión del software
fr: Version du logiciel
gl: Versión do software
ru: Версия программного обеспечения
ta: மென்பொருள் பதிப்பு

source: The version of the client.
ru: Версия этого клиента.

source: The public JSON Web Keys of the client.
ru: Открытые JSON Web Keys клиента.

source: JSON Web Keys URI
ru: URI JSON Web Keys

source: The URI that points to the public JSON Web Keys of the client.
ru: URI, указывающий на открытые JSON Web Keys клиента.

source: Trusted
fr: Application de confiance
ru: Доверенное

source: Whether the clients needs to display consent dialogs.
ru: Должны ли клиенты отображать диалоговые окна согласия.

source: You have been disconnected
de: Ihre Verbindung wurde unterbrochen
es: Has sido desconectado
fr: Vous avez été déconnecté·e
gl: Fuches desconectado
ru: Вы были отключены
ta: நீங்கள் துண்டிக்கப்பட்டுள்ளீர்கள்

source: You have not been disconnected
de: Ihre Verknüpfung wurde nicht unterbrochen
es: No has sido desconectado
fr: Vous n'avez pas été déconnecté
gl: Non fuches desconectado
ru: Вы не были отключены
ta: நீங்கள் துண்டிக்கப்படவில்லை

source: The token has successfully been revoked.
de: Das Token wurde erfolgreich widerrufen.
es: El token ha sido revocado correctamente.
fr: Le jeton a été révoqué avec succès.
gl: O token foi revogado correctamente.
ru: Токен успешно отозван.
ta: கிள்ளாக்கு வெற்றிகரமாக ரத்து செய்யப்பட்டுள்ளது.

source: Authorization interface
de: Autorisierungsschnittstelle
es: Interfaz de autorizaciones
fr: Interface de gestion des autorisations
ru: Интерфейс авторизации
ta: அங்கீகார இடைமுகம்

source: Network error
ru: Сетевая ошибка

source: %(website_name)s could not be reached. Are you sure to be connected to the internet?
ru: %(website_name)s недоступен. Вы уверены, что подключены к Интернету?
